FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/************************************************************************/
/*               (C) Fujitsu Semiconductor Europe GmbH (FSEU)           */
/*                                                                      */
/* The following software deliverable is intended for and must only be  */
/* used for reference and in an evaluation laboratory environment.      */
/* It is provided on an as-is basis without charge and is subject to    */
/* alterations.                                                         */
/* It is the user's obligation to fully test the software in its        */
/* environment and to ensure proper functionality, qualification and    */
/* compliance with component specifications.                            */
/*                                                                      */
/* In the event the software deliverable includes the use of open       */
/* source components, the provisions of the governing open source       */
/* license agreement shall apply with respect to such software          */
/* deliverable.                                                         */
/* FSEU does not warrant that the deliverables do not infringe any      */
/* third party intellectual property right (IPR). In the event that     */
/* the deliverables infringe a third party IPR it is the sole           */
/* responsibility of the customer to obtain necessary licenses to       */
/* continue the usage of the deliverable.                               */
/*                                                                      */
/* To the maximum extent permitted by applicable law FSEU disclaims all */
/* warranties, whether express or implied, in particular, but not       */
/* limited to, warranties of merchantability and fitness for a          */
/* particular purpose for which the deliverable is not designated.      */
/*                                                                      */
/* To the maximum extent permitted by applicable law, FSEU's liability  */
/* is restricted to intentional misconduct and gross negligence.        */
/* FSEU is not liable for consequential damages.                        */
/*                                                                      */
/* (V1.5)                                                               */
/************************************************************************/
/*                                                                      */
/*  Header File for Device MB9BF506N                                    */
/*  Version V1.00                                                       */
/*  Date    2011-01-21                                                  */
/*                                                                      */
/************************************************************************/

#ifndef _MB9BF506N_H_
    #define _MB9BF506N_H_

    #ifdef __cplusplus
    extern "C" {
    #endif


/******************************************************************************
* Configuration of the Cortex-M3 Processor and Core Peripherals
******************************************************************************/
    #define __MPU_PRESENT             1 /* FM3 provide an MPU                           */
    #define __NVIC_PRIO_BITS          4 /* FM3 uses 4 Bits for the Priority Levels      */
    #define __Vendor_SysTickConfig    0 /* Set to 1 if different SysTick Config is used */


/******************************************************************************
* Interrupt Number Definition
******************************************************************************/
    typedef enum IRQn
    {
        NMI_IRQn = -14,         /*  2 Non Maskable      */
        HardFault_IRQn = -13,   /*  3 Hard Fault        */
        MemManage_IRQn = -12,   /*  4 Memory Management */
        BusFault_IRQn = -11,    /*  5 Bus Fault         */
        UsageFault_IRQn = -10,  /*  6 Usage Fault       */
        SVC_IRQn = -5,          /* 11 SV Call           */
        DebugMonitor_IRQn = -4, /* 12 Debug Monitor     */
        PendSVC_IRQn = -2,      /* 14 Pend SV           */
        SysTick_IRQn = -1,      /* 15 System Tick       */

        CSV_IRQn = 0,           /* Clock Super Visor                        */
        SWDT_IRQn = 1,          /* Software Watchdog Timer                  */
        LVD_IRQn = 2,           /* Low Voltage Detector                     */
        WFG_IRQn = 3,           /* Wave Form Generator                      */
        EXINT0_7_IRQn = 4,      /* External Interrupt Request ch.0 to ch.7  */
        EXINT8_15_IRQn = 5,     /* External Interrupt Request ch.8 to ch.15 */
        DTIM_QDU_IRQn = 6,      /* Dual Timer / Quad Decoder                */
        MFS0RX_IRQn = 7,        /* MultiFunction Serial ch.0                */
        MFS0TX_IRQn = 8,        /* MultiFunction Serial ch.0                */
        MFS1RX_IRQn = 9,        /* MultiFunction Serial ch.1                */
        MFS1TX_IRQn = 10,       /* MultiFunction Serial ch.1                */
        MFS2RX_IRQn = 11,       /* MultiFunction Serial ch.2                */
        MFS2TX_IRQn = 12,       /* MultiFunction Serial ch.2                */
        MFS3RX_IRQn = 13,       /* MultiFunction Serial ch.3                */
        MFS3TX_IRQn = 14,       /* MultiFunction Serial ch.3                */
        MFS4RX_IRQn = 15,       /* MultiFunction Serial ch.4                */
        MFS4TX_IRQn = 16,       /* MultiFunction Serial ch.4                */
        MFS5RX_IRQn = 17,       /* MultiFunction Serial ch.5                */
        MFS5TX_IRQn = 18,       /* MultiFunction Serial ch.5                */
        MFS6RX_IRQn = 19,       /* MultiFunction Serial ch.6                */
        MFS6TX_IRQn = 20,       /* MultiFunction Serial ch.6                */
        MFS7RX_IRQn = 21,       /* MultiFunction Serial ch.7                */
        MFS7TX_IRQn = 22,       /* MultiFunction Serial ch.7                */
        PPG_IRQn = 23,          /* PPG                                      */
        OSC_PLL_WC_IRQn = 24,   /* OSC / PLL / Watch Counter                */
        ADC0_IRQn = 25,         /* ADC0                                     */
        ADC1_IRQn = 26,         /* ADC1                                     */
        ADC2_IRQn = 27,         /* ADC2                                     */
        FRTIM_IRQn = 28,        /* Free-run Timer                           */
        INCAP_IRQn = 29,        /* Input Capture                            */
        OUTCOMP_IRQn = 30,      /* Output Compare                           */
        BTIM_IRQn = 31,         /* Base Timer ch.0 to ch.7                  */
        CAN0_IRQn = 32,         /* CAN ch.0                                 */
        CAN1_IRQn = 33,         /* CAN ch.1                                 */
        USBF_IRQn = 34,         /* USB Function                             */
        USBF_USBH_IRQn = 35,    /* USB Function / USB HOST                  */
        /* Reserved       = 36,                                              */
        /* Reserved       = 37,                                              */
        DMAC0_IRQn = 38,     /* DMAC ch.0                                */
        DMAC1_IRQn = 39,     /* DMAC ch.1                                */
        DMAC2_IRQn = 40,     /* DMAC ch.2                                */
        DMAC3_IRQn = 41,     /* DMAC ch.3                                */
        DMAC4_IRQn = 42,     /* DMAC ch.4                                */
        DMAC5_IRQn = 43,     /* DMAC ch.5                                */
        DMAC6_IRQn = 44,     /* DMAC ch.6                                */
        DMAC7_IRQn = 45,     /* DMAC ch.7                                */
        /* Reserved       = 46,                                              */
        /* Reserved       = 47,                                              */
    } IRQn_Type;


    #include "core_cm3.h"
    #include "system_mb9bf50x.h"
    #include <stdint.h>

    #define SUCCESS     0
    #define ERROR       -1

