FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #ifndef NULL
        #define NULL    0
    #endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

    #if defined( __CC_ARM )
        #pragma anon_unions
    #endif

/******************************************************************************
* Flash_IF_MODULE
******************************************************************************/
/* Flash interface registers */
    typedef struct
    {
        __IO uint32_t FASZR;
        __IO uint32_t FRWTR;
        __IO uint32_t FSTR;
        uint8_t RESERVED0[ 4 ];
        __IO uint32_t FSYNDN;
        uint8_t RESERVED1[ 236 ];
        __IO uint32_t CRTRMM;
    } FM3_FIF_TypeDef;

/******************************************************************************
* Clock_Reset_MODULE
******************************************************************************/
/* Clock and reset registers */
    typedef struct
    {
        __IO uint8_t SCM_CTL;
        uint8_t RESERVED0[ 3 ];
        __IO uint8_t SCM_STR;
        uint8_t RESERVED1[ 3 ];
        __IO uint32_t STB_CTL;
        __IO uint16_t RST_STR;
        uint8_t RESERVED2[ 2 ];
        __IO uint8_t BSC_PSR;
        uint8_t RESERVED3[ 3 ];
        __IO uint8_t APBC0_PSR;
        uint8_t RESERVED4[ 3 ];
        __IO uint8_t APBC1_PSR;
        uint8_t RESERVED5[ 3 ];
        __IO uint8_t APBC2_PSR;
        uint8_t RESERVED6[ 3 ];
        __IO uint8_t SWC_PSR;
        uint8_t RESERVED7[ 7 ];
        __IO uint8_t TTC_PSR;
        uint8_t RESERVED8[ 7 ];
        __IO uint8_t CSW_TMR;
        uint8_t RESERVED9[ 3 ];
        __IO uint8_t PSW_TMR;
        uint8_t RESERVED10[ 3 ];
        __IO uint8_t PLL_CTL1;
        uint8_t RESERVED11[ 3 ];
        __IO uint8_t PLL_CTL2;
        uint8_t RESERVED12[ 3 ];
        __IO uint16_t CSV_CTL;
        uint8_t RESERVED13[ 2 ];
        __IO uint8_t CSV_STR;
        uint8_t RESERVED14[ 3 ];
        __IO uint16_t FCSWH_CTL;
        uint8_t RESERVED15[ 2 ];
        __IO uint16_t FCSWL_CTL;
        uint8_t RESERVED16[ 2 ];
        __IO uint16_t FCSWD_CTL;
        uint8_t RESERVED17[ 2 ];
        __IO uint8_t DBWDT_CTL;
        uint8_t RESERVED18[ 11 ];
        __IO uint8_t INT_ENR;
        uint8_t RESERVED19[ 3 ];
        __IO uint8_t INT_STR;
        uint8_t RESERVED20[ 3 ];
        __IO uint8_t INT_CLR;
    } FM3_CRG_TypeDef;

/******************************************************************************
* HWWDT_MODULE
******************************************************************************/
/* Hardware watchdog registers */
    typedef struct
    {
        __IO uint32_t WDG_LDR;
        __IO uint32_t WDG_VLR;
        __IO uint8_t WDG_CTL;
        uint8_t RESERVED0[ 3 ];
        __IO uint8_t WDG_ICL;
        uint8_t RESERVED1[ 3 ];
        __IO uint8_t WDG_RIS;
        uint8_t RESERVED2[ 3055 ];
        __IO uint32_t WDG_LCK;
    } FM3_HWWDT_TypeDef;

/******************************************************************************
* SWWDT_MODULE
******************************************************************************/
/* Software watchdog registers */
    typedef struct
    {
        __IO uint32_t WDOGLOAD;
        __IO uint32_t WDOGVALUE;
        __IO uint8_t WDOGCONTROL;
        uint8_t RESERVED0[ 3 ];
        __IO uint32_t WDOGINTCLR;
        __IO uint8_t WDOGRIS;
        uint8_t RESERVED1[ 3055 ];
        __IO uint32_t WDOGLOCK;
    } FM3_SWWDT_TypeDef;

/******************************************************************************
* DTIM_MODULE
******************************************************************************/
/* Dual timer 1/2 registers */
    typedef struct
    {
        __IO uint32_t TIMER1LOAD;
        __IO uint32_t TIMER1VALUE;
        __IO uint32_t TIMER1CONTROL;
        __IO uint32_t TIMER1INTCLR;
        __IO uint32_t TIMER1RIS;
        __IO uint32_t TIMER1MIS;
        __IO uint32_t TIMER1BGLOAD;
        uint8_t RESERVED0[ 4 ];
        __IO uint32_t TIMER2LOAD;
        __IO uint32_t TIMER2VALUE;
        __IO uint32_t TIMER2CONTROL;
        __IO uint32_t TIMER2INTCLR;
        __IO uint32_t TIMER2RIS;
        __IO uint32_t TIMER2MIS;
        __IO uint32_t TIMER2BGLOAD;
    } FM3_DTIM_TypeDef;

/******************************************************************************
* MFT_FRT_MODULE
******************************************************************************/
/* Multifunction Timer unit 0 Free Running Timer registers */
    typedef struct
    {
        uint8_t RESERVED0[ 40 ];
        __IO uint16_t TCCP0;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t TCDT0;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t TCSA0;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t TCSB0;
        uint8_t RESERVED4[ 2 ];
        __IO uint16_t TCCP1;
        uint8_t RESERVED5[ 2 ];
        __IO uint16_t TCDT1;
        uint8_t RESERVED6[ 2 ];
        __IO uint16_t TCSA1;
        uint8_t RESERVED7[ 2 ];
        __IO uint16_t TCSB1;
        uint8_t RESERVED8[ 2 ];
        __IO uint16_t TCCP2;
        uint8_t RESERVED9[ 2 ];
        __IO uint16_t TCDT2;
        uint8_t RESERVED10[ 2 ];
        __IO uint16_t TCSA2;
        uint8_t RESERVED11[ 2 ];
        __IO uint16_t TCSB2;
    } FM3_MFT_FRT_TypeDef;

/******************************************************************************
* MFT_OCU_MODULE
******************************************************************************/
/* Multifunction Timer unit 0 Output Compare Unit registers */
    typedef struct
    {
        __IO uint16_t OCCP0;
        uint8_t RESERVED0[ 2 ];
        __IO uint16_t OCCP1;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t OCCP2;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t OCCP3;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t OCCP4;
        uint8_t RESERVED4[ 2 ];
        __IO uint16_t OCCP5;
        uint8_t RESERVED5[ 2 ];
        __IO uint8_t OCSA10;
        __IO uint8_t OCSB10;
        uint8_t RESERVED6[ 2 ];
        __IO uint8_t OCSA32;
        __IO uint8_t OCSB32;
        uint8_t RESERVED7[ 2 ];
        __IO uint8_t OCSA54;
        __IO uint8_t OCSB54;
        uint8_t RESERVED8[ 3 ];
        __IO uint8_t OCSC;
        uint8_t RESERVED9[ 50 ];
        __IO uint8_t OCFS10;
        __IO uint8_t OCFS32;
        uint8_t RESERVED10[ 2 ];
        __IO uint8_t OCFS54;
    } FM3_MFT_OCU_TypeDef;

