FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* MFT_WFG_MODULE
******************************************************************************/
/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
    typedef struct
    {
        uint8_t RESERVED0[ 128 ];
        __IO uint16_t WFTM10;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t WFTM32;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t WFTM54;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t WFSA10;
        uint8_t RESERVED4[ 2 ];
        __IO uint16_t WFSA32;
        uint8_t RESERVED5[ 2 ];
        __IO uint16_t WFSA54;
        uint8_t RESERVED6[ 2 ];
        __IO uint16_t WFIR;
        uint8_t RESERVED7[ 2 ];
        __IO uint16_t NZCL;
    } FM3_MFT_WFG_TypeDef;

/******************************************************************************
* MFT_ICU_MODULE
******************************************************************************/
/* Multifunction Timer unit 0 Input Capture Unit registers */
    typedef struct
    {
        uint8_t RESERVED0[ 96 ];
        __IO uint8_t ICFS10;
        __IO uint8_t ICFS32;
        uint8_t RESERVED1[ 6 ];
        __IO uint16_t ICCP0;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t ICCP1;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t ICCP2;
        uint8_t RESERVED4[ 2 ];
        __IO uint16_t ICCP3;
        uint8_t RESERVED5[ 2 ];
        __IO uint8_t ICSA10;
        __IO uint8_t ICSB10;
        uint8_t RESERVED6[ 2 ];
        __IO uint8_t ICSA32;
        __IO uint8_t ICSB32;
    } FM3_MFT_ICU_TypeDef;

/******************************************************************************
* MFT_ADCMP_MODULE
******************************************************************************/
/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
    typedef struct
    {
        uint8_t RESERVED0[ 160 ];
        __IO uint16_t ACCP0;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t ACCPDN0;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t ACCP1;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t ACCPDN1;
        uint8_t RESERVED4[ 2 ];
        __IO uint16_t ACCP2;
        uint8_t RESERVED5[ 2 ];
        __IO uint16_t ACCPDN2;
        uint8_t RESERVED6[ 2 ];
        __IO uint8_t ACSB;
        uint8_t RESERVED7[ 3 ];
        __IO uint16_t ACSA;
        uint8_t RESERVED8[ 2 ];
        __IO uint16_t ATSA;
    } FM3_MFT_ADCMP_TypeDef;

/******************************************************************************
* MFT_PPG_MODULE
******************************************************************************/
/* Multifunction Timer PPG registers */
    typedef struct
    {
        uint8_t RESERVED0;
        __IO uint8_t TTCR0;
        uint8_t RESERVED1[ 7 ];
        __IO uint8_t COMP0;
        uint8_t RESERVED2[ 2 ];
        __IO uint8_t COMP2;
        uint8_t RESERVED3[ 4 ];
        __IO uint8_t COMP4;
        uint8_t RESERVED4[ 2 ];
        __IO uint8_t COMP6;
        uint8_t RESERVED5[ 12 ];
        __IO uint8_t TTCR1;
        uint8_t RESERVED6[ 7 ];
        __IO uint8_t COMP1;
        uint8_t RESERVED7[ 2 ];
        __IO uint8_t COMP3;
        uint8_t RESERVED8[ 4 ];
        __IO uint8_t COMP5;
        uint8_t RESERVED9[ 2 ];
        __IO uint8_t COMP7;
        uint8_t RESERVED10[ 203 ];
        __IO uint16_t TRG;
        uint8_t RESERVED11[ 2 ];
        __IO uint16_t REVC;
        uint8_t RESERVED12[ 250 ];
        __IO uint8_t PPGC1;
        __IO uint8_t PPGC0;
        uint8_t RESERVED13[ 2 ];
        __IO uint8_t PPGC3;
        __IO uint8_t PPGC2;
        uint8_t RESERVED14[ 2 ];
        union
        {
            __IO uint16_t PRL0;
            struct
            {
                __IO uint8_t PRLL0;
                __IO uint8_t PRLH0;
            };
        };
        uint8_t RESERVED15[ 2 ];
        union
        {
            __IO uint16_t PRL1;
            struct
            {
                __IO uint8_t PRLL1;
                __IO uint8_t PRLH1;
            };
        };
        uint8_t RESERVED16[ 2 ];
        union
        {
            __IO uint16_t PRL2;
            struct
            {
                __IO uint8_t PRLL2;
                __IO uint8_t PRLH2;
            };
        };
        uint8_t RESERVED17[ 2 ];
        union
        {
            __IO uint16_t PRL3;
            struct
            {
                __IO uint8_t PRLL3;
                __IO uint8_t PRLH3;
            };
        };
        uint8_t RESERVED18[ 2 ];
        __IO uint8_t GATEC0;
        uint8_t RESERVED19[ 39 ];
        __IO uint8_t PPGC5;
        __IO uint8_t PPGC4;
        uint8_t RESERVED20[ 2 ];
        __IO uint8_t PPGC7;
        __IO uint8_t PPGC6;
        uint8_t RESERVED21[ 2 ];
        union
        {
            __IO uint16_t PRL4;
            struct
            {
                __IO uint8_t PRLL4;
                __IO uint8_t PRLH4;
            };
        };
        uint8_t RESERVED22[ 2 ];
        union
        {
            __IO uint16_t PRL5;
            struct
            {
                __IO uint8_t PRLL5;
                __IO uint8_t PRLH5;
            };
        };
        uint8_t RESERVED23[ 2 ];
        union
        {
            __IO uint16_t PRL6;
            struct
            {
                __IO uint8_t PRLL6;
                __IO uint8_t PRLH6;
            };
        };
        uint8_t RESERVED24[ 2 ];
        union
        {
            __IO uint16_t PRL7;
            struct
            {
                __IO uint8_t PRLL7;
                __IO uint8_t PRLH7;
            };
        };
        uint8_t RESERVED25[ 2 ];
        __IO uint8_t GATEC4;
        uint8_t RESERVED26[ 39 ];
        __IO uint8_t PPGC9;
        __IO uint8_t PPGC8;
        uint8_t RESERVED27[ 2 ];
        __IO uint8_t PPGC11;
        __IO uint8_t PPGC10;
        uint8_t RESERVED28[ 2 ];
        union
        {
            __IO uint16_t PRL8;
            struct
            {
                __IO uint8_t PRLL8;
                __IO uint8_t PRLH8;
            };
        };
        uint8_t RESERVED29[ 2 ];
        union
        {
            __IO uint16_t PRL9;
            struct
            {
                __IO uint8_t PRLL9;
                __IO uint8_t PRLH9;
            };
        };
        uint8_t RESERVED30[ 2 ];
        union
        {
            __IO uint16_t PRL10;
            struct
            {
                __IO uint8_t PRLL10;
                __IO uint8_t PRLH10;
            };
        };
        uint8_t RESERVED31[ 2 ];
        union
        {
            __IO uint16_t PRL11;
            struct
            {
                __IO uint8_t PRLL11;
                __IO uint8_t PRLH11;
            };
        };
        uint8_t RESERVED32[ 2 ];
        __IO uint8_t GATEC8;
        uint8_t RESERVED33[ 39 ];
        __IO uint8_t PPGC13;
        __IO uint8_t PPGC12;
        uint8_t RESERVED34[ 2 ];
        __IO uint8_t PPGC15;
        __IO uint8_t PPGC14;
        uint8_t RESERVED35[ 2 ];
        union
        {
            __IO uint16_t PRL12;
            struct
            {
                __IO uint8_t PRLL12;
                __IO uint8_t PRLH12;
            };
        };
        uint8_t RESERVED36[ 2 ];
        union
        {
            __IO uint16_t PRL13;
            struct
            {
                __IO uint8_t PRLL13;
                __IO uint8_t PRLH13;
            };
        };
        uint8_t RESERVED37[ 2 ];
        union
        {
            __IO uint16_t PRL14;
            struct
            {
                __IO uint8_t PRLL14;
                __IO uint8_t PRLH14;
            };
        };
        uint8_t RESERVED38[ 2 ];
        union
        {
            __IO uint16_t PRL15;
            struct
            {
                __IO uint8_t PRLL15;
                __IO uint8_t PRLH15;
            };
        };
        uint8_t RESERVED39[ 2 ];
        __IO uint8_t GATEC12;
    } FM3_MFT_PPG_TypeDef;

