FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* BT_PPG_MODULE
******************************************************************************/
/* Base Timer 0 PPG registers */
    typedef struct
    {
        __IO uint16_t PRLL;
        uint8_t RESERVED0[ 2 ];
        __IO uint16_t PRLH;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t TMR;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t TMCR;
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t STC;
        __IO uint8_t TMCR2;
    } FM3_BT_PPG_TypeDef;

/******************************************************************************
* BT_PWM_MODULE
******************************************************************************/
/* Base Timer 0 PWM registers */
    typedef struct
    {
        __IO uint16_t PCSR;
        uint8_t RESERVED0[ 2 ];
        __IO uint16_t PDUT;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t TMR;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t TMCR;
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t STC;
        __IO uint8_t TMCR2;
    } FM3_BT_PWM_TypeDef;

/******************************************************************************
* BT_RT_MODULE
******************************************************************************/
/* Base Timer 0 RT registers */
    typedef struct
    {
        __IO uint16_t PCSR;
        uint8_t RESERVED0[ 6 ];
        __IO uint16_t TMR;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t TMCR;
        uint8_t RESERVED2[ 2 ];
        __IO uint8_t STC;
        __IO uint8_t TMCR2;
    } FM3_BT_RT_TypeDef;

/******************************************************************************
* BT_PWC_MODULE
******************************************************************************/
/* Base Timer 0 PWC registers */
    typedef struct
    {
        uint8_t RESERVED0[ 4 ];
        __IO uint16_t DTBF;
        uint8_t RESERVED1[ 6 ];
        __IO uint16_t TMCR;
        uint8_t RESERVED2[ 2 ];
        __IO uint8_t STC;
        __IO uint8_t TMCR2;
    } FM3_BT_PWC_TypeDef;

/******************************************************************************
* BTIOSEL03_MODULE
******************************************************************************/
/* Base Timer I/O selector channel 0 - channel 3 registers */
    typedef struct
    {
        uint8_t RESERVED0;
        __IO uint8_t BTSEL0123;
    } FM3_BTIOSEL03_TypeDef;

/******************************************************************************
* BTIOSEL47_MODULE
******************************************************************************/
/* Base Timer I/O selector channel 4 - channel 7 registers */
    typedef struct
    {
        uint8_t RESERVED0;
        __IO uint8_t BTSEL4567;
    } FM3_BTIOSEL47_TypeDef;

/******************************************************************************
* SBSSR_MODULE
******************************************************************************/
/* Software based Simulation Startup (Base Timer) register */
    typedef struct
    {
        __IO uint16_t BTSSSR;
    } FM3_SBSSR_TypeDef;

/******************************************************************************
* QPRC_MODULE
******************************************************************************/
/* Quad position and revolution counter channel 0 registers */
    typedef struct
    {
        __IO uint16_t QPCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint16_t QRCR;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t QPCCR;
        uint8_t RESERVED2[ 2 ];
        __IO uint16_t QPRCR;
        uint8_t RESERVED3[ 2 ];
        __IO uint16_t QMPR;
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t QICR;
            struct
            {
                __IO uint8_t QICRL;
                __IO uint8_t QICRH;
            };
        };
        uint8_t RESERVED5[ 2 ];
        union
        {
            __IO uint16_t QCR;
            struct
            {
                __IO uint8_t QCRL;
                __IO uint8_t QCRH;
            };
        };
        uint8_t RESERVED6[ 2 ];
        __IO uint16_t QECR;
    } FM3_QPRC_TypeDef;

/******************************************************************************
* ADC12_MODULE
******************************************************************************/
/* 12-bit ADC unit 0 registers */
    typedef struct
    {
        __IO uint8_t ADSR;
        __IO uint8_t ADCR;
        uint8_t RESERVED0[ 6 ];
        __IO uint8_t SFNS;
        __IO uint8_t SCCR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint32_t SCFD;
            struct
            {
                __IO uint16_t SCFDL;
                __IO uint16_t SCFDH;
            };
        };
        union
        {
            __IO uint16_t SCIS23;
            struct
            {
                __IO uint8_t SCIS2;
                __IO uint8_t SCIS3;
            };
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t SCIS01;
            struct
            {
                __IO uint8_t SCIS0;
                __IO uint8_t SCIS1;
            };
        };
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t PFNS;
        __IO uint8_t PCCR;
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint32_t PCFD;
            struct
            {
                __IO uint16_t PCFDL;
                __IO uint16_t PCFDH;
            };
        };
        __IO uint8_t PCIS;
        uint8_t RESERVED5[ 3 ];
        __IO uint8_t CMPCR;
        uint8_t RESERVED6;
        __IO uint16_t CMPD;
        union
        {
            __IO uint16_t ADSS23;
            struct
            {
                __IO uint8_t ADSS2;
                __IO uint8_t ADSS3;
            };
        };
        uint8_t RESERVED7[ 2 ];
        union
        {
            __IO uint16_t ADSS01;
            struct
            {
                __IO uint8_t ADSS0;
                __IO uint8_t ADSS1;
            };
        };
        uint8_t RESERVED8[ 2 ];
        union
        {
            __IO uint16_t ADST01;
            struct
            {
                __IO uint8_t ADST1;
                __IO uint8_t ADST0;
            };
        };
        uint8_t RESERVED9[ 2 ];
        __IO uint8_t ADCT;
        uint8_t RESERVED10[ 3 ];
        __IO uint8_t PRTSL;
        __IO uint8_t SCTSL;
        uint8_t RESERVED11[ 2 ];
        __IO uint8_t ADCEN;
    } FM3_ADC_TypeDef;

