FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* CRTRIM_MODULE
******************************************************************************/
/* CR trimming registers */
    typedef struct
    {
        __IO uint8_t MCR_PSR;
        uint8_t RESERVED0[ 3 ];
        __IO uint16_t MCR_FTRM;
        uint8_t RESERVED1[ 6 ];
        __IO uint32_t MCR_RLR;
    } FM3_CRTRIM_TypeDef;

/******************************************************************************
* EXTI_MODULE
******************************************************************************/
/* External interrupt registers */
    typedef struct
    {
        __IO uint16_t ENIR;
        uint8_t RESERVED0[ 2 ];
        __IO uint16_t EIRR;
        uint8_t RESERVED1[ 2 ];
        __IO uint16_t EICL;
        uint8_t RESERVED2[ 2 ];
        __IO uint32_t ELVR;
        uint8_t RESERVED3[ 4 ];
        __IO uint8_t NMIRR;
        uint8_t RESERVED4[ 3 ];
        __IO uint8_t NMICL;
    } FM3_EXTI_TypeDef;

/******************************************************************************
* INTREQ_MODULE
******************************************************************************/
/* Interrupt request read registers */
    typedef struct
    {
        __IO uint32_t DRQSEL;
        uint8_t RESERVED0[ 12 ];
        __IO uint32_t EXC02MON;
        __IO uint32_t IRQ00MON;
        __IO uint32_t IRQ01MON;
        __IO uint32_t IRQ02MON;
        __IO uint32_t IRQ03MON;
        __IO uint32_t IRQ04MON;
        __IO uint32_t IRQ05MON;
        __IO uint32_t IRQ06MON;
        __IO uint32_t IRQ07MON;
        __IO uint32_t IRQ08MON;
        __IO uint32_t IRQ09MON;
        __IO uint32_t IRQ10MON;
        __IO uint32_t IRQ11MON;
        __IO uint32_t IRQ12MON;
        __IO uint32_t IRQ13MON;
        __IO uint32_t IRQ14MON;
        __IO uint32_t IRQ15MON;
        __IO uint32_t IRQ16MON;
        __IO uint32_t IRQ17MON;
        __IO uint32_t IRQ18MON;
        __IO uint32_t IRQ19MON;
        __IO uint32_t IRQ20MON;
        __IO uint32_t IRQ21MON;
        __IO uint32_t IRQ22MON;
        __IO uint32_t IRQ23MON;
        __IO uint32_t IRQ24MON;
        __IO uint32_t IRQ25MON;
        __IO uint32_t IRQ26MON;
        __IO uint32_t IRQ27MON;
        __IO uint32_t IRQ28MON;
        __IO uint32_t IRQ29MON;
        __IO uint32_t IRQ30MON;
        __IO uint32_t IRQ31MON;
        __IO uint32_t IRQ32MON;
        __IO uint32_t IRQ33MON;
        __IO uint32_t IRQ34MON;
        __IO uint32_t IRQ35MON;
        __IO uint32_t IRQ36MON;
        __IO uint32_t IRQ37MON;
        __IO uint32_t IRQ38MON;
        __IO uint32_t IRQ39MON;
        __IO uint32_t IRQ40MON;
        __IO uint32_t IRQ41MON;
        __IO uint32_t IRQ42MON;
        __IO uint32_t IRQ43MON;
        __IO uint32_t IRQ44MON;
        __IO uint32_t IRQ45MON;
        __IO uint32_t IRQ46MON;
        __IO uint32_t IRQ47MON;
    } FM3_INTREQ_TypeDef;

/******************************************************************************
* GPIO_MODULE
******************************************************************************/
/* General purpose I/O registers */
    typedef struct
    {
        __IO uint32_t PFR0;
        __IO uint32_t PFR1;
        __IO uint32_t PFR2;
        __IO uint32_t PFR3;
        __IO uint32_t PFR4;
        __IO uint32_t PFR5;
        __IO uint32_t PFR6;
        uint8_t RESERVED0[ 4 ];
        __IO uint32_t PFR8;
        uint8_t RESERVED1[ 220 ];
        __IO uint32_t PCR0;
        __IO uint32_t PCR1;
        __IO uint32_t PCR2;
        __IO uint32_t PCR3;
        __IO uint32_t PCR4;
        __IO uint32_t PCR5;
        __IO uint32_t PCR6;
        uint8_t RESERVED2[ 228 ];
        __IO uint32_t DDR0;
        __IO uint32_t DDR1;
        __IO uint32_t DDR2;
        __IO uint32_t DDR3;
        __IO uint32_t DDR4;
        __IO uint32_t DDR5;
        __IO uint32_t DDR6;
        uint8_t RESERVED3[ 4 ];
        __IO uint32_t DDR8;
        uint8_t RESERVED4[ 220 ];
        __IO uint32_t PDIR0;
        __IO uint32_t PDIR1;
        __IO uint32_t PDIR2;
        __IO uint32_t PDIR3;
        __IO uint32_t PDIR4;
        __IO uint32_t PDIR5;
        __IO uint32_t PDIR6;
        uint8_t RESERVED5[ 4 ];
        __IO uint32_t PDIR8;
        uint8_t RESERVED6[ 220 ];
        __IO uint32_t PDOR0;
        __IO uint32_t PDOR1;
        __IO uint32_t PDOR2;
        __IO uint32_t PDOR3;
        __IO uint32_t PDOR4;
        __IO uint32_t PDOR5;
        __IO uint32_t PDOR6;
        uint8_t RESERVED7[ 4 ];
        __IO uint32_t PDOR8;
        uint8_t RESERVED8[ 220 ];
        __IO uint32_t ADE;
        uint8_t RESERVED9[ 124 ];
        __IO uint32_t SPSR;
        uint8_t RESERVED10[ 124 ];
        __IO uint32_t EPFR00;
        __IO uint32_t EPFR01;
        __IO uint32_t EPFR02;
        uint8_t RESERVED11[ 4 ];
        __IO uint32_t EPFR04;
        __IO uint32_t EPFR05;
        __IO uint32_t EPFR06;
        __IO uint32_t EPFR07;
        __IO uint32_t EPFR08;
        __IO uint32_t EPFR09;
        __IO uint32_t EPFR10;
    } FM3_GPIO_TypeDef;

/******************************************************************************
* LVD_MODULE
******************************************************************************/
/* Low voltage detection registers */
    typedef struct
    {
        __IO uint8_t LVD_CTL;
        uint8_t RESERVED0[ 3 ];
        __IO uint8_t LVD_STR;
        uint8_t RESERVED1[ 3 ];
        __IO uint8_t LVD_CLR;
        uint8_t RESERVED2[ 3 ];
        __IO uint32_t LVD_RLR;
        __IO uint8_t LVD_STR2;
    } FM3_LVD_TypeDef;

/******************************************************************************
* USBCLK
******************************************************************************/
/* USB clock registers */
    typedef struct
    {
        __IO uint8_t UCCR;
        uint8_t RESERVED0[ 3 ];
        __IO uint8_t UPCR1;
        uint8_t RESERVED1[ 3 ];
        __IO uint8_t UPCR2;
        uint8_t RESERVED2[ 3 ];
        __IO uint8_t UPCR3;
        uint8_t RESERVED3[ 3 ];
        __IO uint8_t UPCR4;
        uint8_t RESERVED4[ 3 ];
        __IO uint8_t UP_STR;
        uint8_t RESERVED5[ 3 ];
        __IO uint8_t UPINT_ENR;
        uint8_t RESERVED6[ 3 ];
        __IO uint8_t UPINT_CLR;
        uint8_t RESERVED7[ 3 ];
        __IO uint8_t UPINT_STR;
        uint8_t RESERVED8[ 15 ];
        __IO uint8_t USBEN;
    } FM3_USBCLK_TypeDef;

