FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* CANPRE_MODULE
******************************************************************************/
/* CAN prescaler register */
    typedef struct
    {
        __IO uint8_t CANPRE;
    } FM3_CANPRE_TypeDef;

/******************************************************************************
* MFS03_UART_MODULE
******************************************************************************/
/* UART asynchronous channel 0 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
    } FM3_MFS03_UART_TypeDef;

/******************************************************************************
* MFS03_CSIO_MODULE
******************************************************************************/
/* UART synchronous channel 0 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
    } FM3_MFS03_CSIO_TypeDef;

/******************************************************************************
* MFS03_LIN_MODULE
******************************************************************************/
/* UART LIN channel 0 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
    } FM3_MFS03_LIN_TypeDef;

/******************************************************************************
* MFS03_I2C_MODULE
******************************************************************************/
/* I2C channel 0 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t IBCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t IBSR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t ISBA;
        __IO uint8_t ISMK;
    } FM3_MFS03_I2C_TypeDef;

/******************************************************************************
* MFS47_UART_MODULE
******************************************************************************/
/* UART asynchronous channel 4 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
        uint8_t RESERVED3[ 6 ];
        union
        {
            __IO uint16_t FCR;
            struct
            {
                __IO uint8_t FCR0;
                __IO uint8_t FCR1;
            };
        };
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t FBYTE;
            struct
            {
                __IO uint8_t FBYTE1;
                __IO uint8_t FBYTE2;
            };
        };
    } FM3_MFS47_UART_TypeDef;

/******************************************************************************
* MFS47_CSIO_MODULE
******************************************************************************/
/* UART synchronous channel 4 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
        uint8_t RESERVED3[ 6 ];
        union
        {
            __IO uint16_t FCR;
            struct
            {
                __IO uint8_t FCR0;
                __IO uint8_t FCR1;
            };
        };
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t FBYTE;
            struct
            {
                __IO uint8_t FBYTE1;
                __IO uint8_t FBYTE2;
            };
        };
    } FM3_MFS47_CSIO_TypeDef;

/******************************************************************************
* MFS47_LIN_MODULE
******************************************************************************/
/* UART LIN channel 4 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t SCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t ESCR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
        uint8_t RESERVED3[ 6 ];
        union
        {
            __IO uint16_t FCR;
            struct
            {
                __IO uint8_t FCR0;
                __IO uint8_t FCR1;
            };
        };
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t FBYTE;
            struct
            {
                __IO uint8_t FBYTE1;
                __IO uint8_t FBYTE2;
            };
        };
    } FM3_MFS47_LIN_TypeDef;

