FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* MFS47_I2C_MODULE
******************************************************************************/
/* I2C channel 4 registers */
    typedef struct
    {
        __IO uint8_t SMR;
        __IO uint8_t IBCR;
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t IBSR;
        __IO uint8_t SSR;
        uint8_t RESERVED1[ 2 ];
        union
        {
            __IO uint16_t RDR;
            __IO uint16_t TDR;
        };
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t BGR;
            struct
            {
                __IO uint8_t BGR0;
                __IO uint8_t BGR1;
            };
        };
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t ISBA;
        __IO uint8_t ISMK;
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t FCR;
            struct
            {
                __IO uint8_t FCR0;
                __IO uint8_t FCR1;
            };
        };
        uint8_t RESERVED5[ 2 ];
        union
        {
            __IO uint16_t FBYTE;
            struct
            {
                __IO uint8_t FBYTE1;
                __IO uint8_t FBYTE2;
            };
        };
    } FM3_MFS47_I2C_TypeDef;

/******************************************************************************
* CRC_MODULE
******************************************************************************/
/* CRC registers */
    typedef struct
    {
        __IO uint8_t CRCCR;
        uint8_t RESERVED0[ 3 ];
        __IO uint32_t CRCINIT;
        union
        {
            __IO uint32_t CRCIN;
            struct
            {
                union
                {
                    __IO uint16_t CRCINL;
                    struct
                    {
                        __IO uint8_t CRCINLL;
                        __IO uint8_t CRCINLH;
                    };
                };
                union
                {
                    __IO uint16_t CRCINH;
                    struct
                    {
                        __IO uint8_t CRCINHL;
                        __IO uint8_t CRCINHH;
                    };
                };
            };
        };
        __IO uint32_t CRCR;
    } FM3_CRC_TypeDef;

/******************************************************************************
* WC_MODULE
******************************************************************************/
/* Watch counter registers */
    typedef struct
    {
        __IO uint8_t WCRD;
        __IO uint8_t WCRL;
        __IO uint8_t WCCR;
        uint8_t RESERVED0[ 13 ];
        __IO uint16_t CLK_SEL;
        uint8_t RESERVED1[ 2 ];
        __IO uint8_t CLK_EN;
    } FM3_WC_TypeDef;

/******************************************************************************
* EXBUS_MODULE
******************************************************************************/
/* External bus interface registers */
    typedef struct
    {
        __IO uint32_t MODE0;
        __IO uint32_t MODE1;
        __IO uint32_t MODE2;
        __IO uint32_t MODE3;
        uint8_t RESERVED0[ 12 ];
        __IO uint32_t MODE7;
        __IO uint32_t TIM0;
        __IO uint32_t TIM1;
        __IO uint32_t TIM2;
        __IO uint32_t TIM3;
        uint8_t RESERVED1[ 12 ];
        __IO uint32_t TIM7;
        __IO uint32_t AREA0;
        __IO uint32_t AREA1;
        __IO uint32_t AREA2;
        __IO uint32_t AREA3;
        uint8_t RESERVED2[ 12 ];
        __IO uint32_t AREA7;
    } FM3_EXBUS_TypeDef;

/******************************************************************************
* USB_MODULE
******************************************************************************/
/* USB channel 0 registers */
    typedef struct
    {
        union
        {
            __IO uint16_t HCNT;
            struct
            {
                __IO uint8_t HCNT0;
                __IO uint8_t HCNT1;
            };
        };
        uint8_t RESERVED0[ 2 ];
        __IO uint8_t HIRQ;
        __IO uint8_t HERR;
        uint8_t RESERVED1[ 2 ];
        __IO uint8_t HSTATE;
        __IO uint8_t HFCOMP;
        uint8_t RESERVED2[ 2 ];
        union
        {
            __IO uint16_t HRTIMER;
            struct
            {
                __IO uint8_t HRTIMER0;
                __IO uint8_t HRTIMER1;
            };
        };
        uint8_t RESERVED3[ 2 ];
        __IO uint8_t HRTIMER2;
        __IO uint8_t HADR;
        uint8_t RESERVED4[ 2 ];
        union
        {
            __IO uint16_t HEOF;
            struct
            {
                __IO uint8_t HEOF0;
                __IO uint8_t HEOF1;
            };
        };
        uint8_t RESERVED5[ 2 ];
        union
        {
            __IO uint16_t HFRAME;
            struct
            {
                __IO uint8_t HFRAME0;
                __IO uint8_t HFRAME1;
            };
        };
        uint8_t RESERVED6[ 2 ];
        __IO uint8_t HTOKEN;
        uint8_t RESERVED7[ 3 ];
        __IO uint16_t UDCC;
        uint8_t RESERVED8[ 2 ];
        __IO uint16_t EP0C;
        uint8_t RESERVED9[ 2 ];
        __IO uint16_t EP1C;
        uint8_t RESERVED10[ 2 ];
        __IO uint16_t EP2C;
        uint8_t RESERVED11[ 2 ];
        __IO uint16_t EP3C;
        uint8_t RESERVED12[ 2 ];
        __IO uint16_t EP4C;
        uint8_t RESERVED13[ 2 ];
        __IO uint16_t EP5C;
        uint8_t RESERVED14[ 2 ];
        __IO uint16_t TMSP;
        uint8_t RESERVED15[ 2 ];
        __IO uint8_t UDCS;
        __IO uint8_t UDCIE;
        uint8_t RESERVED16[ 2 ];
        __IO uint16_t EP0IS;
        uint8_t RESERVED17[ 2 ];
        __IO uint16_t EP0OS;
        uint8_t RESERVED18[ 2 ];
        __IO uint16_t EP1S;
        uint8_t RESERVED19[ 2 ];
        __IO uint16_t EP2S;
        uint8_t RESERVED20[ 2 ];
        __IO uint16_t EP3S;
        uint8_t RESERVED21[ 2 ];
        __IO uint16_t EP4S;
        uint8_t RESERVED22[ 2 ];
        __IO uint16_t EP5S;
        uint8_t RESERVED23[ 2 ];
        union
        {
            __IO uint16_t EP0DT;
            struct
            {
                __IO uint8_t EP0DTL;
                __IO uint8_t EP0DTH;
            };
        };
        uint8_t RESERVED24[ 2 ];
        union
        {
            __IO uint16_t EP1DT;
            struct
            {
                __IO uint8_t EP1DTL;
                __IO uint8_t EP1DTH;
            };
        };
        uint8_t RESERVED25[ 2 ];
        union
        {
            __IO uint16_t EP2DT;
            struct
            {
                __IO uint8_t EP2DTL;
                __IO uint8_t EP2DTH;
            };
        };
        uint8_t RESERVED26[ 2 ];
        union
        {
            __IO uint16_t EP3DT;
            struct
            {
                __IO uint8_t EP3DTL;
                __IO uint8_t EP3DTH;
            };
        };
        uint8_t RESERVED27[ 2 ];
        union
        {
            __IO uint16_t EP4DT;
            struct
            {
                __IO uint8_t EP4DTL;
                __IO uint8_t EP4DTH;
            };
        };
        uint8_t RESERVED28[ 2 ];
        union
        {
            __IO uint16_t EP5DT;
            struct
            {
                __IO uint8_t EP5DTL;
                __IO uint8_t EP5DTH;
            };
        };
    } FM3_USB_TypeDef;

