FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* Peripheral declaration
******************************************************************************/
    #define FM3_FLASH_IF           ( ( FM3_FIF_TypeDef * ) FM3_FLASH_IF_BASE )
    #define FM3_CRG                ( ( FM3_CRG_TypeDef * ) FM3_CRG_BASE )
    #define FM3_HWWDT              ( ( FM3_HWWDT_TypeDef * ) FM3_HWWDT_BASE )
    #define FM3_SWWDT              ( ( FM3_SWWDT_TypeDef * ) FM3_SWWDT_BASE )
    #define FM3_DTIM               ( ( FM3_DTIM_TypeDef * ) FM3_DTIM_BASE )
    #define FM3_MFT0_FRT           ( ( FM3_MFT_FRT_TypeDef * ) FM3_MFT0_FRT_BASE )
    #define FM3_MFT0_OCU           ( ( FM3_MFT_OCU_TypeDef * ) FM3_MFT0_OCU_BASE )
    #define FM3_MFT0_WFG           ( ( FM3_MFT_WFG_TypeDef * ) FM3_MFT0_WFG_BASE )
    #define FM3_MFT0_ICU           ( ( FM3_MFT_ICU_TypeDef * ) FM3_MFT0_ICU_BASE )
    #define FM3_MFT0_ADCMP         ( ( FM3_MFT_ADCMP_TypeDef * ) FM3_MFT0_ADCMP_BASE )
    #define FM3_MFT1_FRT           ( ( FM3_MFT_FRT_TypeDef * ) FM3_MFT1_FRT_BASE )
    #define FM3_MFT1_OCU           ( ( FM3_MFT_OCU_TypeDef * ) FM3_MFT1_OCU_BASE )
    #define FM3_MFT1_WFG           ( ( FM3_MFT_WFG_TypeDef * ) FM3_MFT1_WFG_BASE )
    #define FM3_MFT1_ICU           ( ( FM3_MFT_ICU_TypeDef * ) FM3_MFT1_ICU_BASE )
    #define FM3_MFT1_ADCMP         ( ( FM3_MFT_ADCMP_TypeDef * ) FM3_MFT1_ADCMP_BASE )
    #define FM3_MFT_PPG            ( ( FM3_MFT_PPG_TypeDef * ) FM3_MFT_PPG_BASE )
    #define FM3_BT0_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT0_PPG_BASE )
    #define FM3_BT0_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT0_PWM_BASE )
    #define FM3_BT0_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT0_RT_BASE )
    #define FM3_BT0_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT0_PWC_BASE )
    #define FM3_BT1_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT1_PPG_BASE )
    #define FM3_BT1_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT1_PWM_BASE )
    #define FM3_BT1_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT1_RT_BASE )
    #define FM3_BT1_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT1_PWC_BASE )
    #define FM3_BT2_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT2_PPG_BASE )
    #define FM3_BT2_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT2_PWM_BASE )
    #define FM3_BT2_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT2_RT_BASE )
    #define FM3_BT2_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT2_PWC_BASE )
    #define FM3_BT3_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT3_PPG_BASE )
    #define FM3_BT3_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT3_PWM_BASE )
    #define FM3_BT3_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT3_RT_BASE )
    #define FM3_BT3_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT3_PWC_BASE )
    #define FM3_BT4_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT4_PPG_BASE )
    #define FM3_BT4_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT4_PWM_BASE )
    #define FM3_BT4_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT4_RT_BASE )
    #define FM3_BT4_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT4_PWC_BASE )
    #define FM3_BT5_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT5_PPG_BASE )
    #define FM3_BT5_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT5_PWM_BASE )
    #define FM3_BT5_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT5_RT_BASE )
    #define FM3_BT5_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT5_PWC_BASE )
    #define FM3_BT6_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT6_PPG_BASE )
    #define FM3_BT6_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT6_PWM_BASE )
    #define FM3_BT6_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT6_RT_BASE )
    #define FM3_BT6_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT6_PWC_BASE )
    #define FM3_BT7_PPG            ( ( FM3_BT_PPG_TypeDef * ) FM3_BT7_PPG_BASE )
    #define FM3_BT7_PWM            ( ( FM3_BT_PWM_TypeDef * ) FM3_BT7_PWM_BASE )
    #define FM3_BT7_RT             ( ( FM3_BT_RT_TypeDef * ) FM3_BT7_RT_BASE )
    #define FM3_BT7_PWC            ( ( FM3_BT_PWC_TypeDef * ) FM3_BT7_PWC_BASE )
    #define FM3_BTIOSEL03          ( ( FM3_BTIOSEL03_TypeDef * ) FM3_BTIOSEL03_BASE )
    #define FM3_BTIOSEL47          ( ( FM3_BTIOSEL47_TypeDef * ) FM3_BTIOSEL47_BASE )
    #define FM3_SBSSR              ( ( FM3_SBSSR_TypeDef * ) FM3_SBSSR_BASE )
    #define FM3_QPRC0              ( ( FM3_QPRC_TypeDef * ) FM3_QPRC0_BASE )
    #define FM3_QPRC1              ( ( FM3_QPRC_TypeDef * ) FM3_QPRC1_BASE )
    #define FM3_ADC0               ( ( FM3_ADC_TypeDef * ) FM3_ADC0_BASE )
    #define FM3_ADC1               ( ( FM3_ADC_TypeDef * ) FM3_ADC1_BASE )
    #define FM3_ADC2               ( ( FM3_ADC_TypeDef * ) FM3_ADC2_BASE )
    #define FM3_CRTRIM             ( ( FM3_CRTRIM_TypeDef * ) FM3_CRTRIM_BASE )
    #define FM3_EXTI               ( ( FM3_EXTI_TypeDef * ) FM3_EXTI_BASE )
    #define FM3_INTREQ             ( ( FM3_INTREQ_TypeDef * ) FM3_INTREQ_BASE )
    #define FM3_GPIO               ( ( FM3_GPIO_TypeDef * ) FM3_GPIO_BASE )
    #define FM3_LVD                ( ( FM3_LVD_TypeDef * ) FM3_LVD_BASE )
    #define FM3_USBCLK             ( ( FM3_USBCLK_TypeDef * ) FM3_USBCLK_BASE )
    #define FM3_CANPRES            ( ( FM3_CANPRE_TypeDef * ) FM3_CANPRES_BASE )
    #define FM3_MFS0_UART          ( ( FM3_MFS03_UART_TypeDef * ) FM3_MFS0_UART_BASE )
    #define FM3_MFS0_CSIO          ( ( FM3_MFS03_CSIO_TypeDef * ) FM3_MFS0_CSIO_BASE )
    #define FM3_MFS0_LIN           ( ( FM3_MFS03_LIN_TypeDef * ) FM3_MFS0_LIN_BASE )
    #define FM3_MFS0_I2C           ( ( FM3_MFS03_I2C_TypeDef * ) FM3_MFS0_I2C_BASE )
    #define FM3_MFS1_UART          ( ( FM3_MFS03_UART_TypeDef * ) FM3_MFS1_UART_BASE )
    #define FM3_MFS1_CSIO          ( ( FM3_MFS03_CSIO_TypeDef * ) FM3_MFS1_CSIO_BASE )
    #define FM3_MFS1_LIN           ( ( FM3_MFS03_LIN_TypeDef * ) FM3_MFS1_LIN_BASE )
    #define FM3_MFS1_I2C           ( ( FM3_MFS03_I2C_TypeDef * ) FM3_MFS1_I2C_BASE )
    #define FM3_MFS2_UART          ( ( FM3_MFS03_UART_TypeDef * ) FM3_MFS2_UART_BASE )
    #define FM3_MFS2_CSIO          ( ( FM3_MFS03_CSIO_TypeDef * ) FM3_MFS2_CSIO_BASE )
    #define FM3_MFS2_LIN           ( ( FM3_MFS03_LIN_TypeDef * ) FM3_MFS2_LIN_BASE )
    #define FM3_MFS2_I2C           ( ( FM3_MFS03_I2C_TypeDef * ) FM3_MFS2_I2C_BASE )
    #define FM3_MFS3_UART          ( ( FM3_MFS03_UART_TypeDef * ) FM3_MFS3_UART_BASE )
    #define FM3_MFS3_CSIO          ( ( FM3_MFS03_CSIO_TypeDef * ) FM3_MFS3_CSIO_BASE )
    #define FM3_MFS3_LIN           ( ( FM3_MFS03_LIN_TypeDef * ) FM3_MFS3_LIN_BASE )
    #define FM3_MFS3_I2C           ( ( FM3_MFS03_I2C_TypeDef * ) FM3_MFS3_I2C_BASE )
    #define FM3_MFS4_UART          ( ( FM3_MFS47_UART_TypeDef * ) FM3_MFS4_UART_BASE )
    #define FM3_MFS4_CSIO          ( ( FM3_MFS47_CSIO_TypeDef * ) FM3_MFS4_CSIO_BASE )
    #define FM3_MFS4_LIN           ( ( FM3_MFS47_LIN_TypeDef * ) FM3_MFS4_LIN_BASE )
    #define FM3_MFS4_I2C           ( ( FM3_MFS47_I2C_TypeDef * ) FM3_MFS4_I2C_BASE )
    #define FM3_MFS5_UART          ( ( FM3_MFS47_UART_TypeDef * ) FM3_MFS5_UART_BASE )
    #define FM3_MFS5_CSIO          ( ( FM3_MFS47_CSIO_TypeDef * ) FM3_MFS5_CSIO_BASE )
    #define FM3_MFS5_LIN           ( ( FM3_MFS47_LIN_TypeDef * ) FM3_MFS5_LIN_BASE )
    #define FM3_MFS5_I2C           ( ( FM3_MFS47_I2C_TypeDef * ) FM3_MFS5_I2C_BASE )
    #define FM3_MFS6_UART          ( ( FM3_MFS47_UART_TypeDef * ) FM3_MFS6_UART_BASE )
    #define FM3_MFS6_CSIO          ( ( FM3_MFS47_CSIO_TypeDef * ) FM3_MFS6_CSIO_BASE )
    #define FM3_MFS6_LIN           ( ( FM3_MFS47_LIN_TypeDef * ) FM3_MFS6_LIN_BASE )
    #define FM3_MFS6_I2C           ( ( FM3_MFS47_I2C_TypeDef * ) FM3_MFS6_I2C_BASE )
    #define FM3_MFS7_UART          ( ( FM3_MFS47_UART_TypeDef * ) FM3_MFS7_UART_BASE )
    #define FM3_MFS7_CSIO          ( ( FM3_MFS47_CSIO_TypeDef * ) FM3_MFS7_CSIO_BASE )
    #define FM3_MFS7_LIN           ( ( FM3_MFS47_LIN_TypeDef * ) FM3_MFS7_LIN_BASE )
    #define FM3_MFS7_I2C           ( ( FM3_MFS47_I2C_TypeDef * ) FM3_MFS7_I2C_BASE )
    #define FM3_CRC                ( ( FM3_CRC_TypeDef * ) FM3_CRC_BASE )
    #define FM3_WC                 ( ( FM3_WC_TypeDef * ) FM3_WC_BASE )
    #define FM3_EXBUS              ( ( FM3_EXBUS_TypeDef * ) FM3_EXBUS_BASE )
    #define FM3_USB0               ( ( FM3_USB_TypeDef * ) FM3_USB0_BASE )
    #define FM3_DMAC               ( ( FM3_DMAC_TypeDef * ) FM3_DMAC_BASE )
    #define FM3_CAN0               ( ( FM3_CAN_TypeDef * ) FM3_CAN0_BASE )
    #define FM3_CAN1               ( ( FM3_CAN_TypeDef * ) FM3_CAN1_BASE )

