FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/******************************************************************************
* Peripheral Bit Band Alias declaration
******************************************************************************/

/* Flash interface registers */
    #define bFM3_FLASH_IF_FASZR_ASZ0             *( ( volatile unsigned int * ) ( 0x42000000UL ) )
    #define bFM3_FLASH_IF_FASZR_ASZ1             *( ( volatile unsigned int * ) ( 0x42000004UL ) )
    #define bFM3_FLASH_IF_FRWTR_RWT0             *( ( volatile unsigned int * ) ( 0x42000080UL ) )
    #define bFM3_FLASH_IF_FRWTR_RWT1             *( ( volatile unsigned int * ) ( 0x42000084UL ) )
    #define bFM3_FLASH_IF_FSTR_RDY               *( ( volatile unsigned int * ) ( 0x42000100UL ) )
    #define bFM3_FLASH_IF_FSTR_HNG               *( ( volatile unsigned int * ) ( 0x42000104UL ) )
    #define bFM3_FLASH_IF_FSYNDN_SD0             *( ( volatile unsigned int * ) ( 0x42000200UL ) )
    #define bFM3_FLASH_IF_FSYNDN_SD1             *( ( volatile unsigned int * ) ( 0x42000204UL ) )
    #define bFM3_FLASH_IF_FSYNDN_SD2             *( ( volatile unsigned int * ) ( 0x42000208UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM0           *( ( volatile unsigned int * ) ( 0x42002000UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM1           *( ( volatile unsigned int * ) ( 0x42002004UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM2           *( ( volatile unsigned int * ) ( 0x42002008UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM3           *( ( volatile unsigned int * ) ( 0x4200200CUL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM4           *( ( volatile unsigned int * ) ( 0x42002010UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM5           *( ( volatile unsigned int * ) ( 0x42002014UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM6           *( ( volatile unsigned int * ) ( 0x42002018UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM7           *( ( volatile unsigned int * ) ( 0x4200201CUL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM8           *( ( volatile unsigned int * ) ( 0x42002020UL ) )
    #define bFM3_FLASH_IF_CRTRMM_TRMM9           *( ( volatile unsigned int * ) ( 0x42002024UL ) )

/* Clock and reset registers */
    #define bFM3_CRG_SCM_CTL_MOSCE               *( ( volatile unsigned int * ) ( 0x42200004UL ) )
    #define bFM3_CRG_SCM_CTL_SOSCE               *( ( volatile unsigned int * ) ( 0x4220000CUL ) )
    #define bFM3_CRG_SCM_CTL_PLLE                *( ( volatile unsigned int * ) ( 0x42200010UL ) )
    #define bFM3_CRG_SCM_CTL_RCS0                *( ( volatile unsigned int * ) ( 0x42200014UL ) )
    #define bFM3_CRG_SCM_CTL_RCS1                *( ( volatile unsigned int * ) ( 0x42200018UL ) )
    #define bFM3_CRG_SCM_CTL_RCS2                *( ( volatile unsigned int * ) ( 0x4220001CUL ) )
    #define bFM3_CRG_SCM_STR_MORDY               *( ( volatile unsigned int * ) ( 0x42200084UL ) )
    #define bFM3_CRG_SCM_STR_SORDY               *( ( volatile unsigned int * ) ( 0x4220008CUL ) )
    #define bFM3_CRG_SCM_STR_PLRDY               *( ( volatile unsigned int * ) ( 0x42200090UL ) )
    #define bFM3_CRG_SCM_STR_RCM0                *( ( volatile unsigned int * ) ( 0x42200094UL ) )
    #define bFM3_CRG_SCM_STR_RCM1                *( ( volatile unsigned int * ) ( 0x42200098UL ) )
    #define bFM3_CRG_SCM_STR_RCM2                *( ( volatile unsigned int * ) ( 0x4220009CUL ) )
    #define bFM3_CRG_RST_STR_PONR                *( ( volatile unsigned int * ) ( 0x42200180UL ) )
    #define bFM3_CRG_RST_STR_INITX               *( ( volatile unsigned int * ) ( 0x42200184UL ) )
    #define bFM3_CRG_RST_STR_SWDT                *( ( volatile unsigned int * ) ( 0x42200190UL ) )
    #define bFM3_CRG_RST_STR_HWDT                *( ( volatile unsigned int * ) ( 0x42200194UL ) )
    #define bFM3_CRG_RST_STR_CSVR                *( ( volatile unsigned int * ) ( 0x42200198UL ) )
    #define bFM3_CRG_RST_STR_FCSR                *( ( volatile unsigned int * ) ( 0x4220019CUL ) )
    #define bFM3_CRG_RST_STR_SRST                *( ( volatile unsigned int * ) ( 0x422001A0UL ) )
    #define bFM3_CRG_BSC_PSR_BSR0                *( ( volatile unsigned int * ) ( 0x42200200UL ) )
    #define bFM3_CRG_BSC_PSR_BSR1                *( ( volatile unsigned int * ) ( 0x42200204UL ) )
    #define bFM3_CRG_BSC_PSR_BSR2                *( ( volatile unsigned int * ) ( 0x42200208UL ) )
    #define bFM3_CRG_APBC0_PSR_APBC00            *( ( volatile unsigned int * ) ( 0x42200280UL ) )
    #define bFM3_CRG_APBC0_PSR_APBC01            *( ( volatile unsigned int * ) ( 0x42200284UL ) )
    #define bFM3_CRG_APBC1_PSR_APBC10            *( ( volatile unsigned int * ) ( 0x42200300UL ) )
    #define bFM3_CRG_APBC1_PSR_APBC11            *( ( volatile unsigned int * ) ( 0x42200304UL ) )
    #define bFM3_CRG_APBC1_PSR_APBC1RST          *( ( volatile unsigned int * ) ( 0x42200310UL ) )
    #define bFM3_CRG_APBC1_PSR_APBC1EN           *( ( volatile unsigned int * ) ( 0x4220031CUL ) )
    #define bFM3_CRG_APBC2_PSR_APBC20            *( ( volatile unsigned int * ) ( 0x42200380UL ) )
    #define bFM3_CRG_APBC2_PSR_APBC21            *( ( volatile unsigned int * ) ( 0x42200384UL ) )
    #define bFM3_CRG_APBC2_PSR_APBC2RST          *( ( volatile unsigned int * ) ( 0x42200390UL ) )
    #define bFM3_CRG_APBC2_PSR_APBC2EN           *( ( volatile unsigned int * ) ( 0x4220039CUL ) )
    #define bFM3_CRG_SWC_PSR_SWDS0               *( ( volatile unsigned int * ) ( 0x42200400UL ) )
    #define bFM3_CRG_SWC_PSR_SWDS1               *( ( volatile unsigned int * ) ( 0x42200404UL ) )
    #define bFM3_CRG_SWC_PSR_TESTB               *( ( volatile unsigned int * ) ( 0x4220041CUL ) )
    #define bFM3_CRG_TTC_PSR_TTC                 *( ( volatile unsigned int * ) ( 0x42200500UL ) )
    #define bFM3_CRG_CSW_TMR_MOWT0               *( ( volatile unsigned int * ) ( 0x42200600UL ) )
    #define bFM3_CRG_CSW_TMR_MOWT1               *( ( volatile unsigned int * ) ( 0x42200604UL ) )
    #define bFM3_CRG_CSW_TMR_MOWT2               *( ( volatile unsigned int * ) ( 0x42200608UL ) )
    #define bFM3_CRG_CSW_TMR_MOWT3               *( ( volatile unsigned int * ) ( 0x4220060CUL ) )
    #define bFM3_CRG_CSW_TMR_SOWT0               *( ( volatile unsigned int * ) ( 0x42200610UL ) )
    #define bFM3_CRG_CSW_TMR_SOWT1               *( ( volatile unsigned int * ) ( 0x42200614UL ) )
    #define bFM3_CRG_CSW_TMR_SOWT2               *( ( volatile unsigned int * ) ( 0x42200618UL ) )
    #define bFM3_CRG_PSW_TMR_POWT0               *( ( volatile unsigned int * ) ( 0x42200680UL ) )
    #define bFM3_CRG_PSW_TMR_POWT1               *( ( volatile unsigned int * ) ( 0x42200684UL ) )
    #define bFM3_CRG_PSW_TMR_POWT2               *( ( volatile unsigned int * ) ( 0x42200688UL ) )
    #define bFM3_CRG_PSW_TMR_PINC                *( ( volatile unsigned int * ) ( 0x42200690UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLM0              *( ( volatile unsigned int * ) ( 0x42200700UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLM1              *( ( volatile unsigned int * ) ( 0x42200704UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLM2              *( ( volatile unsigned int * ) ( 0x42200708UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLM3              *( ( volatile unsigned int * ) ( 0x4220070CUL ) )
    #define bFM3_CRG_PLL_CTL1_PLLK0              *( ( volatile unsigned int * ) ( 0x42200710UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLK1              *( ( volatile unsigned int * ) ( 0x42200714UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLK2              *( ( volatile unsigned int * ) ( 0x42200718UL ) )
    #define bFM3_CRG_PLL_CTL1_PLLK3              *( ( volatile unsigned int * ) ( 0x4220071CUL ) )
    #define bFM3_CRG_PLL_CTL2_PLLN0              *( ( volatile unsigned int * ) ( 0x42200780UL ) )
    #define bFM3_CRG_PLL_CTL2_PLLN1              *( ( volatile unsigned int * ) ( 0x42200784UL ) )
    #define bFM3_CRG_PLL_CTL2_PLLN2              *( ( volatile unsigned int * ) ( 0x42200788UL ) )
    #define bFM3_CRG_PLL_CTL2_PLLN3              *( ( volatile unsigned int * ) ( 0x4220078CUL ) )
    #define bFM3_CRG_PLL_CTL2_PLLN4              *( ( volatile unsigned int * ) ( 0x42200790UL ) )
    #define bFM3_CRG_CSV_CTL_MCSVE               *( ( volatile unsigned int * ) ( 0x42200800UL ) )
    #define bFM3_CRG_CSV_CTL_SCSVE               *( ( volatile unsigned int * ) ( 0x42200804UL ) )
    #define bFM3_CRG_CSV_CTL_FCSDE               *( ( volatile unsigned int * ) ( 0x42200820UL ) )
    #define bFM3_CRG_CSV_CTL_FCSRE               *( ( volatile unsigned int * ) ( 0x42200824UL ) )
    #define bFM3_CRG_CSV_CTL_FCD0                *( ( volatile unsigned int * ) ( 0x42200830UL ) )
    #define bFM3_CRG_CSV_CTL_FCD1                *( ( volatile unsigned int * ) ( 0x42200834UL ) )
    #define bFM3_CRG_CSV_CTL_FCD2                *( ( volatile unsigned int * ) ( 0x42200838UL ) )
    #define bFM3_CRG_CSV_STR_MCMF                *( ( volatile unsigned int * ) ( 0x42200880UL ) )
    #define bFM3_CRG_CSV_STR_SCMF                *( ( volatile unsigned int * ) ( 0x42200884UL ) )
    #define bFM3_CRG_DBWDT_CTL_DPSWBE            *( ( volatile unsigned int * ) ( 0x42200A94UL ) )
    #define bFM3_CRG_DBWDT_CTL_DPHWBE            *( ( volatile unsigned int * ) ( 0x42200A9CUL ) )
    #define bFM3_CRG_INT_ENR_MCSE                *( ( volatile unsigned int * ) ( 0x42200C00UL ) )
    #define bFM3_CRG_INT_ENR_SCSE                *( ( volatile unsigned int * ) ( 0x42200C04UL ) )
    #define bFM3_CRG_INT_ENR_PCSE                *( ( volatile unsigned int * ) ( 0x42200C08UL ) )
    #define bFM3_CRG_INT_ENR_FCSE                *( ( volatile unsigned int * ) ( 0x42200C14UL ) )
    #define bFM3_CRG_INT_STR_MCSI                *( ( volatile unsigned int * ) ( 0x42200C80UL ) )
    #define bFM3_CRG_INT_STR_SCSI                *( ( volatile unsigned int * ) ( 0x42200C84UL ) )
    #define bFM3_CRG_INT_STR_PCSI                *( ( volatile unsigned int * ) ( 0x42200C88UL ) )
    #define bFM3_CRG_INT_STR_FCSI                *( ( volatile unsigned int * ) ( 0x42200C94UL ) )
    #define bFM3_CRG_INT_CLR_MCSC                *( ( volatile unsigned int * ) ( 0x42200D00UL ) )
    #define bFM3_CRG_INT_CLR_SCSC                *( ( volatile unsigned int * ) ( 0x42200D04UL ) )
    #define bFM3_CRG_INT_CLR_PCSC                *( ( volatile unsigned int * ) ( 0x42200D08UL ) )
    #define bFM3_CRG_INT_CLR_FCSC                *( ( volatile unsigned int * ) ( 0x42200D14UL ) )

/* Hardware watchdog registers */
    #define bFM3_HWWDT_WDG_CTL_INTEN             *( ( volatile unsigned int * ) ( 0x42220100UL ) )
    #define bFM3_HWWDT_WDG_CTL_RESEN             *( ( volatile unsigned int * ) ( 0x42220104UL ) )
    #define bFM3_HWWDT_WDG_RIS_RIS               *( ( volatile unsigned int * ) ( 0x42220200UL ) )

/* Software watchdog registers */
    #define bFM3_SWWDT_WDOGCONTROL_INTEN         *( ( volatile unsigned int * ) ( 0x42240100UL ) )
    #define bFM3_SWWDT_WDOGCONTROL_RESEN         *( ( volatile unsigned int * ) ( 0x42240104UL ) )
    #define bFM3_SWWDT_WDOGRIS_RIS               *( ( volatile unsigned int * ) ( 0x42240200UL ) )

