FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Dual timer 1/2 registers */
    #define bFM3_DTIM_TIMER1CONTROL_ONESHOT      *( ( volatile unsigned int * ) ( 0x422A0100UL ) )
    #define bFM3_DTIM_TIMER1CONTROL_TIMERSIZE    *( ( volatile unsigned int * ) ( 0x422A0104UL ) )
    #define bFM3_DTIM_TIMER1CONTROL_TIMERPRE0    *( ( volatile unsigned int * ) ( 0x422A0108UL ) )
    #define bFM3_DTIM_TIMER1CONTROL_TIMERPRE1    *( ( volatile unsigned int * ) ( 0x422A010CUL ) )
    #define bFM3_DTIM_TIMER1CONTROL_INTENABLE    *( ( volatile unsigned int * ) ( 0x422A0114UL ) )
    #define bFM3_DTIM_TIMER1CONTROL_TIMERMODE    *( ( volatile unsigned int * ) ( 0x422A0118UL ) )
    #define bFM3_DTIM_TIMER1CONTROL_TIMEREN      *( ( volatile unsigned int * ) ( 0x422A011CUL ) )
    #define bFM3_DTIM_TIMER1RIS_TIMERXRIS        *( ( volatile unsigned int * ) ( 0x422A0200UL ) )
    #define bFM3_DTIM_TIMER1MIS_TIMERXRIS        *( ( volatile unsigned int * ) ( 0x422A0280UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_ONESHOT      *( ( volatile unsigned int * ) ( 0x422A0500UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_TIMERSIZE    *( ( volatile unsigned int * ) ( 0x422A0504UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_TIMERPRE0    *( ( volatile unsigned int * ) ( 0x422A0508UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_TIMERPRE1    *( ( volatile unsigned int * ) ( 0x422A050CUL ) )
    #define bFM3_DTIM_TIMER2CONTROL_INTENABLE    *( ( volatile unsigned int * ) ( 0x422A0514UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_TIMERMODE    *( ( volatile unsigned int * ) ( 0x422A0518UL ) )
    #define bFM3_DTIM_TIMER2CONTROL_TIMEREN      *( ( volatile unsigned int * ) ( 0x422A051CUL ) )
    #define bFM3_DTIM_TIMER2RIS_TIMERXRIS        *( ( volatile unsigned int * ) ( 0x422A0600UL ) )
    #define bFM3_DTIM_TIMER2MIS_TIMERXRIS        *( ( volatile unsigned int * ) ( 0x422A0680UL ) )

/* Multifunction Timer unit 0 Free Running Timer registers */
    #define bFM3_MFT0_FRT_TCSA0_CLK0             *( ( volatile unsigned int * ) ( 0x42400600UL ) )
    #define bFM3_MFT0_FRT_TCSA0_CLK1             *( ( volatile unsigned int * ) ( 0x42400604UL ) )
    #define bFM3_MFT0_FRT_TCSA0_CLK2             *( ( volatile unsigned int * ) ( 0x42400608UL ) )
    #define bFM3_MFT0_FRT_TCSA0_CLK3             *( ( volatile unsigned int * ) ( 0x4240060CUL ) )
    #define bFM3_MFT0_FRT_TCSA0_SCLR             *( ( volatile unsigned int * ) ( 0x42400610UL ) )
    #define bFM3_MFT0_FRT_TCSA0_MODE             *( ( volatile unsigned int * ) ( 0x42400614UL ) )
    #define bFM3_MFT0_FRT_TCSA0_STOP             *( ( volatile unsigned int * ) ( 0x42400618UL ) )
    #define bFM3_MFT0_FRT_TCSA0_BFE              *( ( volatile unsigned int * ) ( 0x4240061CUL ) )
    #define bFM3_MFT0_FRT_TCSA0_ICRE             *( ( volatile unsigned int * ) ( 0x42400620UL ) )
    #define bFM3_MFT0_FRT_TCSA0_ICLR             *( ( volatile unsigned int * ) ( 0x42400624UL ) )
    #define bFM3_MFT0_FRT_TCSA0_IRQZE            *( ( volatile unsigned int * ) ( 0x42400634UL ) )
    #define bFM3_MFT0_FRT_TCSA0_IRQZF            *( ( volatile unsigned int * ) ( 0x42400638UL ) )
    #define bFM3_MFT0_FRT_TCSA0_ECKE             *( ( volatile unsigned int * ) ( 0x4240063CUL ) )
    #define bFM3_MFT0_FRT_TCSB0_AD0E             *( ( volatile unsigned int * ) ( 0x42400680UL ) )
    #define bFM3_MFT0_FRT_TCSB0_AD1E             *( ( volatile unsigned int * ) ( 0x42400684UL ) )
    #define bFM3_MFT0_FRT_TCSB0_AD2E             *( ( volatile unsigned int * ) ( 0x42400688UL ) )
    #define bFM3_MFT0_FRT_TCSA1_CLK0             *( ( volatile unsigned int * ) ( 0x42400800UL ) )
    #define bFM3_MFT0_FRT_TCSA1_CLK1             *( ( volatile unsigned int * ) ( 0x42400804UL ) )
    #define bFM3_MFT0_FRT_TCSA1_CLK2             *( ( volatile unsigned int * ) ( 0x42400808UL ) )
    #define bFM3_MFT0_FRT_TCSA1_CLK3             *( ( volatile unsigned int * ) ( 0x4240080CUL ) )
    #define bFM3_MFT0_FRT_TCSA1_SCLR             *( ( volatile unsigned int * ) ( 0x42400810UL ) )
    #define bFM3_MFT0_FRT_TCSA1_MODE             *( ( volatile unsigned int * ) ( 0x42400814UL ) )
    #define bFM3_MFT0_FRT_TCSA1_STOP             *( ( volatile unsigned int * ) ( 0x42400818UL ) )
    #define bFM3_MFT0_FRT_TCSA1_BFE              *( ( volatile unsigned int * ) ( 0x4240081CUL ) )
    #define bFM3_MFT0_FRT_TCSA1_ICRE             *( ( volatile unsigned int * ) ( 0x42400820UL ) )
    #define bFM3_MFT0_FRT_TCSA1_ICLR             *( ( volatile unsigned int * ) ( 0x42400824UL ) )
    #define bFM3_MFT0_FRT_TCSA1_IRQZE            *( ( volatile unsigned int * ) ( 0x42400834UL ) )
    #define bFM3_MFT0_FRT_TCSA1_IRQZF            *( ( volatile unsigned int * ) ( 0x42400838UL ) )
    #define bFM3_MFT0_FRT_TCSA1_ECKE             *( ( volatile unsigned int * ) ( 0x4240083CUL ) )
    #define bFM3_MFT0_FRT_TCSB1_AD0E             *( ( volatile unsigned int * ) ( 0x42400880UL ) )
    #define bFM3_MFT0_FRT_TCSB1_AD1E             *( ( volatile unsigned int * ) ( 0x42400884UL ) )
    #define bFM3_MFT0_FRT_TCSB1_AD2E             *( ( volatile unsigned int * ) ( 0x42400888UL ) )
    #define bFM3_MFT0_FRT_TCSA2_CLK0             *( ( volatile unsigned int * ) ( 0x42400A00UL ) )
    #define bFM3_MFT0_FRT_TCSA2_CLK1             *( ( volatile unsigned int * ) ( 0x42400A04UL ) )
    #define bFM3_MFT0_FRT_TCSA2_CLK2             *( ( volatile unsigned int * ) ( 0x42400A08UL ) )
    #define bFM3_MFT0_FRT_TCSA2_CLK3             *( ( volatile unsigned int * ) ( 0x42400A0CUL ) )
    #define bFM3_MFT0_FRT_TCSA2_SCLR             *( ( volatile unsigned int * ) ( 0x42400A10UL ) )
    #define bFM3_MFT0_FRT_TCSA2_MODE             *( ( volatile unsigned int * ) ( 0x42400A14UL ) )
    #define bFM3_MFT0_FRT_TCSA2_STOP             *( ( volatile unsigned int * ) ( 0x42400A18UL ) )
    #define bFM3_MFT0_FRT_TCSA2_BFE              *( ( volatile unsigned int * ) ( 0x42400A1CUL ) )
    #define bFM3_MFT0_FRT_TCSA2_ICRE             *( ( volatile unsigned int * ) ( 0x42400A20UL ) )
    #define bFM3_MFT0_FRT_TCSA2_ICLR             *( ( volatile unsigned int * ) ( 0x42400A24UL ) )
    #define bFM3_MFT0_FRT_TCSA2_IRQZE            *( ( volatile unsigned int * ) ( 0x42400A34UL ) )
    #define bFM3_MFT0_FRT_TCSA2_IRQZF            *( ( volatile unsigned int * ) ( 0x42400A38UL ) )
    #define bFM3_MFT0_FRT_TCSA2_ECKE             *( ( volatile unsigned int * ) ( 0x42400A3CUL ) )
    #define bFM3_MFT0_FRT_TCSB2_AD0E             *( ( volatile unsigned int * ) ( 0x42400A80UL ) )
    #define bFM3_MFT0_FRT_TCSB2_AD1E             *( ( volatile unsigned int * ) ( 0x42400A84UL ) )
    #define bFM3_MFT0_FRT_TCSB2_AD2E             *( ( volatile unsigned int * ) ( 0x42400A88UL ) )

/* Multifunction Timer unit 0 Output Compare Unit registers */
    #define bFM3_MFT0_OCU_OCSA10_CST0            *( ( volatile unsigned int * ) ( 0x42400300UL ) )
    #define bFM3_MFT0_OCU_OCSA10_CST1            *( ( volatile unsigned int * ) ( 0x42400304UL ) )
    #define bFM3_MFT0_OCU_OCSA10_BDIS0           *( ( volatile unsigned int * ) ( 0x42400308UL ) )
    #define bFM3_MFT0_OCU_OCSA10_BDIS1           *( ( volatile unsigned int * ) ( 0x4240030CUL ) )
    #define bFM3_MFT0_OCU_OCSA10_IOE0            *( ( volatile unsigned int * ) ( 0x42400310UL ) )
    #define bFM3_MFT0_OCU_OCSA10_IOE1            *( ( volatile unsigned int * ) ( 0x42400314UL ) )
    #define bFM3_MFT0_OCU_OCSA10_IOP0            *( ( volatile unsigned int * ) ( 0x42400318UL ) )
    #define bFM3_MFT0_OCU_OCSA10_IOP1            *( ( volatile unsigned int * ) ( 0x4240031CUL ) )
    #define bFM3_MFT0_OCU_OCSB10_OTD0            *( ( volatile unsigned int * ) ( 0x42400320UL ) )
    #define bFM3_MFT0_OCU_OCSB10_OTD1            *( ( volatile unsigned int * ) ( 0x42400324UL ) )
    #define bFM3_MFT0_OCU_OCSB10_CMOD            *( ( volatile unsigned int * ) ( 0x42400330UL ) )
    #define bFM3_MFT0_OCU_OCSB10_BTS0            *( ( volatile unsigned int * ) ( 0x42400334UL ) )
    #define bFM3_MFT0_OCU_OCSB10_BTS1            *( ( volatile unsigned int * ) ( 0x42400338UL ) )
    #define bFM3_MFT0_OCU_OCSA32_CST2            *( ( volatile unsigned int * ) ( 0x42400380UL ) )
    #define bFM3_MFT0_OCU_OCSA32_CST3            *( ( volatile unsigned int * ) ( 0x42400384UL ) )
    #define bFM3_MFT0_OCU_OCSA32_BDIS2           *( ( volatile unsigned int * ) ( 0x42400388UL ) )
    #define bFM3_MFT0_OCU_OCSA32_BDIS3           *( ( volatile unsigned int * ) ( 0x4240038CUL ) )
    #define bFM3_MFT0_OCU_OCSA32_IOE2            *( ( volatile unsigned int * ) ( 0x42400390UL ) )
    #define bFM3_MFT0_OCU_OCSA32_IOE3            *( ( volatile unsigned int * ) ( 0x42400394UL ) )
    #define bFM3_MFT0_OCU_OCSA32_IOP2            *( ( volatile unsigned int * ) ( 0x42400398UL ) )
    #define bFM3_MFT0_OCU_OCSA32_IOP3            *( ( volatile unsigned int * ) ( 0x4240039CUL ) )
    #define bFM3_MFT0_OCU_OCSB32_OTD2            *( ( volatile unsigned int * ) ( 0x424003A0UL ) )
    #define bFM3_MFT0_OCU_OCSB32_OTD3            *( ( volatile unsigned int * ) ( 0x424003A4UL ) )
    #define bFM3_MFT0_OCU_OCSB32_CMOD            *( ( volatile unsigned int * ) ( 0x424003B0UL ) )
    #define bFM3_MFT0_OCU_OCSB32_BTS2            *( ( volatile unsigned int * ) ( 0x424003B4UL ) )
    #define bFM3_MFT0_OCU_OCSB32_BTS3            *( ( volatile unsigned int * ) ( 0x424003B8UL ) )
    #define bFM3_MFT0_OCU_OCSA54_CST4            *( ( volatile unsigned int * ) ( 0x42400400UL ) )
    #define bFM3_MFT0_OCU_OCSA54_CST5            *( ( volatile unsigned int * ) ( 0x42400404UL ) )
    #define bFM3_MFT0_OCU_OCSA54_BDIS4           *( ( volatile unsigned int * ) ( 0x42400408UL ) )
    #define bFM3_MFT0_OCU_OCSA54_BDIS5           *( ( volatile unsigned int * ) ( 0x4240040CUL ) )
    #define bFM3_MFT0_OCU_OCSA54_IOE4            *( ( volatile unsigned int * ) ( 0x42400410UL ) )
    #define bFM3_MFT0_OCU_OCSA54_IOE5            *( ( volatile unsigned int * ) ( 0x42400414UL ) )
    #define bFM3_MFT0_OCU_OCSA54_IOP4            *( ( volatile unsigned int * ) ( 0x42400418UL ) )
    #define bFM3_MFT0_OCU_OCSA54_IOP5            *( ( volatile unsigned int * ) ( 0x4240041CUL ) )
    #define bFM3_MFT0_OCU_OCSB54_OTD4            *( ( volatile unsigned int * ) ( 0x42400420UL ) )
    #define bFM3_MFT0_OCU_OCSB54_OTD5            *( ( volatile unsigned int * ) ( 0x42400424UL ) )
    #define bFM3_MFT0_OCU_OCSB54_CMOD            *( ( volatile unsigned int * ) ( 0x42400430UL ) )
    #define bFM3_MFT0_OCU_OCSB54_BTS4            *( ( volatile unsigned int * ) ( 0x42400434UL ) )
    #define bFM3_MFT0_OCU_OCSB54_BTS5            *( ( volatile unsigned int * ) ( 0x42400438UL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD0              *( ( volatile unsigned int * ) ( 0x424004A0UL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD1              *( ( volatile unsigned int * ) ( 0x424004A4UL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD2              *( ( volatile unsigned int * ) ( 0x424004A8UL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD3              *( ( volatile unsigned int * ) ( 0x424004ACUL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD4              *( ( volatile unsigned int * ) ( 0x424004B0UL ) )
    #define bFM3_MFT0_OCU_OCSC_MOD5              *( ( volatile unsigned int * ) ( 0x424004B4UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO00           *( ( volatile unsigned int * ) ( 0x42400B00UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO01           *( ( volatile unsigned int * ) ( 0x42400B04UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO02           *( ( volatile unsigned int * ) ( 0x42400B08UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO03           *( ( volatile unsigned int * ) ( 0x42400B0CUL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO10           *( ( volatile unsigned int * ) ( 0x42400B10UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO11           *( ( volatile unsigned int * ) ( 0x42400B14UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO12           *( ( volatile unsigned int * ) ( 0x42400B18UL ) )
    #define bFM3_MFT0_OCU_OCFS10_FSO13           *( ( volatile unsigned int * ) ( 0x42400B1CUL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO20           *( ( volatile unsigned int * ) ( 0x42400B20UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO21           *( ( volatile unsigned int * ) ( 0x42400B24UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO22           *( ( volatile unsigned int * ) ( 0x42400B28UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO23           *( ( volatile unsigned int * ) ( 0x42400B2CUL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO30           *( ( volatile unsigned int * ) ( 0x42400B30UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO31           *( ( volatile unsigned int * ) ( 0x42400B34UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO32           *( ( volatile unsigned int * ) ( 0x42400B38UL ) )
    #define bFM3_MFT0_OCU_OCFS32_FSO33           *( ( volatile unsigned int * ) ( 0x42400B3CUL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO40           *( ( volatile unsigned int * ) ( 0x42400B80UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO41           *( ( volatile unsigned int * ) ( 0x42400B84UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO42           *( ( volatile unsigned int * ) ( 0x42400B88UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO43           *( ( volatile unsigned int * ) ( 0x42400B8CUL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO50           *( ( volatile unsigned int * ) ( 0x42400B90UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO51           *( ( volatile unsigned int * ) ( 0x42400B94UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO52           *( ( volatile unsigned int * ) ( 0x42400B98UL ) )
    #define bFM3_MFT0_OCU_OCFS54_FSO53           *( ( volatile unsigned int * ) ( 0x42400B9CUL ) )

/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
    #define bFM3_MFT0_WFG_WFSA10_DCK0            *( ( volatile unsigned int * ) ( 0x42401180UL ) )
    #define bFM3_MFT0_WFG_WFSA10_DCK1            *( ( volatile unsigned int * ) ( 0x42401184UL ) )
    #define bFM3_MFT0_WFG_WFSA10_DCK2            *( ( volatile unsigned int * ) ( 0x42401188UL ) )
    #define bFM3_MFT0_WFG_WFSA10_TMD0            *( ( volatile unsigned int * ) ( 0x4240118CUL ) )
    #define bFM3_MFT0_WFG_WFSA10_TMD1            *( ( volatile unsigned int * ) ( 0x42401190UL ) )
    #define bFM3_MFT0_WFG_WFSA10_TMD2            *( ( volatile unsigned int * ) ( 0x42401194UL ) )
    #define bFM3_MFT0_WFG_WFSA10_GTEN0           *( ( volatile unsigned int * ) ( 0x42401198UL ) )
    #define bFM3_MFT0_WFG_WFSA10_GTEN1           *( ( volatile unsigned int * ) ( 0x4240119CUL ) )
    #define bFM3_MFT0_WFG_WFSA10_PSEL0           *( ( volatile unsigned int * ) ( 0x424011A0UL ) )
    #define bFM3_MFT0_WFG_WFSA10_PSEL1           *( ( volatile unsigned int * ) ( 0x424011A4UL ) )
    #define bFM3_MFT0_WFG_WFSA10_PGEN0           *( ( volatile unsigned int * ) ( 0x424011A8UL ) )
    #define bFM3_MFT0_WFG_WFSA10_PGEN1           *( ( volatile unsigned int * ) ( 0x424011ACUL ) )
    #define bFM3_MFT0_WFG_WFSA10_DMOD            *( ( volatile unsigned int * ) ( 0x424011B0UL ) )
    #define bFM3_MFT0_WFG_WFSA32_DCK0            *( ( volatile unsigned int * ) ( 0x42401200UL ) )
    #define bFM3_MFT0_WFG_WFSA32_DCK1            *( ( volatile unsigned int * ) ( 0x42401204UL ) )
    #define bFM3_MFT0_WFG_WFSA32_DCK2            *( ( volatile unsigned int * ) ( 0x42401208UL ) )
    #define bFM3_MFT0_WFG_WFSA32_TMD0            *( ( volatile unsigned int * ) ( 0x4240120CUL ) )
    #define bFM3_MFT0_WFG_WFSA32_TMD1            *( ( volatile unsigned int * ) ( 0x42401210UL ) )
    #define bFM3_MFT0_WFG_WFSA32_TMD2            *( ( volatile unsigned int * ) ( 0x42401214UL ) )
    #define bFM3_MFT0_WFG_WFSA32_GTEN0           *( ( volatile unsigned int * ) ( 0x42401218UL ) )
    #define bFM3_MFT0_WFG_WFSA32_GTEN1           *( ( volatile unsigned int * ) ( 0x4240121CUL ) )
    #define bFM3_MFT0_WFG_WFSA32_PSEL0           *( ( volatile unsigned int * ) ( 0x42401220UL ) )
    #define bFM3_MFT0_WFG_WFSA32_PSEL1           *( ( volatile unsigned int * ) ( 0x42401224UL ) )
    #define bFM3_MFT0_WFG_WFSA32_PGEN0           *( ( volatile unsigned int * ) ( 0x42401228UL ) )
    #define bFM3_MFT0_WFG_WFSA32_PGEN1           *( ( volatile unsigned int * ) ( 0x4240122CUL ) )
    #define bFM3_MFT0_WFG_WFSA32_DMOD            *( ( volatile unsigned int * ) ( 0x42401230UL ) )
    #define bFM3_MFT0_WFG_WFSA54_DCK0            *( ( volatile unsigned int * ) ( 0x42401280UL ) )
    #define bFM3_MFT0_WFG_WFSA54_DCK1            *( ( volatile unsigned int * ) ( 0x42401284UL ) )
    #define bFM3_MFT0_WFG_WFSA54_DCK2            *( ( volatile unsigned int * ) ( 0x42401288UL ) )
    #define bFM3_MFT0_WFG_WFSA54_TMD0            *( ( volatile unsigned int * ) ( 0x4240128CUL ) )
    #define bFM3_MFT0_WFG_WFSA54_TMD1            *( ( volatile unsigned int * ) ( 0x42401290UL ) )
    #define bFM3_MFT0_WFG_WFSA54_TMD2            *( ( volatile unsigned int * ) ( 0x42401294UL ) )
    #define bFM3_MFT0_WFG_WFSA54_GTEN0           *( ( volatile unsigned int * ) ( 0x42401298UL ) )
    #define bFM3_MFT0_WFG_WFSA54_GTEN1           *( ( volatile unsigned int * ) ( 0x4240129CUL ) )
    #define bFM3_MFT0_WFG_WFSA54_PSEL0           *( ( volatile unsigned int * ) ( 0x424012A0UL ) )
    #define bFM3_MFT0_WFG_WFSA54_PSEL1           *( ( volatile unsigned int * ) ( 0x424012A4UL ) )
    #define bFM3_MFT0_WFG_WFSA54_PGEN0           *( ( volatile unsigned int * ) ( 0x424012A8UL ) )
    #define bFM3_MFT0_WFG_WFSA54_PGEN1           *( ( volatile unsigned int * ) ( 0x424012ACUL ) )
    #define bFM3_MFT0_WFG_WFSA54_DMOD            *( ( volatile unsigned int * ) ( 0x424012B0UL ) )
    #define bFM3_MFT0_WFG_WFIR_DTIF              *( ( volatile unsigned int * ) ( 0x42401300UL ) )
    #define bFM3_MFT0_WFG_WFIR_DTIC              *( ( volatile unsigned int * ) ( 0x42401304UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIF10            *( ( volatile unsigned int * ) ( 0x42401310UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIC10            *( ( volatile unsigned int * ) ( 0x42401314UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIE10            *( ( volatile unsigned int * ) ( 0x42401318UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIS10            *( ( volatile unsigned int * ) ( 0x4240131CUL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIF32            *( ( volatile unsigned int * ) ( 0x42401320UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIC32            *( ( volatile unsigned int * ) ( 0x42401324UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIE32            *( ( volatile unsigned int * ) ( 0x42401328UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIS32            *( ( volatile unsigned int * ) ( 0x4240132CUL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIF54            *( ( volatile unsigned int * ) ( 0x42401330UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIC54            *( ( volatile unsigned int * ) ( 0x42401334UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIE54            *( ( volatile unsigned int * ) ( 0x42401338UL ) )
    #define bFM3_MFT0_WFG_WFIR_TMIS54            *( ( volatile unsigned int * ) ( 0x4240133CUL ) )
    #define bFM3_MFT0_WFG_NZCL_DTIE              *( ( volatile unsigned int * ) ( 0x42401380UL ) )
    #define bFM3_MFT0_WFG_NZCL_NWS0              *( ( volatile unsigned int * ) ( 0x42401384UL ) )
    #define bFM3_MFT0_WFG_NZCL_NWS1              *( ( volatile unsigned int * ) ( 0x42401388UL ) )
    #define bFM3_MFT0_WFG_NZCL_NWS2              *( ( volatile unsigned int * ) ( 0x4240138CUL ) )
    #define bFM3_MFT0_WFG_NZCL_SDTI              *( ( volatile unsigned int * ) ( 0x42401390UL ) )

