FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Multifunction Timer unit 0 Input Capture Unit registers */
    #define bFM3_MFT0_ICU_ICFS10_FSI00           *( ( volatile unsigned int * ) ( 0x42400C00UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI01           *( ( volatile unsigned int * ) ( 0x42400C04UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI02           *( ( volatile unsigned int * ) ( 0x42400C08UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI03           *( ( volatile unsigned int * ) ( 0x42400C0CUL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI10           *( ( volatile unsigned int * ) ( 0x42400C10UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI11           *( ( volatile unsigned int * ) ( 0x42400C14UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI12           *( ( volatile unsigned int * ) ( 0x42400C18UL ) )
    #define bFM3_MFT0_ICU_ICFS10_FSI13           *( ( volatile unsigned int * ) ( 0x42400C1CUL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI20           *( ( volatile unsigned int * ) ( 0x42400C20UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI21           *( ( volatile unsigned int * ) ( 0x42400C24UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI22           *( ( volatile unsigned int * ) ( 0x42400C28UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI23           *( ( volatile unsigned int * ) ( 0x42400C2CUL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI30           *( ( volatile unsigned int * ) ( 0x42400C30UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI31           *( ( volatile unsigned int * ) ( 0x42400C34UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI32           *( ( volatile unsigned int * ) ( 0x42400C38UL ) )
    #define bFM3_MFT0_ICU_ICFS32_FSI33           *( ( volatile unsigned int * ) ( 0x42400C3CUL ) )
    #define bFM3_MFT0_ICU_ICSA10_EG00            *( ( volatile unsigned int * ) ( 0x42400F00UL ) )
    #define bFM3_MFT0_ICU_ICSA10_EG01            *( ( volatile unsigned int * ) ( 0x42400F04UL ) )
    #define bFM3_MFT0_ICU_ICSA10_EG10            *( ( volatile unsigned int * ) ( 0x42400F08UL ) )
    #define bFM3_MFT0_ICU_ICSA10_EG11            *( ( volatile unsigned int * ) ( 0x42400F0CUL ) )
    #define bFM3_MFT0_ICU_ICSA10_ICE0            *( ( volatile unsigned int * ) ( 0x42400F10UL ) )
    #define bFM3_MFT0_ICU_ICSA10_ICE1            *( ( volatile unsigned int * ) ( 0x42400F14UL ) )
    #define bFM3_MFT0_ICU_ICSA10_IPC0            *( ( volatile unsigned int * ) ( 0x42400F18UL ) )
    #define bFM3_MFT0_ICU_ICSA10_IPC1            *( ( volatile unsigned int * ) ( 0x42400F1CUL ) )
    #define bFM3_MFT0_ICU_ICSB10_IEI0            *( ( volatile unsigned int * ) ( 0x42400F20UL ) )
    #define bFM3_MFT0_ICU_ICSB10_IEI1            *( ( volatile unsigned int * ) ( 0x42400F24UL ) )
    #define bFM3_MFT0_ICU_ICSA32_EG20            *( ( volatile unsigned int * ) ( 0x42400F80UL ) )
    #define bFM3_MFT0_ICU_ICSA32_EG21            *( ( volatile unsigned int * ) ( 0x42400F84UL ) )
    #define bFM3_MFT0_ICU_ICSA32_EG30            *( ( volatile unsigned int * ) ( 0x42400F88UL ) )
    #define bFM3_MFT0_ICU_ICSA32_EG31            *( ( volatile unsigned int * ) ( 0x42400F8CUL ) )
    #define bFM3_MFT0_ICU_ICSA32_ICE2            *( ( volatile unsigned int * ) ( 0x42400F90UL ) )
    #define bFM3_MFT0_ICU_ICSA32_ICE3            *( ( volatile unsigned int * ) ( 0x42400F94UL ) )
    #define bFM3_MFT0_ICU_ICSA32_IPC2            *( ( volatile unsigned int * ) ( 0x42400F98UL ) )
    #define bFM3_MFT0_ICU_ICSA32_IPC3            *( ( volatile unsigned int * ) ( 0x42400F9CUL ) )
    #define bFM3_MFT0_ICU_ICSB32_IEI2            *( ( volatile unsigned int * ) ( 0x42400FA0UL ) )
    #define bFM3_MFT0_ICU_ICSB32_IEI3            *( ( volatile unsigned int * ) ( 0x42400FA4UL ) )

/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
    #define bFM3_MFT0_ADCMP_ACSB_BDIS0           *( ( volatile unsigned int * ) ( 0x42401700UL ) )
    #define bFM3_MFT0_ADCMP_ACSB_BDIS1           *( ( volatile unsigned int * ) ( 0x42401704UL ) )
    #define bFM3_MFT0_ADCMP_ACSB_BDIS2           *( ( volatile unsigned int * ) ( 0x42401708UL ) )
    #define bFM3_MFT0_ADCMP_ACSB_BTS0            *( ( volatile unsigned int * ) ( 0x42401710UL ) )
    #define bFM3_MFT0_ADCMP_ACSB_BTS1            *( ( volatile unsigned int * ) ( 0x42401714UL ) )
    #define bFM3_MFT0_ADCMP_ACSB_BTS2            *( ( volatile unsigned int * ) ( 0x42401718UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE00            *( ( volatile unsigned int * ) ( 0x42401780UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE01            *( ( volatile unsigned int * ) ( 0x42401784UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE10            *( ( volatile unsigned int * ) ( 0x42401788UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE11            *( ( volatile unsigned int * ) ( 0x4240178CUL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE20            *( ( volatile unsigned int * ) ( 0x42401790UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_CE21            *( ( volatile unsigned int * ) ( 0x42401794UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL00           *( ( volatile unsigned int * ) ( 0x424017A0UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL01           *( ( volatile unsigned int * ) ( 0x424017A4UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL10           *( ( volatile unsigned int * ) ( 0x424017A8UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL11           *( ( volatile unsigned int * ) ( 0x424017ACUL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL20           *( ( volatile unsigned int * ) ( 0x424017B0UL ) )
    #define bFM3_MFT0_ADCMP_ACSA_SEL21           *( ( volatile unsigned int * ) ( 0x424017B4UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD0S0           *( ( volatile unsigned int * ) ( 0x42401800UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD0S1           *( ( volatile unsigned int * ) ( 0x42401804UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD1S0           *( ( volatile unsigned int * ) ( 0x42401808UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD1S1           *( ( volatile unsigned int * ) ( 0x4240180CUL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD2S0           *( ( volatile unsigned int * ) ( 0x42401810UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD2S1           *( ( volatile unsigned int * ) ( 0x42401814UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD0P0           *( ( volatile unsigned int * ) ( 0x42401820UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD0P1           *( ( volatile unsigned int * ) ( 0x42401824UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD1P0           *( ( volatile unsigned int * ) ( 0x42401828UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD1P1           *( ( volatile unsigned int * ) ( 0x4240182CUL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD2P0           *( ( volatile unsigned int * ) ( 0x42401830UL ) )
    #define bFM3_MFT0_ADCMP_ATSA_AD2P1           *( ( volatile unsigned int * ) ( 0x42401834UL ) )

/* Multifunction Timer unit 1 Free Running Timer registers */
    #define bFM3_MFT1_FRT_TCSA0_CLK0             *( ( volatile unsigned int * ) ( 0x42420600UL ) )
    #define bFM3_MFT1_FRT_TCSA0_CLK1             *( ( volatile unsigned int * ) ( 0x42420604UL ) )
    #define bFM3_MFT1_FRT_TCSA0_CLK2             *( ( volatile unsigned int * ) ( 0x42420608UL ) )
    #define bFM3_MFT1_FRT_TCSA0_CLK3             *( ( volatile unsigned int * ) ( 0x4242060CUL ) )
    #define bFM3_MFT1_FRT_TCSA0_SCLR             *( ( volatile unsigned int * ) ( 0x42420610UL ) )
    #define bFM3_MFT1_FRT_TCSA0_MODE             *( ( volatile unsigned int * ) ( 0x42420614UL ) )
    #define bFM3_MFT1_FRT_TCSA0_STOP             *( ( volatile unsigned int * ) ( 0x42420618UL ) )
    #define bFM3_MFT1_FRT_TCSA0_BFE              *( ( volatile unsigned int * ) ( 0x4242061CUL ) )
    #define bFM3_MFT1_FRT_TCSA0_ICRE             *( ( volatile unsigned int * ) ( 0x42420620UL ) )
    #define bFM3_MFT1_FRT_TCSA0_ICLR             *( ( volatile unsigned int * ) ( 0x42420624UL ) )
    #define bFM3_MFT1_FRT_TCSA0_IRQZE            *( ( volatile unsigned int * ) ( 0x42420634UL ) )
    #define bFM3_MFT1_FRT_TCSA0_IRQZF            *( ( volatile unsigned int * ) ( 0x42420638UL ) )
    #define bFM3_MFT1_FRT_TCSA0_ECKE             *( ( volatile unsigned int * ) ( 0x4242063CUL ) )
    #define bFM3_MFT1_FRT_TCSB0_AD0E             *( ( volatile unsigned int * ) ( 0x42420680UL ) )
    #define bFM3_MFT1_FRT_TCSB0_AD1E             *( ( volatile unsigned int * ) ( 0x42420684UL ) )
    #define bFM3_MFT1_FRT_TCSB0_AD2E             *( ( volatile unsigned int * ) ( 0x42420688UL ) )
    #define bFM3_MFT1_FRT_TCSA1_CLK0             *( ( volatile unsigned int * ) ( 0x42420800UL ) )
    #define bFM3_MFT1_FRT_TCSA1_CLK1             *( ( volatile unsigned int * ) ( 0x42420804UL ) )
    #define bFM3_MFT1_FRT_TCSA1_CLK2             *( ( volatile unsigned int * ) ( 0x42420808UL ) )
    #define bFM3_MFT1_FRT_TCSA1_CLK3             *( ( volatile unsigned int * ) ( 0x4242080CUL ) )
    #define bFM3_MFT1_FRT_TCSA1_SCLR             *( ( volatile unsigned int * ) ( 0x42420810UL ) )
    #define bFM3_MFT1_FRT_TCSA1_MODE             *( ( volatile unsigned int * ) ( 0x42420814UL ) )
    #define bFM3_MFT1_FRT_TCSA1_STOP             *( ( volatile unsigned int * ) ( 0x42420818UL ) )
    #define bFM3_MFT1_FRT_TCSA1_BFE              *( ( volatile unsigned int * ) ( 0x4242081CUL ) )
    #define bFM3_MFT1_FRT_TCSA1_ICRE             *( ( volatile unsigned int * ) ( 0x42420820UL ) )
    #define bFM3_MFT1_FRT_TCSA1_ICLR             *( ( volatile unsigned int * ) ( 0x42420824UL ) )
    #define bFM3_MFT1_FRT_TCSA1_IRQZE            *( ( volatile unsigned int * ) ( 0x42420834UL ) )
    #define bFM3_MFT1_FRT_TCSA1_IRQZF            *( ( volatile unsigned int * ) ( 0x42420838UL ) )
    #define bFM3_MFT1_FRT_TCSA1_ECKE             *( ( volatile unsigned int * ) ( 0x4242083CUL ) )
    #define bFM3_MFT1_FRT_TCSB1_AD0E             *( ( volatile unsigned int * ) ( 0x42420880UL ) )
    #define bFM3_MFT1_FRT_TCSB1_AD1E             *( ( volatile unsigned int * ) ( 0x42420884UL ) )
    #define bFM3_MFT1_FRT_TCSB1_AD2E             *( ( volatile unsigned int * ) ( 0x42420888UL ) )
    #define bFM3_MFT1_FRT_TCSA2_CLK0             *( ( volatile unsigned int * ) ( 0x42420A00UL ) )
    #define bFM3_MFT1_FRT_TCSA2_CLK1             *( ( volatile unsigned int * ) ( 0x42420A04UL ) )
    #define bFM3_MFT1_FRT_TCSA2_CLK2             *( ( volatile unsigned int * ) ( 0x42420A08UL ) )
    #define bFM3_MFT1_FRT_TCSA2_CLK3             *( ( volatile unsigned int * ) ( 0x42420A0CUL ) )
    #define bFM3_MFT1_FRT_TCSA2_SCLR             *( ( volatile unsigned int * ) ( 0x42420A10UL ) )
    #define bFM3_MFT1_FRT_TCSA2_MODE             *( ( volatile unsigned int * ) ( 0x42420A14UL ) )
    #define bFM3_MFT1_FRT_TCSA2_STOP             *( ( volatile unsigned int * ) ( 0x42420A18UL ) )
    #define bFM3_MFT1_FRT_TCSA2_BFE              *( ( volatile unsigned int * ) ( 0x42420A1CUL ) )
    #define bFM3_MFT1_FRT_TCSA2_ICRE             *( ( volatile unsigned int * ) ( 0x42420A20UL ) )
    #define bFM3_MFT1_FRT_TCSA2_ICLR             *( ( volatile unsigned int * ) ( 0x42420A24UL ) )
    #define bFM3_MFT1_FRT_TCSA2_IRQZE            *( ( volatile unsigned int * ) ( 0x42420A34UL ) )
    #define bFM3_MFT1_FRT_TCSA2_IRQZF            *( ( volatile unsigned int * ) ( 0x42420A38UL ) )
    #define bFM3_MFT1_FRT_TCSA2_ECKE             *( ( volatile unsigned int * ) ( 0x42420A3CUL ) )
    #define bFM3_MFT1_FRT_TCSB2_AD0E             *( ( volatile unsigned int * ) ( 0x42420A80UL ) )
    #define bFM3_MFT1_FRT_TCSB2_AD1E             *( ( volatile unsigned int * ) ( 0x42420A84UL ) )
    #define bFM3_MFT1_FRT_TCSB2_AD2E             *( ( volatile unsigned int * ) ( 0x42420A88UL ) )

/* Multifunction Timer unit 1 Output Compare Unit registers */
    #define bFM3_MFT1_OCU_OCSA10_CST0            *( ( volatile unsigned int * ) ( 0x42420300UL ) )
    #define bFM3_MFT1_OCU_OCSA10_CST1            *( ( volatile unsigned int * ) ( 0x42420304UL ) )
    #define bFM3_MFT1_OCU_OCSA10_BDIS0           *( ( volatile unsigned int * ) ( 0x42420308UL ) )
    #define bFM3_MFT1_OCU_OCSA10_BDIS1           *( ( volatile unsigned int * ) ( 0x4242030CUL ) )
    #define bFM3_MFT1_OCU_OCSA10_IOE0            *( ( volatile unsigned int * ) ( 0x42420310UL ) )
    #define bFM3_MFT1_OCU_OCSA10_IOE1            *( ( volatile unsigned int * ) ( 0x42420314UL ) )
    #define bFM3_MFT1_OCU_OCSA10_IOP0            *( ( volatile unsigned int * ) ( 0x42420318UL ) )
    #define bFM3_MFT1_OCU_OCSA10_IOP1            *( ( volatile unsigned int * ) ( 0x4242031CUL ) )
    #define bFM3_MFT1_OCU_OCSB10_OTD0            *( ( volatile unsigned int * ) ( 0x42420320UL ) )
    #define bFM3_MFT1_OCU_OCSB10_OTD1            *( ( volatile unsigned int * ) ( 0x42420324UL ) )
    #define bFM3_MFT1_OCU_OCSB10_CMOD            *( ( volatile unsigned int * ) ( 0x42420330UL ) )
    #define bFM3_MFT1_OCU_OCSB10_BTS0            *( ( volatile unsigned int * ) ( 0x42420334UL ) )
    #define bFM3_MFT1_OCU_OCSB10_BTS1            *( ( volatile unsigned int * ) ( 0x42420338UL ) )
    #define bFM3_MFT1_OCU_OCSA32_CST2            *( ( volatile unsigned int * ) ( 0x42420380UL ) )
    #define bFM3_MFT1_OCU_OCSA32_CST3            *( ( volatile unsigned int * ) ( 0x42420384UL ) )
    #define bFM3_MFT1_OCU_OCSA32_BDIS2           *( ( volatile unsigned int * ) ( 0x42420388UL ) )
    #define bFM3_MFT1_OCU_OCSA32_BDIS3           *( ( volatile unsigned int * ) ( 0x4242038CUL ) )
    #define bFM3_MFT1_OCU_OCSA32_IOE2            *( ( volatile unsigned int * ) ( 0x42420390UL ) )
    #define bFM3_MFT1_OCU_OCSA32_IOE3            *( ( volatile unsigned int * ) ( 0x42420394UL ) )
    #define bFM3_MFT1_OCU_OCSA32_IOP2            *( ( volatile unsigned int * ) ( 0x42420398UL ) )
    #define bFM3_MFT1_OCU_OCSA32_IOP3            *( ( volatile unsigned int * ) ( 0x4242039CUL ) )
    #define bFM3_MFT1_OCU_OCSB32_OTD2            *( ( volatile unsigned int * ) ( 0x424203A0UL ) )
    #define bFM3_MFT1_OCU_OCSB32_OTD3            *( ( volatile unsigned int * ) ( 0x424203A4UL ) )
    #define bFM3_MFT1_OCU_OCSB32_CMOD            *( ( volatile unsigned int * ) ( 0x424203B0UL ) )
    #define bFM3_MFT1_OCU_OCSB32_BTS2            *( ( volatile unsigned int * ) ( 0x424203B4UL ) )
    #define bFM3_MFT1_OCU_OCSB32_BTS3            *( ( volatile unsigned int * ) ( 0x424203B8UL ) )
    #define bFM3_MFT1_OCU_OCSA54_CST4            *( ( volatile unsigned int * ) ( 0x42420400UL ) )
    #define bFM3_MFT1_OCU_OCSA54_CST5            *( ( volatile unsigned int * ) ( 0x42420404UL ) )
    #define bFM3_MFT1_OCU_OCSA54_BDIS4           *( ( volatile unsigned int * ) ( 0x42420408UL ) )
    #define bFM3_MFT1_OCU_OCSA54_BDIS5           *( ( volatile unsigned int * ) ( 0x4242040CUL ) )
    #define bFM3_MFT1_OCU_OCSA54_IOE4            *( ( volatile unsigned int * ) ( 0x42420410UL ) )
    #define bFM3_MFT1_OCU_OCSA54_IOE5            *( ( volatile unsigned int * ) ( 0x42420414UL ) )
    #define bFM3_MFT1_OCU_OCSA54_IOP4            *( ( volatile unsigned int * ) ( 0x42420418UL ) )
    #define bFM3_MFT1_OCU_OCSA54_IOP5            *( ( volatile unsigned int * ) ( 0x4242041CUL ) )
    #define bFM3_MFT1_OCU_OCSB54_OTD4            *( ( volatile unsigned int * ) ( 0x42420420UL ) )
    #define bFM3_MFT1_OCU_OCSB54_OTD5            *( ( volatile unsigned int * ) ( 0x42420424UL ) )
    #define bFM3_MFT1_OCU_OCSB54_CMOD            *( ( volatile unsigned int * ) ( 0x42420430UL ) )
    #define bFM3_MFT1_OCU_OCSB54_BTS4            *( ( volatile unsigned int * ) ( 0x42420434UL ) )
    #define bFM3_MFT1_OCU_OCSB54_BTS5            *( ( volatile unsigned int * ) ( 0x42420438UL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD0              *( ( volatile unsigned int * ) ( 0x424204A0UL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD1              *( ( volatile unsigned int * ) ( 0x424204A4UL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD2              *( ( volatile unsigned int * ) ( 0x424204A8UL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD3              *( ( volatile unsigned int * ) ( 0x424204ACUL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD4              *( ( volatile unsigned int * ) ( 0x424204B0UL ) )
    #define bFM3_MFT1_OCU_OCSC_MOD5              *( ( volatile unsigned int * ) ( 0x424204B4UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO00           *( ( volatile unsigned int * ) ( 0x42420B00UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO01           *( ( volatile unsigned int * ) ( 0x42420B04UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO02           *( ( volatile unsigned int * ) ( 0x42420B08UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO03           *( ( volatile unsigned int * ) ( 0x42420B0CUL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO10           *( ( volatile unsigned int * ) ( 0x42420B10UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO11           *( ( volatile unsigned int * ) ( 0x42420B14UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO12           *( ( volatile unsigned int * ) ( 0x42420B18UL ) )
    #define bFM3_MFT1_OCU_OCFS10_FSO13           *( ( volatile unsigned int * ) ( 0x42420B1CUL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO20           *( ( volatile unsigned int * ) ( 0x42420B20UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO21           *( ( volatile unsigned int * ) ( 0x42420B24UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO22           *( ( volatile unsigned int * ) ( 0x42420B28UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO23           *( ( volatile unsigned int * ) ( 0x42420B2CUL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO30           *( ( volatile unsigned int * ) ( 0x42420B30UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO31           *( ( volatile unsigned int * ) ( 0x42420B34UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO32           *( ( volatile unsigned int * ) ( 0x42420B38UL ) )
    #define bFM3_MFT1_OCU_OCFS32_FSO33           *( ( volatile unsigned int * ) ( 0x42420B3CUL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO40           *( ( volatile unsigned int * ) ( 0x42420B80UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO41           *( ( volatile unsigned int * ) ( 0x42420B84UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO42           *( ( volatile unsigned int * ) ( 0x42420B88UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO43           *( ( volatile unsigned int * ) ( 0x42420B8CUL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO50           *( ( volatile unsigned int * ) ( 0x42420B90UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO51           *( ( volatile unsigned int * ) ( 0x42420B94UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO52           *( ( volatile unsigned int * ) ( 0x42420B98UL ) )
    #define bFM3_MFT1_OCU_OCFS54_FSO53           *( ( volatile unsigned int * ) ( 0x42420B9CUL ) )

