FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Multifunction Timer unit 1 Waveform Generator and Noise Canceler registers */
    #define bFM3_MFT1_WFG_WFSA10_DCK0            *( ( volatile unsigned int * ) ( 0x42421180UL ) )
    #define bFM3_MFT1_WFG_WFSA10_DCK1            *( ( volatile unsigned int * ) ( 0x42421184UL ) )
    #define bFM3_MFT1_WFG_WFSA10_DCK2            *( ( volatile unsigned int * ) ( 0x42421188UL ) )
    #define bFM3_MFT1_WFG_WFSA10_TMD0            *( ( volatile unsigned int * ) ( 0x4242118CUL ) )
    #define bFM3_MFT1_WFG_WFSA10_TMD1            *( ( volatile unsigned int * ) ( 0x42421190UL ) )
    #define bFM3_MFT1_WFG_WFSA10_TMD2            *( ( volatile unsigned int * ) ( 0x42421194UL ) )
    #define bFM3_MFT1_WFG_WFSA10_GTEN0           *( ( volatile unsigned int * ) ( 0x42421198UL ) )
    #define bFM3_MFT1_WFG_WFSA10_GTEN1           *( ( volatile unsigned int * ) ( 0x4242119CUL ) )
    #define bFM3_MFT1_WFG_WFSA10_PSEL0           *( ( volatile unsigned int * ) ( 0x424211A0UL ) )
    #define bFM3_MFT1_WFG_WFSA10_PSEL1           *( ( volatile unsigned int * ) ( 0x424211A4UL ) )
    #define bFM3_MFT1_WFG_WFSA10_PGEN0           *( ( volatile unsigned int * ) ( 0x424211A8UL ) )
    #define bFM3_MFT1_WFG_WFSA10_PGEN1           *( ( volatile unsigned int * ) ( 0x424211ACUL ) )
    #define bFM3_MFT1_WFG_WFSA10_DMOD            *( ( volatile unsigned int * ) ( 0x424211B0UL ) )
    #define bFM3_MFT1_WFG_WFSA32_DCK0            *( ( volatile unsigned int * ) ( 0x42421200UL ) )
    #define bFM3_MFT1_WFG_WFSA32_DCK1            *( ( volatile unsigned int * ) ( 0x42421204UL ) )
    #define bFM3_MFT1_WFG_WFSA32_DCK2            *( ( volatile unsigned int * ) ( 0x42421208UL ) )
    #define bFM3_MFT1_WFG_WFSA32_TMD0            *( ( volatile unsigned int * ) ( 0x4242120CUL ) )
    #define bFM3_MFT1_WFG_WFSA32_TMD1            *( ( volatile unsigned int * ) ( 0x42421210UL ) )
    #define bFM3_MFT1_WFG_WFSA32_TMD2            *( ( volatile unsigned int * ) ( 0x42421214UL ) )
    #define bFM3_MFT1_WFG_WFSA32_GTEN0           *( ( volatile unsigned int * ) ( 0x42421218UL ) )
    #define bFM3_MFT1_WFG_WFSA32_GTEN1           *( ( volatile unsigned int * ) ( 0x4242121CUL ) )
    #define bFM3_MFT1_WFG_WFSA32_PSEL0           *( ( volatile unsigned int * ) ( 0x42421220UL ) )
    #define bFM3_MFT1_WFG_WFSA32_PSEL1           *( ( volatile unsigned int * ) ( 0x42421224UL ) )
    #define bFM3_MFT1_WFG_WFSA32_PGEN0           *( ( volatile unsigned int * ) ( 0x42421228UL ) )
    #define bFM3_MFT1_WFG_WFSA32_PGEN1           *( ( volatile unsigned int * ) ( 0x4242122CUL ) )
    #define bFM3_MFT1_WFG_WFSA32_DMOD            *( ( volatile unsigned int * ) ( 0x42421230UL ) )
    #define bFM3_MFT1_WFG_WFSA54_DCK0            *( ( volatile unsigned int * ) ( 0x42421280UL ) )
    #define bFM3_MFT1_WFG_WFSA54_DCK1            *( ( volatile unsigned int * ) ( 0x42421284UL ) )
    #define bFM3_MFT1_WFG_WFSA54_DCK2            *( ( volatile unsigned int * ) ( 0x42421288UL ) )
    #define bFM3_MFT1_WFG_WFSA54_TMD0            *( ( volatile unsigned int * ) ( 0x4242128CUL ) )
    #define bFM3_MFT1_WFG_WFSA54_TMD1            *( ( volatile unsigned int * ) ( 0x42421290UL ) )
    #define bFM3_MFT1_WFG_WFSA54_TMD2            *( ( volatile unsigned int * ) ( 0x42421294UL ) )
    #define bFM3_MFT1_WFG_WFSA54_GTEN0           *( ( volatile unsigned int * ) ( 0x42421298UL ) )
    #define bFM3_MFT1_WFG_WFSA54_GTEN1           *( ( volatile unsigned int * ) ( 0x4242129CUL ) )
    #define bFM3_MFT1_WFG_WFSA54_PSEL0           *( ( volatile unsigned int * ) ( 0x424212A0UL ) )
    #define bFM3_MFT1_WFG_WFSA54_PSEL1           *( ( volatile unsigned int * ) ( 0x424212A4UL ) )
    #define bFM3_MFT1_WFG_WFSA54_PGEN0           *( ( volatile unsigned int * ) ( 0x424212A8UL ) )
    #define bFM3_MFT1_WFG_WFSA54_PGEN1           *( ( volatile unsigned int * ) ( 0x424212ACUL ) )
    #define bFM3_MFT1_WFG_WFSA54_DMOD            *( ( volatile unsigned int * ) ( 0x424212B0UL ) )
    #define bFM3_MFT1_WFG_WFIR_DTIF              *( ( volatile unsigned int * ) ( 0x42421300UL ) )
    #define bFM3_MFT1_WFG_WFIR_DTIC              *( ( volatile unsigned int * ) ( 0x42421304UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIF10            *( ( volatile unsigned int * ) ( 0x42421310UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIC10            *( ( volatile unsigned int * ) ( 0x42421314UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIE10            *( ( volatile unsigned int * ) ( 0x42421318UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIS10            *( ( volatile unsigned int * ) ( 0x4242131CUL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIF32            *( ( volatile unsigned int * ) ( 0x42421320UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIC32            *( ( volatile unsigned int * ) ( 0x42421324UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIE32            *( ( volatile unsigned int * ) ( 0x42421328UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIS32            *( ( volatile unsigned int * ) ( 0x4242132CUL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIF54            *( ( volatile unsigned int * ) ( 0x42421330UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIC54            *( ( volatile unsigned int * ) ( 0x42421334UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIE54            *( ( volatile unsigned int * ) ( 0x42421338UL ) )
    #define bFM3_MFT1_WFG_WFIR_TMIS54            *( ( volatile unsigned int * ) ( 0x4242133CUL ) )
    #define bFM3_MFT1_WFG_NZCL_DTIE              *( ( volatile unsigned int * ) ( 0x42421380UL ) )
    #define bFM3_MFT1_WFG_NZCL_NWS0              *( ( volatile unsigned int * ) ( 0x42421384UL ) )
    #define bFM3_MFT1_WFG_NZCL_NWS1              *( ( volatile unsigned int * ) ( 0x42421388UL ) )
    #define bFM3_MFT1_WFG_NZCL_NWS2              *( ( volatile unsigned int * ) ( 0x4242138CUL ) )
    #define bFM3_MFT1_WFG_NZCL_SDTI              *( ( volatile unsigned int * ) ( 0x42421390UL ) )

/* Multifunction Timer unit 1 Input Capture Unit registers */
    #define bFM3_MFT1_ICU_ICFS10_FSI00           *( ( volatile unsigned int * ) ( 0x42420C00UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI01           *( ( volatile unsigned int * ) ( 0x42420C04UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI02           *( ( volatile unsigned int * ) ( 0x42420C08UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI03           *( ( volatile unsigned int * ) ( 0x42420C0CUL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI10           *( ( volatile unsigned int * ) ( 0x42420C10UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI11           *( ( volatile unsigned int * ) ( 0x42420C14UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI12           *( ( volatile unsigned int * ) ( 0x42420C18UL ) )
    #define bFM3_MFT1_ICU_ICFS10_FSI13           *( ( volatile unsigned int * ) ( 0x42420C1CUL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI20           *( ( volatile unsigned int * ) ( 0x42420C20UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI21           *( ( volatile unsigned int * ) ( 0x42420C24UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI22           *( ( volatile unsigned int * ) ( 0x42420C28UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI23           *( ( volatile unsigned int * ) ( 0x42420C2CUL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI30           *( ( volatile unsigned int * ) ( 0x42420C30UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI31           *( ( volatile unsigned int * ) ( 0x42420C34UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI32           *( ( volatile unsigned int * ) ( 0x42420C38UL ) )
    #define bFM3_MFT1_ICU_ICFS32_FSI33           *( ( volatile unsigned int * ) ( 0x42420C3CUL ) )
    #define bFM3_MFT1_ICU_ICSA10_EG00            *( ( volatile unsigned int * ) ( 0x42420F00UL ) )
    #define bFM3_MFT1_ICU_ICSA10_EG01            *( ( volatile unsigned int * ) ( 0x42420F04UL ) )
    #define bFM3_MFT1_ICU_ICSA10_EG10            *( ( volatile unsigned int * ) ( 0x42420F08UL ) )
    #define bFM3_MFT1_ICU_ICSA10_EG11            *( ( volatile unsigned int * ) ( 0x42420F0CUL ) )
    #define bFM3_MFT1_ICU_ICSA10_ICE0            *( ( volatile unsigned int * ) ( 0x42420F10UL ) )
    #define bFM3_MFT1_ICU_ICSA10_ICE1            *( ( volatile unsigned int * ) ( 0x42420F14UL ) )
    #define bFM3_MFT1_ICU_ICSA10_IPC0            *( ( volatile unsigned int * ) ( 0x42420F18UL ) )
    #define bFM3_MFT1_ICU_ICSA10_IPC1            *( ( volatile unsigned int * ) ( 0x42420F1CUL ) )
    #define bFM3_MFT1_ICU_ICSB10_IEI0            *( ( volatile unsigned int * ) ( 0x42420F20UL ) )
    #define bFM3_MFT1_ICU_ICSB10_IEI1            *( ( volatile unsigned int * ) ( 0x42420F24UL ) )
    #define bFM3_MFT1_ICU_ICSA32_EG20            *( ( volatile unsigned int * ) ( 0x42420F80UL ) )
    #define bFM3_MFT1_ICU_ICSA32_EG21            *( ( volatile unsigned int * ) ( 0x42420F84UL ) )
    #define bFM3_MFT1_ICU_ICSA32_EG30            *( ( volatile unsigned int * ) ( 0x42420F88UL ) )
    #define bFM3_MFT1_ICU_ICSA32_EG31            *( ( volatile unsigned int * ) ( 0x42420F8CUL ) )
    #define bFM3_MFT1_ICU_ICSA32_ICE2            *( ( volatile unsigned int * ) ( 0x42420F90UL ) )
    #define bFM3_MFT1_ICU_ICSA32_ICE3            *( ( volatile unsigned int * ) ( 0x42420F94UL ) )
    #define bFM3_MFT1_ICU_ICSA32_IPC2            *( ( volatile unsigned int * ) ( 0x42420F98UL ) )
    #define bFM3_MFT1_ICU_ICSA32_IPC3            *( ( volatile unsigned int * ) ( 0x42420F9CUL ) )
    #define bFM3_MFT1_ICU_ICSB32_IEI2            *( ( volatile unsigned int * ) ( 0x42420FA0UL ) )
    #define bFM3_MFT1_ICU_ICSB32_IEI3            *( ( volatile unsigned int * ) ( 0x42420FA4UL ) )

