FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Multifunction Timer unit 1 ADC Start Compare Unit registers */
    #define bFM3_MFT1_ADCMP_ACSB_BDIS0           *( ( volatile unsigned int * ) ( 0x42421700UL ) )
    #define bFM3_MFT1_ADCMP_ACSB_BDIS1           *( ( volatile unsigned int * ) ( 0x42421704UL ) )
    #define bFM3_MFT1_ADCMP_ACSB_BDIS2           *( ( volatile unsigned int * ) ( 0x42421708UL ) )
    #define bFM3_MFT1_ADCMP_ACSB_BTS0            *( ( volatile unsigned int * ) ( 0x42421710UL ) )
    #define bFM3_MFT1_ADCMP_ACSB_BTS1            *( ( volatile unsigned int * ) ( 0x42421714UL ) )
    #define bFM3_MFT1_ADCMP_ACSB_BTS2            *( ( volatile unsigned int * ) ( 0x42421718UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE00            *( ( volatile unsigned int * ) ( 0x42421780UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE01            *( ( volatile unsigned int * ) ( 0x42421784UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE10            *( ( volatile unsigned int * ) ( 0x42421788UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE11            *( ( volatile unsigned int * ) ( 0x4242178CUL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE20            *( ( volatile unsigned int * ) ( 0x42421790UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_CE21            *( ( volatile unsigned int * ) ( 0x42421794UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL00           *( ( volatile unsigned int * ) ( 0x424217A0UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL01           *( ( volatile unsigned int * ) ( 0x424217A4UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL10           *( ( volatile unsigned int * ) ( 0x424217A8UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL11           *( ( volatile unsigned int * ) ( 0x424217ACUL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL20           *( ( volatile unsigned int * ) ( 0x424217B0UL ) )
    #define bFM3_MFT1_ADCMP_ACSA_SEL21           *( ( volatile unsigned int * ) ( 0x424217B4UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD0S0           *( ( volatile unsigned int * ) ( 0x42421800UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD0S1           *( ( volatile unsigned int * ) ( 0x42421804UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD1S0           *( ( volatile unsigned int * ) ( 0x42421808UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD1S1           *( ( volatile unsigned int * ) ( 0x4242180CUL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD2S0           *( ( volatile unsigned int * ) ( 0x42421810UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD2S1           *( ( volatile unsigned int * ) ( 0x42421814UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD0P0           *( ( volatile unsigned int * ) ( 0x42421820UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD0P1           *( ( volatile unsigned int * ) ( 0x42421824UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD1P0           *( ( volatile unsigned int * ) ( 0x42421828UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD1P1           *( ( volatile unsigned int * ) ( 0x4242182CUL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD2P0           *( ( volatile unsigned int * ) ( 0x42421830UL ) )
    #define bFM3_MFT1_ADCMP_ATSA_AD2P1           *( ( volatile unsigned int * ) ( 0x42421834UL ) )

/* Multifunction Timer PPG registers */
    #define bFM3_MFT_PPG_TTCR0_STR0              *( ( volatile unsigned int * ) ( 0x42480020UL ) )
    #define bFM3_MFT_PPG_TTCR0_MONI0             *( ( volatile unsigned int * ) ( 0x42480024UL ) )
    #define bFM3_MFT_PPG_TTCR0_CS00              *( ( volatile unsigned int * ) ( 0x42480028UL ) )
    #define bFM3_MFT_PPG_TTCR0_CS01              *( ( volatile unsigned int * ) ( 0x4248002CUL ) )
    #define bFM3_MFT_PPG_TTCR0_TRG0O             *( ( volatile unsigned int * ) ( 0x42480030UL ) )
    #define bFM3_MFT_PPG_TTCR0_TRG2O             *( ( volatile unsigned int * ) ( 0x42480034UL ) )
    #define bFM3_MFT_PPG_TTCR0_TRG4O             *( ( volatile unsigned int * ) ( 0x42480038UL ) )
    #define bFM3_MFT_PPG_TTCR0_TRG6O             *( ( volatile unsigned int * ) ( 0x4248003CUL ) )
    #define bFM3_MFT_PPG_TTCR1_STR1              *( ( volatile unsigned int * ) ( 0x42480420UL ) )
    #define bFM3_MFT_PPG_TTCR1_MONI1             *( ( volatile unsigned int * ) ( 0x42480424UL ) )
    #define bFM3_MFT_PPG_TTCR1_CS10              *( ( volatile unsigned int * ) ( 0x42480428UL ) )
    #define bFM3_MFT_PPG_TTCR1_CS11              *( ( volatile unsigned int * ) ( 0x4248042CUL ) )
    #define bFM3_MFT_PPG_TTCR1_TRG1O             *( ( volatile unsigned int * ) ( 0x42480430UL ) )
    #define bFM3_MFT_PPG_TTCR1_TRG3O             *( ( volatile unsigned int * ) ( 0x42480434UL ) )
    #define bFM3_MFT_PPG_TTCR1_TRG5O             *( ( volatile unsigned int * ) ( 0x42480438UL ) )
    #define bFM3_MFT_PPG_TTCR1_TRG7O             *( ( volatile unsigned int * ) ( 0x4248043CUL ) )
    #define bFM3_MFT_PPG_TRG_PEN00               *( ( volatile unsigned int * ) ( 0x42482000UL ) )
    #define bFM3_MFT_PPG_TRG_PEN01               *( ( volatile unsigned int * ) ( 0x42482004UL ) )
    #define bFM3_MFT_PPG_TRG_PEN02               *( ( volatile unsigned int * ) ( 0x42482008UL ) )
    #define bFM3_MFT_PPG_TRG_PEN03               *( ( volatile unsigned int * ) ( 0x4248200CUL ) )
    #define bFM3_MFT_PPG_TRG_PEN04               *( ( volatile unsigned int * ) ( 0x42482010UL ) )
    #define bFM3_MFT_PPG_TRG_PEN05               *( ( volatile unsigned int * ) ( 0x42482014UL ) )
    #define bFM3_MFT_PPG_TRG_PEN06               *( ( volatile unsigned int * ) ( 0x42482018UL ) )
    #define bFM3_MFT_PPG_TRG_PEN07               *( ( volatile unsigned int * ) ( 0x4248201CUL ) )
    #define bFM3_MFT_PPG_TRG_PEN08               *( ( volatile unsigned int * ) ( 0x42482020UL ) )
    #define bFM3_MFT_PPG_TRG_PEN09               *( ( volatile unsigned int * ) ( 0x42482024UL ) )
    #define bFM3_MFT_PPG_TRG_PEN10               *( ( volatile unsigned int * ) ( 0x42482028UL ) )
    #define bFM3_MFT_PPG_TRG_PEN11               *( ( volatile unsigned int * ) ( 0x4248202CUL ) )
    #define bFM3_MFT_PPG_TRG_PEN12               *( ( volatile unsigned int * ) ( 0x42482030UL ) )
    #define bFM3_MFT_PPG_TRG_PEN13               *( ( volatile unsigned int * ) ( 0x42482034UL ) )
    #define bFM3_MFT_PPG_TRG_PEN14               *( ( volatile unsigned int * ) ( 0x42482038UL ) )
    #define bFM3_MFT_PPG_TRG_PEN15               *( ( volatile unsigned int * ) ( 0x4248203CUL ) )
    #define bFM3_MFT_PPG_REVC_REV00              *( ( volatile unsigned int * ) ( 0x42482080UL ) )
    #define bFM3_MFT_PPG_REVC_REV01              *( ( volatile unsigned int * ) ( 0x42482084UL ) )
    #define bFM3_MFT_PPG_REVC_REV02              *( ( volatile unsigned int * ) ( 0x42482088UL ) )
    #define bFM3_MFT_PPG_REVC_REV03              *( ( volatile unsigned int * ) ( 0x4248208CUL ) )
    #define bFM3_MFT_PPG_REVC_REV04              *( ( volatile unsigned int * ) ( 0x42482090UL ) )
    #define bFM3_MFT_PPG_REVC_REV05              *( ( volatile unsigned int * ) ( 0x42482094UL ) )
    #define bFM3_MFT_PPG_REVC_REV06              *( ( volatile unsigned int * ) ( 0x42482098UL ) )
    #define bFM3_MFT_PPG_REVC_REV07              *( ( volatile unsigned int * ) ( 0x4248209CUL ) )
    #define bFM3_MFT_PPG_REVC_REV08              *( ( volatile unsigned int * ) ( 0x424820A0UL ) )
    #define bFM3_MFT_PPG_REVC_REV09              *( ( volatile unsigned int * ) ( 0x424820A4UL ) )
    #define bFM3_MFT_PPG_REVC_REV10              *( ( volatile unsigned int * ) ( 0x424820A8UL ) )
    #define bFM3_MFT_PPG_REVC_REV11              *( ( volatile unsigned int * ) ( 0x424820ACUL ) )
    #define bFM3_MFT_PPG_REVC_REV12              *( ( volatile unsigned int * ) ( 0x424820B0UL ) )
    #define bFM3_MFT_PPG_REVC_REV13              *( ( volatile unsigned int * ) ( 0x424820B4UL ) )
    #define bFM3_MFT_PPG_REVC_REV14              *( ( volatile unsigned int * ) ( 0x424820B8UL ) )
    #define bFM3_MFT_PPG_REVC_REV15              *( ( volatile unsigned int * ) ( 0x424820BCUL ) )
    #define bFM3_MFT_PPG_PPGC1_TTRG              *( ( volatile unsigned int * ) ( 0x42484000UL ) )
    #define bFM3_MFT_PPG_PPGC1_MD0               *( ( volatile unsigned int * ) ( 0x42484004UL ) )
    #define bFM3_MFT_PPG_PPGC1_MD1               *( ( volatile unsigned int * ) ( 0x42484008UL ) )
    #define bFM3_MFT_PPG_PPGC1_PCS0              *( ( volatile unsigned int * ) ( 0x4248400CUL ) )
    #define bFM3_MFT_PPG_PPGC1_PCS1              *( ( volatile unsigned int * ) ( 0x42484010UL ) )
    #define bFM3_MFT_PPG_PPGC1_INTM              *( ( volatile unsigned int * ) ( 0x42484014UL ) )
    #define bFM3_MFT_PPG_PPGC1_PUF               *( ( volatile unsigned int * ) ( 0x42484018UL ) )
    #define bFM3_MFT_PPG_PPGC1_PIE               *( ( volatile unsigned int * ) ( 0x4248401CUL ) )
    #define bFM3_MFT_PPG_PPGC0_TTRG              *( ( volatile unsigned int * ) ( 0x42484020UL ) )
    #define bFM3_MFT_PPG_PPGC0_MD0               *( ( volatile unsigned int * ) ( 0x42484024UL ) )
    #define bFM3_MFT_PPG_PPGC0_MD1               *( ( volatile unsigned int * ) ( 0x42484028UL ) )
    #define bFM3_MFT_PPG_PPGC0_PCS0              *( ( volatile unsigned int * ) ( 0x4248402CUL ) )
    #define bFM3_MFT_PPG_PPGC0_PCS1              *( ( volatile unsigned int * ) ( 0x42484030UL ) )
    #define bFM3_MFT_PPG_PPGC0_INTM              *( ( volatile unsigned int * ) ( 0x42484034UL ) )
    #define bFM3_MFT_PPG_PPGC0_PUF               *( ( volatile unsigned int * ) ( 0x42484038UL ) )
    #define bFM3_MFT_PPG_PPGC0_PIE               *( ( volatile unsigned int * ) ( 0x4248403CUL ) )
    #define bFM3_MFT_PPG_PPGC3_TTRG              *( ( volatile unsigned int * ) ( 0x42484080UL ) )
    #define bFM3_MFT_PPG_PPGC3_MD0               *( ( volatile unsigned int * ) ( 0x42484084UL ) )
    #define bFM3_MFT_PPG_PPGC3_MD1               *( ( volatile unsigned int * ) ( 0x42484088UL ) )
    #define bFM3_MFT_PPG_PPGC3_PCS0              *( ( volatile unsigned int * ) ( 0x4248408CUL ) )
    #define bFM3_MFT_PPG_PPGC3_PCS1              *( ( volatile unsigned int * ) ( 0x42484090UL ) )
    #define bFM3_MFT_PPG_PPGC3_INTM              *( ( volatile unsigned int * ) ( 0x42484094UL ) )
    #define bFM3_MFT_PPG_PPGC3_PUF               *( ( volatile unsigned int * ) ( 0x42484098UL ) )
    #define bFM3_MFT_PPG_PPGC3_PIE               *( ( volatile unsigned int * ) ( 0x4248409CUL ) )
    #define bFM3_MFT_PPG_PPGC2_TTRG              *( ( volatile unsigned int * ) ( 0x424840A0UL ) )
    #define bFM3_MFT_PPG_PPGC2_MD0               *( ( volatile unsigned int * ) ( 0x424840A4UL ) )
    #define bFM3_MFT_PPG_PPGC2_MD1               *( ( volatile unsigned int * ) ( 0x424840A8UL ) )
    #define bFM3_MFT_PPG_PPGC2_PCS0              *( ( volatile unsigned int * ) ( 0x424840ACUL ) )
    #define bFM3_MFT_PPG_PPGC2_PCS1              *( ( volatile unsigned int * ) ( 0x424840B0UL ) )
    #define bFM3_MFT_PPG_PPGC2_INTM              *( ( volatile unsigned int * ) ( 0x424840B4UL ) )
    #define bFM3_MFT_PPG_PPGC2_PUF               *( ( volatile unsigned int * ) ( 0x424840B8UL ) )
    #define bFM3_MFT_PPG_PPGC2_PIE               *( ( volatile unsigned int * ) ( 0x424840BCUL ) )
    #define bFM3_MFT_PPG_GATEC0_EDGE0            *( ( volatile unsigned int * ) ( 0x42484300UL ) )
    #define bFM3_MFT_PPG_GATEC0_STRG0            *( ( volatile unsigned int * ) ( 0x42484304UL ) )
    #define bFM3_MFT_PPG_GATEC0_EDGE2            *( ( volatile unsigned int * ) ( 0x42484310UL ) )
    #define bFM3_MFT_PPG_GATEC0_STRG2            *( ( volatile unsigned int * ) ( 0x42484314UL ) )
    #define bFM3_MFT_PPG_PPGC5_TTRG              *( ( volatile unsigned int * ) ( 0x42484800UL ) )
    #define bFM3_MFT_PPG_PPGC5_MD0               *( ( volatile unsigned int * ) ( 0x42484804UL ) )
    #define bFM3_MFT_PPG_PPGC5_MD1               *( ( volatile unsigned int * ) ( 0x42484808UL ) )
    #define bFM3_MFT_PPG_PPGC5_PCS0              *( ( volatile unsigned int * ) ( 0x4248480CUL ) )
    #define bFM3_MFT_PPG_PPGC5_PCS1              *( ( volatile unsigned int * ) ( 0x42484810UL ) )
    #define bFM3_MFT_PPG_PPGC5_INTM              *( ( volatile unsigned int * ) ( 0x42484814UL ) )
    #define bFM3_MFT_PPG_PPGC5_PUF               *( ( volatile unsigned int * ) ( 0x42484818UL ) )
    #define bFM3_MFT_PPG_PPGC5_PIE               *( ( volatile unsigned int * ) ( 0x4248481CUL ) )
    #define bFM3_MFT_PPG_PPGC4_TTRG              *( ( volatile unsigned int * ) ( 0x42484820UL ) )
    #define bFM3_MFT_PPG_PPGC4_MD0               *( ( volatile unsigned int * ) ( 0x42484824UL ) )
    #define bFM3_MFT_PPG_PPGC4_MD1               *( ( volatile unsigned int * ) ( 0x42484828UL ) )
    #define bFM3_MFT_PPG_PPGC4_PCS0              *( ( volatile unsigned int * ) ( 0x4248482CUL ) )
    #define bFM3_MFT_PPG_PPGC4_PCS1              *( ( volatile unsigned int * ) ( 0x42484830UL ) )
    #define bFM3_MFT_PPG_PPGC4_INTM              *( ( volatile unsigned int * ) ( 0x42484834UL ) )
    #define bFM3_MFT_PPG_PPGC4_PUF               *( ( volatile unsigned int * ) ( 0x42484838UL ) )
    #define bFM3_MFT_PPG_PPGC4_PIE               *( ( volatile unsigned int * ) ( 0x4248483CUL ) )
    #define bFM3_MFT_PPG_PPGC7_TTRG              *( ( volatile unsigned int * ) ( 0x42484880UL ) )
    #define bFM3_MFT_PPG_PPGC7_MD0               *( ( volatile unsigned int * ) ( 0x42484884UL ) )
    #define bFM3_MFT_PPG_PPGC7_MD1               *( ( volatile unsigned int * ) ( 0x42484888UL ) )
    #define bFM3_MFT_PPG_PPGC7_PCS0              *( ( volatile unsigned int * ) ( 0x4248488CUL ) )
    #define bFM3_MFT_PPG_PPGC7_PCS1              *( ( volatile unsigned int * ) ( 0x42484890UL ) )
    #define bFM3_MFT_PPG_PPGC7_INTM              *( ( volatile unsigned int * ) ( 0x42484894UL ) )
    #define bFM3_MFT_PPG_PPGC7_PUF               *( ( volatile unsigned int * ) ( 0x42484898UL ) )
    #define bFM3_MFT_PPG_PPGC7_PIE               *( ( volatile unsigned int * ) ( 0x4248489CUL ) )
    #define bFM3_MFT_PPG_PPGC6_TTRG              *( ( volatile unsigned int * ) ( 0x424848A0UL ) )
    #define bFM3_MFT_PPG_PPGC6_MD0               *( ( volatile unsigned int * ) ( 0x424848A4UL ) )
    #define bFM3_MFT_PPG_PPGC6_MD1               *( ( volatile unsigned int * ) ( 0x424848A8UL ) )
    #define bFM3_MFT_PPG_PPGC6_PCS0              *( ( volatile unsigned int * ) ( 0x424848ACUL ) )
    #define bFM3_MFT_PPG_PPGC6_PCS1              *( ( volatile unsigned int * ) ( 0x424848B0UL ) )
    #define bFM3_MFT_PPG_PPGC6_INTM              *( ( volatile unsigned int * ) ( 0x424848B4UL ) )
    #define bFM3_MFT_PPG_PPGC6_PUF               *( ( volatile unsigned int * ) ( 0x424848B8UL ) )
    #define bFM3_MFT_PPG_PPGC6_PIE               *( ( volatile unsigned int * ) ( 0x424848BCUL ) )
    #define bFM3_MFT_PPG_GATEC4_EDGE4            *( ( volatile unsigned int * ) ( 0x42484B00UL ) )
    #define bFM3_MFT_PPG_GATEC4_STRG4            *( ( volatile unsigned int * ) ( 0x42484B04UL ) )
    #define bFM3_MFT_PPG_GATEC4_EDGE6            *( ( volatile unsigned int * ) ( 0x42484B10UL ) )
    #define bFM3_MFT_PPG_GATEC4_STRG6            *( ( volatile unsigned int * ) ( 0x42484B14UL ) )
    #define bFM3_MFT_PPG_PPGC9_TTRG              *( ( volatile unsigned int * ) ( 0x42485000UL ) )
    #define bFM3_MFT_PPG_PPGC9_MD0               *( ( volatile unsigned int * ) ( 0x42485004UL ) )
    #define bFM3_MFT_PPG_PPGC9_MD1               *( ( volatile unsigned int * ) ( 0x42485008UL ) )
    #define bFM3_MFT_PPG_PPGC9_PCS0              *( ( volatile unsigned int * ) ( 0x4248500CUL ) )
    #define bFM3_MFT_PPG_PPGC9_PCS1              *( ( volatile unsigned int * ) ( 0x42485010UL ) )
    #define bFM3_MFT_PPG_PPGC9_INTM              *( ( volatile unsigned int * ) ( 0x42485014UL ) )
    #define bFM3_MFT_PPG_PPGC9_PUF               *( ( volatile unsigned int * ) ( 0x42485018UL ) )
    #define bFM3_MFT_PPG_PPGC9_PIE               *( ( volatile unsigned int * ) ( 0x4248501CUL ) )
    #define bFM3_MFT_PPG_PPGC8_TTRG              *( ( volatile unsigned int * ) ( 0x42485020UL ) )
    #define bFM3_MFT_PPG_PPGC8_MD0               *( ( volatile unsigned int * ) ( 0x42485024UL ) )
    #define bFM3_MFT_PPG_PPGC8_MD1               *( ( volatile unsigned int * ) ( 0x42485028UL ) )
    #define bFM3_MFT_PPG_PPGC8_PCS0              *( ( volatile unsigned int * ) ( 0x4248502CUL ) )
    #define bFM3_MFT_PPG_PPGC8_PCS1              *( ( volatile unsigned int * ) ( 0x42485030UL ) )
    #define bFM3_MFT_PPG_PPGC8_INTM              *( ( volatile unsigned int * ) ( 0x42485034UL ) )
    #define bFM3_MFT_PPG_PPGC8_PUF               *( ( volatile unsigned int * ) ( 0x42485038UL ) )
    #define bFM3_MFT_PPG_PPGC8_PIE               *( ( volatile unsigned int * ) ( 0x4248503CUL ) )
    #define bFM3_MFT_PPG_PPGC11_TTRG             *( ( volatile unsigned int * ) ( 0x42485080UL ) )
    #define bFM3_MFT_PPG_PPGC11_MD0              *( ( volatile unsigned int * ) ( 0x42485084UL ) )
    #define bFM3_MFT_PPG_PPGC11_MD1              *( ( volatile unsigned int * ) ( 0x42485088UL ) )
    #define bFM3_MFT_PPG_PPGC11_PCS0             *( ( volatile unsigned int * ) ( 0x4248508CUL ) )
    #define bFM3_MFT_PPG_PPGC11_PCS1             *( ( volatile unsigned int * ) ( 0x42485090UL ) )
    #define bFM3_MFT_PPG_PPGC11_INTM             *( ( volatile unsigned int * ) ( 0x42485094UL ) )
    #define bFM3_MFT_PPG_PPGC11_PUF              *( ( volatile unsigned int * ) ( 0x42485098UL ) )
    #define bFM3_MFT_PPG_PPGC11_PIE              *( ( volatile unsigned int * ) ( 0x4248509CUL ) )
    #define bFM3_MFT_PPG_PPGC10_TTRG             *( ( volatile unsigned int * ) ( 0x424850A0UL ) )
    #define bFM3_MFT_PPG_PPGC10_MD0              *( ( volatile unsigned int * ) ( 0x424850A4UL ) )
    #define bFM3_MFT_PPG_PPGC10_MD1              *( ( volatile unsigned int * ) ( 0x424850A8UL ) )
    #define bFM3_MFT_PPG_PPGC10_PCS0             *( ( volatile unsigned int * ) ( 0x424850ACUL ) )
    #define bFM3_MFT_PPG_PPGC10_PCS1             *( ( volatile unsigned int * ) ( 0x424850B0UL ) )
    #define bFM3_MFT_PPG_PPGC10_INTM             *( ( volatile unsigned int * ) ( 0x424850B4UL ) )
    #define bFM3_MFT_PPG_PPGC10_PUF              *( ( volatile unsigned int * ) ( 0x424850B8UL ) )
    #define bFM3_MFT_PPG_PPGC10_PIE              *( ( volatile unsigned int * ) ( 0x424850BCUL ) )
    #define bFM3_MFT_PPG_GATEC8_EDGE8            *( ( volatile unsigned int * ) ( 0x42485300UL ) )
    #define bFM3_MFT_PPG_GATEC8_STRG8            *( ( volatile unsigned int * ) ( 0x42485304UL ) )
    #define bFM3_MFT_PPG_GATEC8_EDGE10           *( ( volatile unsigned int * ) ( 0x42485310UL ) )
    #define bFM3_MFT_PPG_GATEC8_STRG10           *( ( volatile unsigned int * ) ( 0x42485314UL ) )
    #define bFM3_MFT_PPG_PPGC13_TTRG             *( ( volatile unsigned int * ) ( 0x42485800UL ) )
    #define bFM3_MFT_PPG_PPGC13_MD0              *( ( volatile unsigned int * ) ( 0x42485804UL ) )
    #define bFM3_MFT_PPG_PPGC13_MD1              *( ( volatile unsigned int * ) ( 0x42485808UL ) )
    #define bFM3_MFT_PPG_PPGC13_PCS0             *( ( volatile unsigned int * ) ( 0x4248580CUL ) )
    #define bFM3_MFT_PPG_PPGC13_PCS1             *( ( volatile unsigned int * ) ( 0x42485810UL ) )
    #define bFM3_MFT_PPG_PPGC13_INTM             *( ( volatile unsigned int * ) ( 0x42485814UL ) )
    #define bFM3_MFT_PPG_PPGC13_PUF              *( ( volatile unsigned int * ) ( 0x42485818UL ) )
    #define bFM3_MFT_PPG_PPGC13_PIE              *( ( volatile unsigned int * ) ( 0x4248581CUL ) )
    #define bFM3_MFT_PPG_PPGC12_TTRG             *( ( volatile unsigned int * ) ( 0x42485820UL ) )
    #define bFM3_MFT_PPG_PPGC12_MD0              *( ( volatile unsigned int * ) ( 0x42485824UL ) )
    #define bFM3_MFT_PPG_PPGC12_MD1              *( ( volatile unsigned int * ) ( 0x42485828UL ) )
    #define bFM3_MFT_PPG_PPGC12_PCS0             *( ( volatile unsigned int * ) ( 0x4248582CUL ) )
    #define bFM3_MFT_PPG_PPGC12_PCS1             *( ( volatile unsigned int * ) ( 0x42485830UL ) )
    #define bFM3_MFT_PPG_PPGC12_INTM             *( ( volatile unsigned int * ) ( 0x42485834UL ) )
    #define bFM3_MFT_PPG_PPGC12_PUF              *( ( volatile unsigned int * ) ( 0x42485838UL ) )
    #define bFM3_MFT_PPG_PPGC12_PIE              *( ( volatile unsigned int * ) ( 0x4248583CUL ) )
    #define bFM3_MFT_PPG_PPGC15_TTRG             *( ( volatile unsigned int * ) ( 0x42485880UL ) )
    #define bFM3_MFT_PPG_PPGC15_MD0              *( ( volatile unsigned int * ) ( 0x42485884UL ) )
    #define bFM3_MFT_PPG_PPGC15_MD1              *( ( volatile unsigned int * ) ( 0x42485888UL ) )
    #define bFM3_MFT_PPG_PPGC15_PCS0             *( ( volatile unsigned int * ) ( 0x4248588CUL ) )
    #define bFM3_MFT_PPG_PPGC15_PCS1             *( ( volatile unsigned int * ) ( 0x42485890UL ) )
    #define bFM3_MFT_PPG_PPGC15_INTM             *( ( volatile unsigned int * ) ( 0x42485894UL ) )
    #define bFM3_MFT_PPG_PPGC15_PUF              *( ( volatile unsigned int * ) ( 0x42485898UL ) )
    #define bFM3_MFT_PPG_PPGC15_PIE              *( ( volatile unsigned int * ) ( 0x4248589CUL ) )
    #define bFM3_MFT_PPG_PPGC14_TTRG             *( ( volatile unsigned int * ) ( 0x424858A0UL ) )
    #define bFM3_MFT_PPG_PPGC14_MD0              *( ( volatile unsigned int * ) ( 0x424858A4UL ) )
    #define bFM3_MFT_PPG_PPGC14_MD1              *( ( volatile unsigned int * ) ( 0x424858A8UL ) )
    #define bFM3_MFT_PPG_PPGC14_PCS0             *( ( volatile unsigned int * ) ( 0x424858ACUL ) )
    #define bFM3_MFT_PPG_PPGC14_PCS1             *( ( volatile unsigned int * ) ( 0x424858B0UL ) )
    #define bFM3_MFT_PPG_PPGC14_INTM             *( ( volatile unsigned int * ) ( 0x424858B4UL ) )
    #define bFM3_MFT_PPG_PPGC14_PUF              *( ( volatile unsigned int * ) ( 0x424858B8UL ) )
    #define bFM3_MFT_PPG_PPGC14_PIE              *( ( volatile unsigned int * ) ( 0x424858BCUL ) )
    #define bFM3_MFT_PPG_GATEC12_EDGE12          *( ( volatile unsigned int * ) ( 0x42485B00UL ) )
    #define bFM3_MFT_PPG_GATEC12_STRG12          *( ( volatile unsigned int * ) ( 0x42485B04UL ) )
    #define bFM3_MFT_PPG_GATEC12_EDGE14          *( ( volatile unsigned int * ) ( 0x42485B10UL ) )
    #define bFM3_MFT_PPG_GATEC12_STRG14          *( ( volatile unsigned int * ) ( 0x42485B14UL ) )

