FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 0 PPG registers */
    #define bFM3_BT0_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A0180UL ) )
    #define bFM3_BT0_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0184UL ) )
    #define bFM3_BT0_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0188UL ) )
    #define bFM3_BT0_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A018CUL ) )
    #define bFM3_BT0_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0190UL ) )
    #define bFM3_BT0_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0194UL ) )
    #define bFM3_BT0_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0198UL ) )
    #define bFM3_BT0_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A01A0UL ) )
    #define bFM3_BT0_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A01A4UL ) )
    #define bFM3_BT0_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A01A8UL ) )
    #define bFM3_BT0_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A01ACUL ) )
    #define bFM3_BT0_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A01B0UL ) )
    #define bFM3_BT0_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A01B4UL ) )
    #define bFM3_BT0_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A01B8UL ) )
    #define bFM3_BT0_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A0200UL ) )
    #define bFM3_BT0_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A0208UL ) )
    #define bFM3_BT0_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A0210UL ) )
    #define bFM3_BT0_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A0218UL ) )
    #define bFM3_BT0_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0220UL ) )

/* Base Timer 0 PWM registers */
    #define bFM3_BT0_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A0180UL ) )
    #define bFM3_BT0_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0184UL ) )
    #define bFM3_BT0_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0188UL ) )
    #define bFM3_BT0_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A018CUL ) )
    #define bFM3_BT0_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0190UL ) )
    #define bFM3_BT0_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0194UL ) )
    #define bFM3_BT0_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0198UL ) )
    #define bFM3_BT0_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A01A0UL ) )
    #define bFM3_BT0_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A01A4UL ) )
    #define bFM3_BT0_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A01A8UL ) )
    #define bFM3_BT0_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A01ACUL ) )
    #define bFM3_BT0_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A01B0UL ) )
    #define bFM3_BT0_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A01B4UL ) )
    #define bFM3_BT0_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A01B8UL ) )
    #define bFM3_BT0_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A0200UL ) )
    #define bFM3_BT0_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A0204UL ) )
    #define bFM3_BT0_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A0208UL ) )
    #define bFM3_BT0_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A0210UL ) )
    #define bFM3_BT0_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A0214UL ) )
    #define bFM3_BT0_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A0218UL ) )
    #define bFM3_BT0_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0220UL ) )

/* Base Timer 0 RT registers */
    #define bFM3_BT0_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A0180UL ) )
    #define bFM3_BT0_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A0184UL ) )
    #define bFM3_BT0_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A0188UL ) )
    #define bFM3_BT0_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A018CUL ) )
    #define bFM3_BT0_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A0190UL ) )
    #define bFM3_BT0_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A0194UL ) )
    #define bFM3_BT0_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A0198UL ) )
    #define bFM3_BT0_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A019CUL ) )
    #define bFM3_BT0_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A01A0UL ) )
    #define bFM3_BT0_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A01A4UL ) )
    #define bFM3_BT0_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A01B0UL ) )
    #define bFM3_BT0_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A01B4UL ) )
    #define bFM3_BT0_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A01B8UL ) )
    #define bFM3_BT0_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A0200UL ) )
    #define bFM3_BT0_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A0208UL ) )
    #define bFM3_BT0_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A0210UL ) )
    #define bFM3_BT0_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A0218UL ) )
    #define bFM3_BT0_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A0220UL ) )

/* Base Timer 0 PWC registers */
    #define bFM3_BT0_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0184UL ) )
    #define bFM3_BT0_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0188UL ) )
    #define bFM3_BT0_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0190UL ) )
    #define bFM3_BT0_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0194UL ) )
    #define bFM3_BT0_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0198UL ) )
    #define bFM3_BT0_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A019CUL ) )
    #define bFM3_BT0_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A01A0UL ) )
    #define bFM3_BT0_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A01A4UL ) )
    #define bFM3_BT0_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A01A8UL ) )
    #define bFM3_BT0_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A01B0UL ) )
    #define bFM3_BT0_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A01B4UL ) )
    #define bFM3_BT0_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A01B8UL ) )
    #define bFM3_BT0_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A0200UL ) )
    #define bFM3_BT0_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A0208UL ) )
    #define bFM3_BT0_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A0210UL ) )
    #define bFM3_BT0_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A0218UL ) )
    #define bFM3_BT0_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A021CUL ) )
    #define bFM3_BT0_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0220UL ) )

