FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 1 PPG registers */
    #define bFM3_BT1_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A0980UL ) )
    #define bFM3_BT1_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0984UL ) )
    #define bFM3_BT1_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0988UL ) )
    #define bFM3_BT1_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A098CUL ) )
    #define bFM3_BT1_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0990UL ) )
    #define bFM3_BT1_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0994UL ) )
    #define bFM3_BT1_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0998UL ) )
    #define bFM3_BT1_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A09A0UL ) )
    #define bFM3_BT1_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A09A4UL ) )
    #define bFM3_BT1_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A09A8UL ) )
    #define bFM3_BT1_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A09ACUL ) )
    #define bFM3_BT1_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A09B0UL ) )
    #define bFM3_BT1_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A09B4UL ) )
    #define bFM3_BT1_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A09B8UL ) )
    #define bFM3_BT1_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A0A00UL ) )
    #define bFM3_BT1_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A0A08UL ) )
    #define bFM3_BT1_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A0A10UL ) )
    #define bFM3_BT1_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A0A18UL ) )
    #define bFM3_BT1_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0A20UL ) )

/* Base Timer 1 PWM registers */
    #define bFM3_BT1_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A0980UL ) )
    #define bFM3_BT1_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0984UL ) )
    #define bFM3_BT1_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0988UL ) )
    #define bFM3_BT1_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A098CUL ) )
    #define bFM3_BT1_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0990UL ) )
    #define bFM3_BT1_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0994UL ) )
    #define bFM3_BT1_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0998UL ) )
    #define bFM3_BT1_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A09A0UL ) )
    #define bFM3_BT1_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A09A4UL ) )
    #define bFM3_BT1_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A09A8UL ) )
    #define bFM3_BT1_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A09ACUL ) )
    #define bFM3_BT1_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A09B0UL ) )
    #define bFM3_BT1_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A09B4UL ) )
    #define bFM3_BT1_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A09B8UL ) )
    #define bFM3_BT1_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A0A00UL ) )
    #define bFM3_BT1_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A0A04UL ) )
    #define bFM3_BT1_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A0A08UL ) )
    #define bFM3_BT1_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A0A10UL ) )
    #define bFM3_BT1_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A0A14UL ) )
    #define bFM3_BT1_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A0A18UL ) )
    #define bFM3_BT1_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0A20UL ) )

/* Base Timer 1 RT registers */
    #define bFM3_BT1_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A0980UL ) )
    #define bFM3_BT1_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A0984UL ) )
    #define bFM3_BT1_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A0988UL ) )
    #define bFM3_BT1_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A098CUL ) )
    #define bFM3_BT1_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A0990UL ) )
    #define bFM3_BT1_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A0994UL ) )
    #define bFM3_BT1_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A0998UL ) )
    #define bFM3_BT1_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A099CUL ) )
    #define bFM3_BT1_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A09A0UL ) )
    #define bFM3_BT1_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A09A4UL ) )
    #define bFM3_BT1_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A09B0UL ) )
    #define bFM3_BT1_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A09B4UL ) )
    #define bFM3_BT1_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A09B8UL ) )
    #define bFM3_BT1_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A0A00UL ) )
    #define bFM3_BT1_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A0A08UL ) )
    #define bFM3_BT1_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A0A10UL ) )
    #define bFM3_BT1_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A0A18UL ) )
    #define bFM3_BT1_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A0A20UL ) )

/* Base Timer 1 PWC registers */
    #define bFM3_BT1_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A0984UL ) )
    #define bFM3_BT1_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A0988UL ) )
    #define bFM3_BT1_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A0990UL ) )
    #define bFM3_BT1_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A0994UL ) )
    #define bFM3_BT1_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A0998UL ) )
    #define bFM3_BT1_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A099CUL ) )
    #define bFM3_BT1_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A09A0UL ) )
    #define bFM3_BT1_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A09A4UL ) )
    #define bFM3_BT1_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A09A8UL ) )
    #define bFM3_BT1_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A09B0UL ) )
    #define bFM3_BT1_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A09B4UL ) )
    #define bFM3_BT1_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A09B8UL ) )
    #define bFM3_BT1_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A0A00UL ) )
    #define bFM3_BT1_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A0A08UL ) )
    #define bFM3_BT1_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A0A10UL ) )
    #define bFM3_BT1_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A0A18UL ) )
    #define bFM3_BT1_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A0A1CUL ) )
    #define bFM3_BT1_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A0A20UL ) )

/* Base Timer 2 PPG registers */
    #define bFM3_BT2_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A1180UL ) )
    #define bFM3_BT2_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1184UL ) )
    #define bFM3_BT2_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1188UL ) )
    #define bFM3_BT2_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A118CUL ) )
    #define bFM3_BT2_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1190UL ) )
    #define bFM3_BT2_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1194UL ) )
    #define bFM3_BT2_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1198UL ) )
    #define bFM3_BT2_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A11A0UL ) )
    #define bFM3_BT2_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A11A4UL ) )
    #define bFM3_BT2_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A11A8UL ) )
    #define bFM3_BT2_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A11ACUL ) )
    #define bFM3_BT2_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A11B0UL ) )
    #define bFM3_BT2_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A11B4UL ) )
    #define bFM3_BT2_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A11B8UL ) )
    #define bFM3_BT2_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A1200UL ) )
    #define bFM3_BT2_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A1208UL ) )
    #define bFM3_BT2_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A1210UL ) )
    #define bFM3_BT2_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A1218UL ) )
    #define bFM3_BT2_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1220UL ) )

/* Base Timer 2 PWM registers */
    #define bFM3_BT2_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A1180UL ) )
    #define bFM3_BT2_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1184UL ) )
    #define bFM3_BT2_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1188UL ) )
    #define bFM3_BT2_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A118CUL ) )
    #define bFM3_BT2_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1190UL ) )
    #define bFM3_BT2_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1194UL ) )
    #define bFM3_BT2_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1198UL ) )
    #define bFM3_BT2_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A11A0UL ) )
    #define bFM3_BT2_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A11A4UL ) )
    #define bFM3_BT2_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A11A8UL ) )
    #define bFM3_BT2_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A11ACUL ) )
    #define bFM3_BT2_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A11B0UL ) )
    #define bFM3_BT2_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A11B4UL ) )
    #define bFM3_BT2_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A11B8UL ) )
    #define bFM3_BT2_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A1200UL ) )
    #define bFM3_BT2_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A1204UL ) )
    #define bFM3_BT2_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A1208UL ) )
    #define bFM3_BT2_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A1210UL ) )
    #define bFM3_BT2_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A1214UL ) )
    #define bFM3_BT2_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A1218UL ) )
    #define bFM3_BT2_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1220UL ) )

