FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 2 RT registers */
    #define bFM3_BT2_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A1180UL ) )
    #define bFM3_BT2_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A1184UL ) )
    #define bFM3_BT2_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A1188UL ) )
    #define bFM3_BT2_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A118CUL ) )
    #define bFM3_BT2_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A1190UL ) )
    #define bFM3_BT2_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A1194UL ) )
    #define bFM3_BT2_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A1198UL ) )
    #define bFM3_BT2_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A119CUL ) )
    #define bFM3_BT2_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A11A0UL ) )
    #define bFM3_BT2_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A11A4UL ) )
    #define bFM3_BT2_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A11B0UL ) )
    #define bFM3_BT2_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A11B4UL ) )
    #define bFM3_BT2_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A11B8UL ) )
    #define bFM3_BT2_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A1200UL ) )
    #define bFM3_BT2_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A1208UL ) )
    #define bFM3_BT2_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A1210UL ) )
    #define bFM3_BT2_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A1218UL ) )
    #define bFM3_BT2_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A1220UL ) )

/* Base Timer 2 PWC registers */
    #define bFM3_BT2_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1184UL ) )
    #define bFM3_BT2_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1188UL ) )
    #define bFM3_BT2_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1190UL ) )
    #define bFM3_BT2_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1194UL ) )
    #define bFM3_BT2_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1198UL ) )
    #define bFM3_BT2_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A119CUL ) )
    #define bFM3_BT2_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A11A0UL ) )
    #define bFM3_BT2_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A11A4UL ) )
    #define bFM3_BT2_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A11A8UL ) )
    #define bFM3_BT2_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A11B0UL ) )
    #define bFM3_BT2_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A11B4UL ) )
    #define bFM3_BT2_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A11B8UL ) )
    #define bFM3_BT2_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A1200UL ) )
    #define bFM3_BT2_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A1208UL ) )
    #define bFM3_BT2_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A1210UL ) )
    #define bFM3_BT2_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A1218UL ) )
    #define bFM3_BT2_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A121CUL ) )
    #define bFM3_BT2_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1220UL ) )

/* Base Timer 3 PPG registers */
    #define bFM3_BT3_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A1980UL ) )
    #define bFM3_BT3_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1984UL ) )
    #define bFM3_BT3_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1988UL ) )
    #define bFM3_BT3_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A198CUL ) )
    #define bFM3_BT3_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1990UL ) )
    #define bFM3_BT3_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1994UL ) )
    #define bFM3_BT3_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1998UL ) )
    #define bFM3_BT3_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A19A0UL ) )
    #define bFM3_BT3_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A19A4UL ) )
    #define bFM3_BT3_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A19A8UL ) )
    #define bFM3_BT3_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A19ACUL ) )
    #define bFM3_BT3_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A19B0UL ) )
    #define bFM3_BT3_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A19B4UL ) )
    #define bFM3_BT3_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A19B8UL ) )
    #define bFM3_BT3_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A1A00UL ) )
    #define bFM3_BT3_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A1A08UL ) )
    #define bFM3_BT3_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A1A10UL ) )
    #define bFM3_BT3_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A1A18UL ) )
    #define bFM3_BT3_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1A20UL ) )

/* Base Timer 3 PWM registers */
    #define bFM3_BT3_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A1980UL ) )
    #define bFM3_BT3_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1984UL ) )
    #define bFM3_BT3_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1988UL ) )
    #define bFM3_BT3_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A198CUL ) )
    #define bFM3_BT3_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1990UL ) )
    #define bFM3_BT3_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1994UL ) )
    #define bFM3_BT3_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1998UL ) )
    #define bFM3_BT3_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A19A0UL ) )
    #define bFM3_BT3_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A19A4UL ) )
    #define bFM3_BT3_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A19A8UL ) )
    #define bFM3_BT3_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A19ACUL ) )
    #define bFM3_BT3_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A19B0UL ) )
    #define bFM3_BT3_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A19B4UL ) )
    #define bFM3_BT3_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A19B8UL ) )
    #define bFM3_BT3_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A1A00UL ) )
    #define bFM3_BT3_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A1A04UL ) )
    #define bFM3_BT3_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A1A08UL ) )
    #define bFM3_BT3_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A1A10UL ) )
    #define bFM3_BT3_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A1A14UL ) )
    #define bFM3_BT3_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A1A18UL ) )
    #define bFM3_BT3_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1A20UL ) )

/* Base Timer 3 RT registers */
    #define bFM3_BT3_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A1980UL ) )
    #define bFM3_BT3_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A1984UL ) )
    #define bFM3_BT3_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A1988UL ) )
    #define bFM3_BT3_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A198CUL ) )
    #define bFM3_BT3_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A1990UL ) )
    #define bFM3_BT3_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A1994UL ) )
    #define bFM3_BT3_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A1998UL ) )
    #define bFM3_BT3_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A199CUL ) )
    #define bFM3_BT3_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A19A0UL ) )
    #define bFM3_BT3_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A19A4UL ) )
    #define bFM3_BT3_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A19B0UL ) )
    #define bFM3_BT3_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A19B4UL ) )
    #define bFM3_BT3_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A19B8UL ) )
    #define bFM3_BT3_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A1A00UL ) )
    #define bFM3_BT3_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A1A08UL ) )
    #define bFM3_BT3_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A1A10UL ) )
    #define bFM3_BT3_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A1A18UL ) )
    #define bFM3_BT3_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A1A20UL ) )

/* Base Timer 3 PWC registers */
    #define bFM3_BT3_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A1984UL ) )
    #define bFM3_BT3_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A1988UL ) )
    #define bFM3_BT3_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A1990UL ) )
    #define bFM3_BT3_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A1994UL ) )
    #define bFM3_BT3_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A1998UL ) )
    #define bFM3_BT3_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A199CUL ) )
    #define bFM3_BT3_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A19A0UL ) )
    #define bFM3_BT3_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A19A4UL ) )
    #define bFM3_BT3_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A19A8UL ) )
    #define bFM3_BT3_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A19B0UL ) )
    #define bFM3_BT3_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A19B4UL ) )
    #define bFM3_BT3_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A19B8UL ) )
    #define bFM3_BT3_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A1A00UL ) )
    #define bFM3_BT3_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A1A08UL ) )
    #define bFM3_BT3_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A1A10UL ) )
    #define bFM3_BT3_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A1A18UL ) )
    #define bFM3_BT3_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A1A1CUL ) )
    #define bFM3_BT3_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A1A20UL ) )

/* Base Timer 4 PPG registers */
    #define bFM3_BT4_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A4180UL ) )
    #define bFM3_BT4_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4184UL ) )
    #define bFM3_BT4_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4188UL ) )
    #define bFM3_BT4_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A418CUL ) )
    #define bFM3_BT4_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4190UL ) )
    #define bFM3_BT4_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4194UL ) )
    #define bFM3_BT4_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4198UL ) )
    #define bFM3_BT4_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A41A0UL ) )
    #define bFM3_BT4_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A41A4UL ) )
    #define bFM3_BT4_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A41A8UL ) )
    #define bFM3_BT4_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A41ACUL ) )
    #define bFM3_BT4_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A41B0UL ) )
    #define bFM3_BT4_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A41B4UL ) )
    #define bFM3_BT4_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A41B8UL ) )
    #define bFM3_BT4_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A4200UL ) )
    #define bFM3_BT4_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A4208UL ) )
    #define bFM3_BT4_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A4210UL ) )
    #define bFM3_BT4_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A4218UL ) )
    #define bFM3_BT4_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4220UL ) )

/* Base Timer 4 PWM registers */
    #define bFM3_BT4_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A4180UL ) )
    #define bFM3_BT4_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4184UL ) )
    #define bFM3_BT4_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4188UL ) )
    #define bFM3_BT4_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A418CUL ) )
    #define bFM3_BT4_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4190UL ) )
    #define bFM3_BT4_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4194UL ) )
    #define bFM3_BT4_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4198UL ) )
    #define bFM3_BT4_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A41A0UL ) )
    #define bFM3_BT4_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A41A4UL ) )
    #define bFM3_BT4_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A41A8UL ) )
    #define bFM3_BT4_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A41ACUL ) )
    #define bFM3_BT4_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A41B0UL ) )
    #define bFM3_BT4_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A41B4UL ) )
    #define bFM3_BT4_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A41B8UL ) )
    #define bFM3_BT4_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A4200UL ) )
    #define bFM3_BT4_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A4204UL ) )
    #define bFM3_BT4_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A4208UL ) )
    #define bFM3_BT4_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A4210UL ) )
    #define bFM3_BT4_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A4214UL ) )
    #define bFM3_BT4_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A4218UL ) )
    #define bFM3_BT4_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4220UL ) )

