FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 4 RT registers */
    #define bFM3_BT4_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A4180UL ) )
    #define bFM3_BT4_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A4184UL ) )
    #define bFM3_BT4_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A4188UL ) )
    #define bFM3_BT4_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A418CUL ) )
    #define bFM3_BT4_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A4190UL ) )
    #define bFM3_BT4_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A4194UL ) )
    #define bFM3_BT4_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A4198UL ) )
    #define bFM3_BT4_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A419CUL ) )
    #define bFM3_BT4_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A41A0UL ) )
    #define bFM3_BT4_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A41A4UL ) )
    #define bFM3_BT4_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A41B0UL ) )
    #define bFM3_BT4_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A41B4UL ) )
    #define bFM3_BT4_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A41B8UL ) )
    #define bFM3_BT4_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A4200UL ) )
    #define bFM3_BT4_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A4208UL ) )
    #define bFM3_BT4_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A4210UL ) )
    #define bFM3_BT4_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A4218UL ) )
    #define bFM3_BT4_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A4220UL ) )

/* Base Timer 4 PWC registers */
    #define bFM3_BT4_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4184UL ) )
    #define bFM3_BT4_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4188UL ) )
    #define bFM3_BT4_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4190UL ) )
    #define bFM3_BT4_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4194UL ) )
    #define bFM3_BT4_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4198UL ) )
    #define bFM3_BT4_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A419CUL ) )
    #define bFM3_BT4_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A41A0UL ) )
    #define bFM3_BT4_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A41A4UL ) )
    #define bFM3_BT4_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A41A8UL ) )
    #define bFM3_BT4_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A41B0UL ) )
    #define bFM3_BT4_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A41B4UL ) )
    #define bFM3_BT4_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A41B8UL ) )
    #define bFM3_BT4_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A4200UL ) )
    #define bFM3_BT4_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A4208UL ) )
    #define bFM3_BT4_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A4210UL ) )
    #define bFM3_BT4_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A4218UL ) )
    #define bFM3_BT4_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A421CUL ) )
    #define bFM3_BT4_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4220UL ) )

/* Base Timer 5 PPG registers */
    #define bFM3_BT5_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A4980UL ) )
    #define bFM3_BT5_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4984UL ) )
    #define bFM3_BT5_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4988UL ) )
    #define bFM3_BT5_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A498CUL ) )
    #define bFM3_BT5_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4990UL ) )
    #define bFM3_BT5_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4994UL ) )
    #define bFM3_BT5_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4998UL ) )
    #define bFM3_BT5_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A49A0UL ) )
    #define bFM3_BT5_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A49A4UL ) )
    #define bFM3_BT5_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A49A8UL ) )
    #define bFM3_BT5_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A49ACUL ) )
    #define bFM3_BT5_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A49B0UL ) )
    #define bFM3_BT5_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A49B4UL ) )
    #define bFM3_BT5_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A49B8UL ) )
    #define bFM3_BT5_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A4A00UL ) )
    #define bFM3_BT5_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A4A08UL ) )
    #define bFM3_BT5_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A4A10UL ) )
    #define bFM3_BT5_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A4A18UL ) )
    #define bFM3_BT5_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4A20UL ) )

/* Base Timer 5 PWM registers */
    #define bFM3_BT5_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A4980UL ) )
    #define bFM3_BT5_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4984UL ) )
    #define bFM3_BT5_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4988UL ) )
    #define bFM3_BT5_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A498CUL ) )
    #define bFM3_BT5_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4990UL ) )
    #define bFM3_BT5_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4994UL ) )
    #define bFM3_BT5_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4998UL ) )
    #define bFM3_BT5_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A49A0UL ) )
    #define bFM3_BT5_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A49A4UL ) )
    #define bFM3_BT5_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A49A8UL ) )
    #define bFM3_BT5_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A49ACUL ) )
    #define bFM3_BT5_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A49B0UL ) )
    #define bFM3_BT5_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A49B4UL ) )
    #define bFM3_BT5_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A49B8UL ) )
    #define bFM3_BT5_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A4A00UL ) )
    #define bFM3_BT5_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A4A04UL ) )
    #define bFM3_BT5_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A4A08UL ) )
    #define bFM3_BT5_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A4A10UL ) )
    #define bFM3_BT5_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A4A14UL ) )
    #define bFM3_BT5_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A4A18UL ) )
    #define bFM3_BT5_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4A20UL ) )

/* Base Timer 5 RT registers */
    #define bFM3_BT5_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A4980UL ) )
    #define bFM3_BT5_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A4984UL ) )
    #define bFM3_BT5_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A4988UL ) )
    #define bFM3_BT5_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A498CUL ) )
    #define bFM3_BT5_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A4990UL ) )
    #define bFM3_BT5_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A4994UL ) )
    #define bFM3_BT5_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A4998UL ) )
    #define bFM3_BT5_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A499CUL ) )
    #define bFM3_BT5_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A49A0UL ) )
    #define bFM3_BT5_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A49A4UL ) )
    #define bFM3_BT5_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A49B0UL ) )
    #define bFM3_BT5_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A49B4UL ) )
    #define bFM3_BT5_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A49B8UL ) )
    #define bFM3_BT5_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A4A00UL ) )
    #define bFM3_BT5_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A4A08UL ) )
    #define bFM3_BT5_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A4A10UL ) )
    #define bFM3_BT5_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A4A18UL ) )
    #define bFM3_BT5_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A4A20UL ) )

/* Base Timer 5 PWC registers */
    #define bFM3_BT5_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A4984UL ) )
    #define bFM3_BT5_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A4988UL ) )
    #define bFM3_BT5_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A4990UL ) )
    #define bFM3_BT5_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A4994UL ) )
    #define bFM3_BT5_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A4998UL ) )
    #define bFM3_BT5_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A499CUL ) )
    #define bFM3_BT5_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A49A0UL ) )
    #define bFM3_BT5_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A49A4UL ) )
    #define bFM3_BT5_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A49A8UL ) )
    #define bFM3_BT5_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A49B0UL ) )
    #define bFM3_BT5_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A49B4UL ) )
    #define bFM3_BT5_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A49B8UL ) )
    #define bFM3_BT5_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A4A00UL ) )
    #define bFM3_BT5_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A4A08UL ) )
    #define bFM3_BT5_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A4A10UL ) )
    #define bFM3_BT5_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A4A18UL ) )
    #define bFM3_BT5_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A4A1CUL ) )
    #define bFM3_BT5_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A4A20UL ) )

