FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 6 PPG registers */
    #define bFM3_BT6_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A5180UL ) )
    #define bFM3_BT6_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5184UL ) )
    #define bFM3_BT6_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5188UL ) )
    #define bFM3_BT6_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A518CUL ) )
    #define bFM3_BT6_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5190UL ) )
    #define bFM3_BT6_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5194UL ) )
    #define bFM3_BT6_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5198UL ) )
    #define bFM3_BT6_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A51A0UL ) )
    #define bFM3_BT6_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A51A4UL ) )
    #define bFM3_BT6_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A51A8UL ) )
    #define bFM3_BT6_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A51ACUL ) )
    #define bFM3_BT6_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A51B0UL ) )
    #define bFM3_BT6_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A51B4UL ) )
    #define bFM3_BT6_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A51B8UL ) )
    #define bFM3_BT6_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A5200UL ) )
    #define bFM3_BT6_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A5208UL ) )
    #define bFM3_BT6_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A5210UL ) )
    #define bFM3_BT6_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A5218UL ) )
    #define bFM3_BT6_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5220UL ) )

/* Base Timer 6 PWM registers */
    #define bFM3_BT6_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A5180UL ) )
    #define bFM3_BT6_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5184UL ) )
    #define bFM3_BT6_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5188UL ) )
    #define bFM3_BT6_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A518CUL ) )
    #define bFM3_BT6_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5190UL ) )
    #define bFM3_BT6_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5194UL ) )
    #define bFM3_BT6_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5198UL ) )
    #define bFM3_BT6_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A51A0UL ) )
    #define bFM3_BT6_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A51A4UL ) )
    #define bFM3_BT6_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A51A8UL ) )
    #define bFM3_BT6_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A51ACUL ) )
    #define bFM3_BT6_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A51B0UL ) )
    #define bFM3_BT6_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A51B4UL ) )
    #define bFM3_BT6_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A51B8UL ) )
    #define bFM3_BT6_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A5200UL ) )
    #define bFM3_BT6_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A5204UL ) )
    #define bFM3_BT6_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A5208UL ) )
    #define bFM3_BT6_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A5210UL ) )
    #define bFM3_BT6_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A5214UL ) )
    #define bFM3_BT6_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A5218UL ) )
    #define bFM3_BT6_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5220UL ) )

/* Base Timer 6 RT registers */
    #define bFM3_BT6_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A5180UL ) )
    #define bFM3_BT6_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A5184UL ) )
    #define bFM3_BT6_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A5188UL ) )
    #define bFM3_BT6_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A518CUL ) )
    #define bFM3_BT6_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A5190UL ) )
    #define bFM3_BT6_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A5194UL ) )
    #define bFM3_BT6_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A5198UL ) )
    #define bFM3_BT6_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A519CUL ) )
    #define bFM3_BT6_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A51A0UL ) )
    #define bFM3_BT6_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A51A4UL ) )
    #define bFM3_BT6_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A51B0UL ) )
    #define bFM3_BT6_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A51B4UL ) )
    #define bFM3_BT6_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A51B8UL ) )
    #define bFM3_BT6_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A5200UL ) )
    #define bFM3_BT6_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A5208UL ) )
    #define bFM3_BT6_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A5210UL ) )
    #define bFM3_BT6_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A5218UL ) )
    #define bFM3_BT6_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A5220UL ) )

/* Base Timer 6 PWC registers */
    #define bFM3_BT6_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5184UL ) )
    #define bFM3_BT6_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5188UL ) )
    #define bFM3_BT6_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5190UL ) )
    #define bFM3_BT6_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5194UL ) )
    #define bFM3_BT6_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5198UL ) )
    #define bFM3_BT6_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A519CUL ) )
    #define bFM3_BT6_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A51A0UL ) )
    #define bFM3_BT6_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A51A4UL ) )
    #define bFM3_BT6_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A51A8UL ) )
    #define bFM3_BT6_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A51B0UL ) )
    #define bFM3_BT6_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A51B4UL ) )
    #define bFM3_BT6_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A51B8UL ) )
    #define bFM3_BT6_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A5200UL ) )
    #define bFM3_BT6_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A5208UL ) )
    #define bFM3_BT6_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A5210UL ) )
    #define bFM3_BT6_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A5218UL ) )
    #define bFM3_BT6_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A521CUL ) )
    #define bFM3_BT6_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5220UL ) )

/* Base Timer 7 PPG registers */
    #define bFM3_BT7_PPG_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A5980UL ) )
    #define bFM3_BT7_PPG_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5984UL ) )
    #define bFM3_BT7_PPG_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5988UL ) )
    #define bFM3_BT7_PPG_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A598CUL ) )
    #define bFM3_BT7_PPG_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5990UL ) )
    #define bFM3_BT7_PPG_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5994UL ) )
    #define bFM3_BT7_PPG_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5998UL ) )
    #define bFM3_BT7_PPG_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A59A0UL ) )
    #define bFM3_BT7_PPG_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A59A4UL ) )
    #define bFM3_BT7_PPG_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A59A8UL ) )
    #define bFM3_BT7_PPG_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A59ACUL ) )
    #define bFM3_BT7_PPG_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A59B0UL ) )
    #define bFM3_BT7_PPG_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A59B4UL ) )
    #define bFM3_BT7_PPG_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A59B8UL ) )
    #define bFM3_BT7_PPG_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A5A00UL ) )
    #define bFM3_BT7_PPG_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A5A08UL ) )
    #define bFM3_BT7_PPG_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A5A10UL ) )
    #define bFM3_BT7_PPG_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A5A18UL ) )
    #define bFM3_BT7_PPG_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5A20UL ) )

