FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Base Timer 7 PWM registers */
    #define bFM3_BT7_PWM_TMCR_STRG               *( ( volatile unsigned int * ) ( 0x424A5980UL ) )
    #define bFM3_BT7_PWM_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5984UL ) )
    #define bFM3_BT7_PWM_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5988UL ) )
    #define bFM3_BT7_PWM_TMCR_OSEL               *( ( volatile unsigned int * ) ( 0x424A598CUL ) )
    #define bFM3_BT7_PWM_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5990UL ) )
    #define bFM3_BT7_PWM_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5994UL ) )
    #define bFM3_BT7_PWM_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5998UL ) )
    #define bFM3_BT7_PWM_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A59A0UL ) )
    #define bFM3_BT7_PWM_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A59A4UL ) )
    #define bFM3_BT7_PWM_TMCR_PMSK               *( ( volatile unsigned int * ) ( 0x424A59A8UL ) )
    #define bFM3_BT7_PWM_TMCR_RTGEN              *( ( volatile unsigned int * ) ( 0x424A59ACUL ) )
    #define bFM3_BT7_PWM_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A59B0UL ) )
    #define bFM3_BT7_PWM_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A59B4UL ) )
    #define bFM3_BT7_PWM_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A59B8UL ) )
    #define bFM3_BT7_PWM_STC_UDIR                *( ( volatile unsigned int * ) ( 0x424A5A00UL ) )
    #define bFM3_BT7_PWM_STC_DTIR                *( ( volatile unsigned int * ) ( 0x424A5A04UL ) )
    #define bFM3_BT7_PWM_STC_TGIR                *( ( volatile unsigned int * ) ( 0x424A5A08UL ) )
    #define bFM3_BT7_PWM_STC_UDIE                *( ( volatile unsigned int * ) ( 0x424A5A10UL ) )
    #define bFM3_BT7_PWM_STC_DTIE                *( ( volatile unsigned int * ) ( 0x424A5A14UL ) )
    #define bFM3_BT7_PWM_STC_TGIE                *( ( volatile unsigned int * ) ( 0x424A5A18UL ) )
    #define bFM3_BT7_PWM_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5A20UL ) )

/* Base Timer 7 RT registers */
    #define bFM3_BT7_RT_TMCR_STRG                *( ( volatile unsigned int * ) ( 0x424A5980UL ) )
    #define bFM3_BT7_RT_TMCR_CTEN                *( ( volatile unsigned int * ) ( 0x424A5984UL ) )
    #define bFM3_BT7_RT_TMCR_MDSE                *( ( volatile unsigned int * ) ( 0x424A5988UL ) )
    #define bFM3_BT7_RT_TMCR_OSEL                *( ( volatile unsigned int * ) ( 0x424A598CUL ) )
    #define bFM3_BT7_RT_TMCR_FMD0                *( ( volatile unsigned int * ) ( 0x424A5990UL ) )
    #define bFM3_BT7_RT_TMCR_FMD1                *( ( volatile unsigned int * ) ( 0x424A5994UL ) )
    #define bFM3_BT7_RT_TMCR_FMD2                *( ( volatile unsigned int * ) ( 0x424A5998UL ) )
    #define bFM3_BT7_RT_TMCR_T32                 *( ( volatile unsigned int * ) ( 0x424A599CUL ) )
    #define bFM3_BT7_RT_TMCR_EGS0                *( ( volatile unsigned int * ) ( 0x424A59A0UL ) )
    #define bFM3_BT7_RT_TMCR_EGS1                *( ( volatile unsigned int * ) ( 0x424A59A4UL ) )
    #define bFM3_BT7_RT_TMCR_CKS0                *( ( volatile unsigned int * ) ( 0x424A59B0UL ) )
    #define bFM3_BT7_RT_TMCR_CKS1                *( ( volatile unsigned int * ) ( 0x424A59B4UL ) )
    #define bFM3_BT7_RT_TMCR_CKS2                *( ( volatile unsigned int * ) ( 0x424A59B8UL ) )
    #define bFM3_BT7_RT_STC_UDIR                 *( ( volatile unsigned int * ) ( 0x424A5A00UL ) )
    #define bFM3_BT7_RT_STC_TGIR                 *( ( volatile unsigned int * ) ( 0x424A5A08UL ) )
    #define bFM3_BT7_RT_STC_UDIE                 *( ( volatile unsigned int * ) ( 0x424A5A10UL ) )
    #define bFM3_BT7_RT_STC_TGIE                 *( ( volatile unsigned int * ) ( 0x424A5A18UL ) )
    #define bFM3_BT7_RT_TMCR2_CKS3               *( ( volatile unsigned int * ) ( 0x424A5A20UL ) )

/* Base Timer 7 PWC registers */
    #define bFM3_BT7_PWC_TMCR_CTEN               *( ( volatile unsigned int * ) ( 0x424A5984UL ) )
    #define bFM3_BT7_PWC_TMCR_MDSE               *( ( volatile unsigned int * ) ( 0x424A5988UL ) )
    #define bFM3_BT7_PWC_TMCR_FMD0               *( ( volatile unsigned int * ) ( 0x424A5990UL ) )
    #define bFM3_BT7_PWC_TMCR_FMD1               *( ( volatile unsigned int * ) ( 0x424A5994UL ) )
    #define bFM3_BT7_PWC_TMCR_FMD2               *( ( volatile unsigned int * ) ( 0x424A5998UL ) )
    #define bFM3_BT7_PWC_TMCR_T32                *( ( volatile unsigned int * ) ( 0x424A599CUL ) )
    #define bFM3_BT7_PWC_TMCR_EGS0               *( ( volatile unsigned int * ) ( 0x424A59A0UL ) )
    #define bFM3_BT7_PWC_TMCR_EGS1               *( ( volatile unsigned int * ) ( 0x424A59A4UL ) )
    #define bFM3_BT7_PWC_TMCR_EGS2               *( ( volatile unsigned int * ) ( 0x424A59A8UL ) )
    #define bFM3_BT7_PWC_TMCR_CKS0               *( ( volatile unsigned int * ) ( 0x424A59B0UL ) )
    #define bFM3_BT7_PWC_TMCR_CKS1               *( ( volatile unsigned int * ) ( 0x424A59B4UL ) )
    #define bFM3_BT7_PWC_TMCR_CKS2               *( ( volatile unsigned int * ) ( 0x424A59B8UL ) )
    #define bFM3_BT7_PWC_STC_OVIR                *( ( volatile unsigned int * ) ( 0x424A5A00UL ) )
    #define bFM3_BT7_PWC_STC_EDIR                *( ( volatile unsigned int * ) ( 0x424A5A08UL ) )
    #define bFM3_BT7_PWC_STC_OVIE                *( ( volatile unsigned int * ) ( 0x424A5A10UL ) )
    #define bFM3_BT7_PWC_STC_EDIE                *( ( volatile unsigned int * ) ( 0x424A5A18UL ) )
    #define bFM3_BT7_PWC_STC_ERR                 *( ( volatile unsigned int * ) ( 0x424A5A1CUL ) )
    #define bFM3_BT7_PWC_TMCR2_CKS3              *( ( volatile unsigned int * ) ( 0x424A5A20UL ) )

/* Base Timer I/O selector channel 0 - channel 3 registers */
    #define bFM3_BTIOSEL03_BTSEL0123_SEL01_0     *( ( volatile unsigned int * ) ( 0x424A2020UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL01_1     *( ( volatile unsigned int * ) ( 0x424A2024UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL01_2     *( ( volatile unsigned int * ) ( 0x424A2028UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL01_3     *( ( volatile unsigned int * ) ( 0x424A202CUL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL23_0     *( ( volatile unsigned int * ) ( 0x424A2030UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL23_1     *( ( volatile unsigned int * ) ( 0x424A2034UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL23_2     *( ( volatile unsigned int * ) ( 0x424A2038UL ) )
    #define bFM3_BTIOSEL03_BTSEL0123_SEL23_3     *( ( volatile unsigned int * ) ( 0x424A203CUL ) )

/* Base Timer I/O selector channel 4 - channel 7 registers */
    #define bFM3_BTIOSEL47_BTSEL4567_SEL45_0     *( ( volatile unsigned int * ) ( 0x424A6020UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL45_1     *( ( volatile unsigned int * ) ( 0x424A6024UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL45_2     *( ( volatile unsigned int * ) ( 0x424A6028UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL45_3     *( ( volatile unsigned int * ) ( 0x424A602CUL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL67_0     *( ( volatile unsigned int * ) ( 0x424A6030UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL67_1     *( ( volatile unsigned int * ) ( 0x424A6034UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL67_2     *( ( volatile unsigned int * ) ( 0x424A6038UL ) )
    #define bFM3_BTIOSEL47_BTSEL4567_SEL67_3     *( ( volatile unsigned int * ) ( 0x424A603CUL ) )

/* Software based Simulation Startup (Base Timer) register */
    #define bFM3_SBSSR_BTSSSR_SSR0               *( ( volatile unsigned int * ) ( 0x424BFF80UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR1               *( ( volatile unsigned int * ) ( 0x424BFF84UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR2               *( ( volatile unsigned int * ) ( 0x424BFF88UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR3               *( ( volatile unsigned int * ) ( 0x424BFF8CUL ) )
    #define bFM3_SBSSR_BTSSSR_SSR4               *( ( volatile unsigned int * ) ( 0x424BFF90UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR5               *( ( volatile unsigned int * ) ( 0x424BFF94UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR6               *( ( volatile unsigned int * ) ( 0x424BFF98UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR7               *( ( volatile unsigned int * ) ( 0x424BFF9CUL ) )
    #define bFM3_SBSSR_BTSSSR_SSR8               *( ( volatile unsigned int * ) ( 0x424BFFA0UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR9               *( ( volatile unsigned int * ) ( 0x424BFFA4UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR10              *( ( volatile unsigned int * ) ( 0x424BFFA8UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR11              *( ( volatile unsigned int * ) ( 0x424BFFACUL ) )
    #define bFM3_SBSSR_BTSSSR_SSR12              *( ( volatile unsigned int * ) ( 0x424BFFB0UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR13              *( ( volatile unsigned int * ) ( 0x424BFFB4UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR14              *( ( volatile unsigned int * ) ( 0x424BFFB8UL ) )
    #define bFM3_SBSSR_BTSSSR_SSR15              *( ( volatile unsigned int * ) ( 0x424BFFBCUL ) )

/* Quad position and revolution counter channel 0 registers */
    #define bFM3_QPRC0_QICR_QPCMIE               *( ( volatile unsigned int * ) ( 0x424C0280UL ) )
    #define bFM3_QPRC0_QICR_QPCMF                *( ( volatile unsigned int * ) ( 0x424C0284UL ) )
    #define bFM3_QPRC0_QICR_QPRCMIE              *( ( volatile unsigned int * ) ( 0x424C0288UL ) )
    #define bFM3_QPRC0_QICR_QPRCMF               *( ( volatile unsigned int * ) ( 0x424C028CUL ) )
    #define bFM3_QPRC0_QICR_OUZIE                *( ( volatile unsigned int * ) ( 0x424C0290UL ) )
    #define bFM3_QPRC0_QICR_UFDF                 *( ( volatile unsigned int * ) ( 0x424C0294UL ) )
    #define bFM3_QPRC0_QICR_OFDF                 *( ( volatile unsigned int * ) ( 0x424C0298UL ) )
    #define bFM3_QPRC0_QICR_ZIIF                 *( ( volatile unsigned int * ) ( 0x424C029CUL ) )
    #define bFM3_QPRC0_QICR_CDCIE                *( ( volatile unsigned int * ) ( 0x424C02A0UL ) )
    #define bFM3_QPRC0_QICR_CDCF                 *( ( volatile unsigned int * ) ( 0x424C02A4UL ) )
    #define bFM3_QPRC0_QICR_DIRPC                *( ( volatile unsigned int * ) ( 0x424C02A8UL ) )
    #define bFM3_QPRC0_QICR_DIROU                *( ( volatile unsigned int * ) ( 0x424C02ACUL ) )
    #define bFM3_QPRC0_QICR_QPCNRCMIE            *( ( volatile unsigned int * ) ( 0x424C02B0UL ) )
    #define bFM3_QPRC0_QICR_QPCNRCMF             *( ( volatile unsigned int * ) ( 0x424C02B4UL ) )
    #define bFM3_QPRC0_QICRL_QPCMIE              *( ( volatile unsigned int * ) ( 0x424C0280UL ) )
    #define bFM3_QPRC0_QICRL_QPCMF               *( ( volatile unsigned int * ) ( 0x424C0284UL ) )
    #define bFM3_QPRC0_QICRL_QPRCMIE             *( ( volatile unsigned int * ) ( 0x424C0288UL ) )
    #define bFM3_QPRC0_QICRL_QPRCMF              *( ( volatile unsigned int * ) ( 0x424C028CUL ) )
    #define bFM3_QPRC0_QICRL_OUZIE               *( ( volatile unsigned int * ) ( 0x424C0290UL ) )
    #define bFM3_QPRC0_QICRL_UFDF                *( ( volatile unsigned int * ) ( 0x424C0294UL ) )
    #define bFM3_QPRC0_QICRL_OFDF                *( ( volatile unsigned int * ) ( 0x424C0298UL ) )
    #define bFM3_QPRC0_QICRL_ZIIF                *( ( volatile unsigned int * ) ( 0x424C029CUL ) )
    #define bFM3_QPRC0_QICRH_CDCIE               *( ( volatile unsigned int * ) ( 0x424C02A0UL ) )
    #define bFM3_QPRC0_QICRH_CDCF                *( ( volatile unsigned int * ) ( 0x424C02A4UL ) )
    #define bFM3_QPRC0_QICRH_DIRPC               *( ( volatile unsigned int * ) ( 0x424C02A8UL ) )
    #define bFM3_QPRC0_QICRH_DIROU               *( ( volatile unsigned int * ) ( 0x424C02ACUL ) )
    #define bFM3_QPRC0_QICRH_QPCNRCMIE           *( ( volatile unsigned int * ) ( 0x424C02B0UL ) )
    #define bFM3_QPRC0_QICRH_QPCNRCMF            *( ( volatile unsigned int * ) ( 0x424C02B4UL ) )
    #define bFM3_QPRC0_QCR_PCM0                  *( ( volatile unsigned int * ) ( 0x424C0300UL ) )
    #define bFM3_QPRC0_QCR_PCM1                  *( ( volatile unsigned int * ) ( 0x424C0304UL ) )
    #define bFM3_QPRC0_QCR_RCM0                  *( ( volatile unsigned int * ) ( 0x424C0308UL ) )
    #define bFM3_QPRC0_QCR_RCM1                  *( ( volatile unsigned int * ) ( 0x424C030CUL ) )
    #define bFM3_QPRC0_QCR_PSTP                  *( ( volatile unsigned int * ) ( 0x424C0310UL ) )
    #define bFM3_QPRC0_QCR_CGSC                  *( ( volatile unsigned int * ) ( 0x424C0314UL ) )
    #define bFM3_QPRC0_QCR_RSEL                  *( ( volatile unsigned int * ) ( 0x424C0318UL ) )
    #define bFM3_QPRC0_QCR_SWAP                  *( ( volatile unsigned int * ) ( 0x424C031CUL ) )
    #define bFM3_QPRC0_QCR_PCRM0                 *( ( volatile unsigned int * ) ( 0x424C0320UL ) )
    #define bFM3_QPRC0_QCR_PCRM1                 *( ( volatile unsigned int * ) ( 0x424C0324UL ) )
    #define bFM3_QPRC0_QCR_AES0                  *( ( volatile unsigned int * ) ( 0x424C0328UL ) )
    #define bFM3_QPRC0_QCR_AES1                  *( ( volatile unsigned int * ) ( 0x424C032CUL ) )
    #define bFM3_QPRC0_QCR_BES0                  *( ( volatile unsigned int * ) ( 0x424C0330UL ) )
    #define bFM3_QPRC0_QCR_BES1                  *( ( volatile unsigned int * ) ( 0x424C0334UL ) )
    #define bFM3_QPRC0_QCR_CGE0                  *( ( volatile unsigned int * ) ( 0x424C0338UL ) )
    #define bFM3_QPRC0_QCR_CGE1                  *( ( volatile unsigned int * ) ( 0x424C033CUL ) )
    #define bFM3_QPRC0_QCRL_PCM0                 *( ( volatile unsigned int * ) ( 0x424C0300UL ) )
    #define bFM3_QPRC0_QCRL_PCM1                 *( ( volatile unsigned int * ) ( 0x424C0304UL ) )
    #define bFM3_QPRC0_QCRL_RCM0                 *( ( volatile unsigned int * ) ( 0x424C0308UL ) )
    #define bFM3_QPRC0_QCRL_RCM1                 *( ( volatile unsigned int * ) ( 0x424C030CUL ) )
    #define bFM3_QPRC0_QCRL_PSTP                 *( ( volatile unsigned int * ) ( 0x424C0310UL ) )
    #define bFM3_QPRC0_QCRL_CGSC                 *( ( volatile unsigned int * ) ( 0x424C0314UL ) )
    #define bFM3_QPRC0_QCRL_RSEL                 *( ( volatile unsigned int * ) ( 0x424C0318UL ) )
    #define bFM3_QPRC0_QCRL_SWAP                 *( ( volatile unsigned int * ) ( 0x424C031CUL ) )
    #define bFM3_QPRC0_QCRH_PCRM0                *( ( volatile unsigned int * ) ( 0x424C0320UL ) )
    #define bFM3_QPRC0_QCRH_PCRM1                *( ( volatile unsigned int * ) ( 0x424C0324UL ) )
    #define bFM3_QPRC0_QCRH_AES0                 *( ( volatile unsigned int * ) ( 0x424C0328UL ) )
    #define bFM3_QPRC0_QCRH_AES1                 *( ( volatile unsigned int * ) ( 0x424C032CUL ) )
    #define bFM3_QPRC0_QCRH_BES0                 *( ( volatile unsigned int * ) ( 0x424C0330UL ) )
    #define bFM3_QPRC0_QCRH_BES1                 *( ( volatile unsigned int * ) ( 0x424C0334UL ) )
    #define bFM3_QPRC0_QCRH_CGE0                 *( ( volatile unsigned int * ) ( 0x424C0338UL ) )
    #define bFM3_QPRC0_QCRH_CGE1                 *( ( volatile unsigned int * ) ( 0x424C033CUL ) )
    #define bFM3_QPRC0_QECR_ORNGMD               *( ( volatile unsigned int * ) ( 0x424C0380UL ) )
    #define bFM3_QPRC0_QECR_ORNGF                *( ( volatile unsigned int * ) ( 0x424C0384UL ) )
    #define bFM3_QPRC0_QECR_ORNGIE               *( ( volatile unsigned int * ) ( 0x424C0388UL ) )

/* Quad position and revolution counter channel 1 registers */
    #define bFM3_QPRC1_QICR_QPCMIE               *( ( volatile unsigned int * ) ( 0x424C0A80UL ) )
    #define bFM3_QPRC1_QICR_QPCMF                *( ( volatile unsigned int * ) ( 0x424C0A84UL ) )
    #define bFM3_QPRC1_QICR_QPRCMIE              *( ( volatile unsigned int * ) ( 0x424C0A88UL ) )
    #define bFM3_QPRC1_QICR_QPRCMF               *( ( volatile unsigned int * ) ( 0x424C0A8CUL ) )
    #define bFM3_QPRC1_QICR_OUZIE                *( ( volatile unsigned int * ) ( 0x424C0A90UL ) )
    #define bFM3_QPRC1_QICR_UFDF                 *( ( volatile unsigned int * ) ( 0x424C0A94UL ) )
    #define bFM3_QPRC1_QICR_OFDF                 *( ( volatile unsigned int * ) ( 0x424C0A98UL ) )
    #define bFM3_QPRC1_QICR_ZIIF                 *( ( volatile unsigned int * ) ( 0x424C0A9CUL ) )
    #define bFM3_QPRC1_QICR_CDCIE                *( ( volatile unsigned int * ) ( 0x424C0AA0UL ) )
    #define bFM3_QPRC1_QICR_CDCF                 *( ( volatile unsigned int * ) ( 0x424C0AA4UL ) )
    #define bFM3_QPRC1_QICR_DIRPC                *( ( volatile unsigned int * ) ( 0x424C0AA8UL ) )
    #define bFM3_QPRC1_QICR_DIROU                *( ( volatile unsigned int * ) ( 0x424C0AACUL ) )
    #define bFM3_QPRC1_QICR_QPCNRCMIE            *( ( volatile unsigned int * ) ( 0x424C0AB0UL ) )
    #define bFM3_QPRC1_QICR_QPCNRCMF             *( ( volatile unsigned int * ) ( 0x424C0AB4UL ) )
    #define bFM3_QPRC1_QICRL_QPCMIE              *( ( volatile unsigned int * ) ( 0x424C0A80UL ) )
    #define bFM3_QPRC1_QICRL_QPCMF               *( ( volatile unsigned int * ) ( 0x424C0A84UL ) )
    #define bFM3_QPRC1_QICRL_QPRCMIE             *( ( volatile unsigned int * ) ( 0x424C0A88UL ) )
    #define bFM3_QPRC1_QICRL_QPRCMF              *( ( volatile unsigned int * ) ( 0x424C0A8CUL ) )
    #define bFM3_QPRC1_QICRL_OUZIE               *( ( volatile unsigned int * ) ( 0x424C0A90UL ) )
    #define bFM3_QPRC1_QICRL_UFDF                *( ( volatile unsigned int * ) ( 0x424C0A94UL ) )
    #define bFM3_QPRC1_QICRL_OFDF                *( ( volatile unsigned int * ) ( 0x424C0A98UL ) )
    #define bFM3_QPRC1_QICRL_ZIIF                *( ( volatile unsigned int * ) ( 0x424C0A9CUL ) )
    #define bFM3_QPRC1_QICRH_CDCIE               *( ( volatile unsigned int * ) ( 0x424C0AA0UL ) )
    #define bFM3_QPRC1_QICRH_CDCF                *( ( volatile unsigned int * ) ( 0x424C0AA4UL ) )
    #define bFM3_QPRC1_QICRH_DIRPC               *( ( volatile unsigned int * ) ( 0x424C0AA8UL ) )
    #define bFM3_QPRC1_QICRH_DIROU               *( ( volatile unsigned int * ) ( 0x424C0AACUL ) )
    #define bFM3_QPRC1_QICRH_QPCNRCMIE           *( ( volatile unsigned int * ) ( 0x424C0AB0UL ) )
    #define bFM3_QPRC1_QICRH_QPCNRCMF            *( ( volatile unsigned int * ) ( 0x424C0AB4UL ) )
    #define bFM3_QPRC1_QCR_PCM0                  *( ( volatile unsigned int * ) ( 0x424C0B00UL ) )
    #define bFM3_QPRC1_QCR_PCM1                  *( ( volatile unsigned int * ) ( 0x424C0B04UL ) )
    #define bFM3_QPRC1_QCR_RCM0                  *( ( volatile unsigned int * ) ( 0x424C0B08UL ) )
    #define bFM3_QPRC1_QCR_RCM1                  *( ( volatile unsigned int * ) ( 0x424C0B0CUL ) )
    #define bFM3_QPRC1_QCR_PSTP                  *( ( volatile unsigned int * ) ( 0x424C0B10UL ) )
    #define bFM3_QPRC1_QCR_CGSC                  *( ( volatile unsigned int * ) ( 0x424C0B14UL ) )
    #define bFM3_QPRC1_QCR_RSEL                  *( ( volatile unsigned int * ) ( 0x424C0B18UL ) )
    #define bFM3_QPRC1_QCR_SWAP                  *( ( volatile unsigned int * ) ( 0x424C0B1CUL ) )
    #define bFM3_QPRC1_QCR_PCRM0                 *( ( volatile unsigned int * ) ( 0x424C0B20UL ) )
    #define bFM3_QPRC1_QCR_PCRM1                 *( ( volatile unsigned int * ) ( 0x424C0B24UL ) )
    #define bFM3_QPRC1_QCR_AES0                  *( ( volatile unsigned int * ) ( 0x424C0B28UL ) )
    #define bFM3_QPRC1_QCR_AES1                  *( ( volatile unsigned int * ) ( 0x424C0B2CUL ) )
    #define bFM3_QPRC1_QCR_BES0                  *( ( volatile unsigned int * ) ( 0x424C0B30UL ) )
    #define bFM3_QPRC1_QCR_BES1                  *( ( volatile unsigned int * ) ( 0x424C0B34UL ) )
    #define bFM3_QPRC1_QCR_CGE0                  *( ( volatile unsigned int * ) ( 0x424C0B38UL ) )
    #define bFM3_QPRC1_QCR_CGE1                  *( ( volatile unsigned int * ) ( 0x424C0B3CUL ) )
    #define bFM3_QPRC1_QCRL_PCM0                 *( ( volatile unsigned int * ) ( 0x424C0B00UL ) )
    #define bFM3_QPRC1_QCRL_PCM1                 *( ( volatile unsigned int * ) ( 0x424C0B04UL ) )
    #define bFM3_QPRC1_QCRL_RCM0                 *( ( volatile unsigned int * ) ( 0x424C0B08UL ) )
    #define bFM3_QPRC1_QCRL_RCM1                 *( ( volatile unsigned int * ) ( 0x424C0B0CUL ) )
    #define bFM3_QPRC1_QCRL_PSTP                 *( ( volatile unsigned int * ) ( 0x424C0B10UL ) )
    #define bFM3_QPRC1_QCRL_CGSC                 *( ( volatile unsigned int * ) ( 0x424C0B14UL ) )
    #define bFM3_QPRC1_QCRL_RSEL                 *( ( volatile unsigned int * ) ( 0x424C0B18UL ) )
    #define bFM3_QPRC1_QCRL_SWAP                 *( ( volatile unsigned int * ) ( 0x424C0B1CUL ) )
    #define bFM3_QPRC1_QCRH_PCRM0                *( ( volatile unsigned int * ) ( 0x424C0B20UL ) )
    #define bFM3_QPRC1_QCRH_PCRM1                *( ( volatile unsigned int * ) ( 0x424C0B24UL ) )
    #define bFM3_QPRC1_QCRH_AES0                 *( ( volatile unsigned int * ) ( 0x424C0B28UL ) )
    #define bFM3_QPRC1_QCRH_AES1                 *( ( volatile unsigned int * ) ( 0x424C0B2CUL ) )
    #define bFM3_QPRC1_QCRH_BES0                 *( ( volatile unsigned int * ) ( 0x424C0B30UL ) )
    #define bFM3_QPRC1_QCRH_BES1                 *( ( volatile unsigned int * ) ( 0x424C0B34UL ) )
    #define bFM3_QPRC1_QCRH_CGE0                 *( ( volatile unsigned int * ) ( 0x424C0B38UL ) )
    #define bFM3_QPRC1_QCRH_CGE1                 *( ( volatile unsigned int * ) ( 0x424C0B3CUL ) )
    #define bFM3_QPRC1_QECR_ORNGMD               *( ( volatile unsigned int * ) ( 0x424C0B80UL ) )
    #define bFM3_QPRC1_QECR_ORNGF                *( ( volatile unsigned int * ) ( 0x424C0B84UL ) )
    #define bFM3_QPRC1_QECR_ORNGIE               *( ( volatile unsigned int * ) ( 0x424C0B88UL ) )

