FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* 12-bit ADC unit 0 registers */
    #define bFM3_ADC0_ADSR_SCS                   *( ( volatile unsigned int * ) ( 0x424E0000UL ) )
    #define bFM3_ADC0_ADSR_PCS                   *( ( volatile unsigned int * ) ( 0x424E0004UL ) )
    #define bFM3_ADC0_ADSR_PCNS                  *( ( volatile unsigned int * ) ( 0x424E0008UL ) )
    #define bFM3_ADC0_ADSR_FDAS                  *( ( volatile unsigned int * ) ( 0x424E0018UL ) )
    #define bFM3_ADC0_ADSR_ADSTP                 *( ( volatile unsigned int * ) ( 0x424E001CUL ) )
    #define bFM3_ADC0_ADCR_OVRIE                 *( ( volatile unsigned int * ) ( 0x424E0020UL ) )
    #define bFM3_ADC0_ADCR_CMPIE                 *( ( volatile unsigned int * ) ( 0x424E0024UL ) )
    #define bFM3_ADC0_ADCR_PCIE                  *( ( volatile unsigned int * ) ( 0x424E0028UL ) )
    #define bFM3_ADC0_ADCR_SCIE                  *( ( volatile unsigned int * ) ( 0x424E002CUL ) )
    #define bFM3_ADC0_ADCR_CMPIF                 *( ( volatile unsigned int * ) ( 0x424E0034UL ) )
    #define bFM3_ADC0_ADCR_PCIF                  *( ( volatile unsigned int * ) ( 0x424E0038UL ) )
    #define bFM3_ADC0_ADCR_SCIF                  *( ( volatile unsigned int * ) ( 0x424E003CUL ) )
    #define bFM3_ADC0_SFNS_SFS0                  *( ( volatile unsigned int * ) ( 0x424E0100UL ) )
    #define bFM3_ADC0_SFNS_SFS1                  *( ( volatile unsigned int * ) ( 0x424E0104UL ) )
    #define bFM3_ADC0_SFNS_SFS2                  *( ( volatile unsigned int * ) ( 0x424E0108UL ) )
    #define bFM3_ADC0_SFNS_SFS3                  *( ( volatile unsigned int * ) ( 0x424E010CUL ) )
    #define bFM3_ADC0_SCCR_SSTR                  *( ( volatile unsigned int * ) ( 0x424E0120UL ) )
    #define bFM3_ADC0_SCCR_SHEN                  *( ( volatile unsigned int * ) ( 0x424E0124UL ) )
    #define bFM3_ADC0_SCCR_RPT                   *( ( volatile unsigned int * ) ( 0x424E0128UL ) )
    #define bFM3_ADC0_SCCR_SFCLR                 *( ( volatile unsigned int * ) ( 0x424E0130UL ) )
    #define bFM3_ADC0_SCCR_SOVR                  *( ( volatile unsigned int * ) ( 0x424E0134UL ) )
    #define bFM3_ADC0_SCCR_SFUL                  *( ( volatile unsigned int * ) ( 0x424E0138UL ) )
    #define bFM3_ADC0_SCCR_SEMP                  *( ( volatile unsigned int * ) ( 0x424E013CUL ) )
    #define bFM3_ADC0_SCFD_SC0                   *( ( volatile unsigned int * ) ( 0x424E0180UL ) )
    #define bFM3_ADC0_SCFD_SC1                   *( ( volatile unsigned int * ) ( 0x424E0184UL ) )
    #define bFM3_ADC0_SCFD_SC2                   *( ( volatile unsigned int * ) ( 0x424E0188UL ) )
    #define bFM3_ADC0_SCFD_SC3                   *( ( volatile unsigned int * ) ( 0x424E018CUL ) )
    #define bFM3_ADC0_SCFD_SC4                   *( ( volatile unsigned int * ) ( 0x424E0190UL ) )
    #define bFM3_ADC0_SCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E01A0UL ) )
    #define bFM3_ADC0_SCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E01A4UL ) )
    #define bFM3_ADC0_SCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E01B0UL ) )
    #define bFM3_ADC0_SCFD_SD0                   *( ( volatile unsigned int * ) ( 0x424E01D0UL ) )
    #define bFM3_ADC0_SCFD_SD1                   *( ( volatile unsigned int * ) ( 0x424E01D4UL ) )
    #define bFM3_ADC0_SCFD_SD2                   *( ( volatile unsigned int * ) ( 0x424E01D8UL ) )
    #define bFM3_ADC0_SCFD_SD3                   *( ( volatile unsigned int * ) ( 0x424E01DCUL ) )
    #define bFM3_ADC0_SCFD_SD4                   *( ( volatile unsigned int * ) ( 0x424E01E0UL ) )
    #define bFM3_ADC0_SCFD_SD5                   *( ( volatile unsigned int * ) ( 0x424E01E4UL ) )
    #define bFM3_ADC0_SCFD_SD6                   *( ( volatile unsigned int * ) ( 0x424E01E8UL ) )
    #define bFM3_ADC0_SCFD_SD7                   *( ( volatile unsigned int * ) ( 0x424E01ECUL ) )
    #define bFM3_ADC0_SCFD_SD8                   *( ( volatile unsigned int * ) ( 0x424E01F0UL ) )
    #define bFM3_ADC0_SCFD_SD9                   *( ( volatile unsigned int * ) ( 0x424E01F4UL ) )
    #define bFM3_ADC0_SCFD_SD10                  *( ( volatile unsigned int * ) ( 0x424E01F8UL ) )
    #define bFM3_ADC0_SCFD_SD11                  *( ( volatile unsigned int * ) ( 0x424E01FCUL ) )
    #define bFM3_ADC0_SCFDL_SC0                  *( ( volatile unsigned int * ) ( 0x424E0180UL ) )
    #define bFM3_ADC0_SCFDL_SC1                  *( ( volatile unsigned int * ) ( 0x424E0184UL ) )
    #define bFM3_ADC0_SCFDL_SC2                  *( ( volatile unsigned int * ) ( 0x424E0188UL ) )
    #define bFM3_ADC0_SCFDL_SC3                  *( ( volatile unsigned int * ) ( 0x424E018CUL ) )
    #define bFM3_ADC0_SCFDL_SC4                  *( ( volatile unsigned int * ) ( 0x424E0190UL ) )
    #define bFM3_ADC0_SCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E01A0UL ) )
    #define bFM3_ADC0_SCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E01A4UL ) )
    #define bFM3_ADC0_SCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E01B0UL ) )
    #define bFM3_ADC0_SCFDH_SD0                  *( ( volatile unsigned int * ) ( 0x424E01D0UL ) )
    #define bFM3_ADC0_SCFDH_SD1                  *( ( volatile unsigned int * ) ( 0x424E01D4UL ) )
    #define bFM3_ADC0_SCFDH_SD2                  *( ( volatile unsigned int * ) ( 0x424E01D8UL ) )
    #define bFM3_ADC0_SCFDH_SD3                  *( ( volatile unsigned int * ) ( 0x424E01DCUL ) )
    #define bFM3_ADC0_SCFDH_SD4                  *( ( volatile unsigned int * ) ( 0x424E01E0UL ) )
    #define bFM3_ADC0_SCFDH_SD5                  *( ( volatile unsigned int * ) ( 0x424E01E4UL ) )
    #define bFM3_ADC0_SCFDH_SD6                  *( ( volatile unsigned int * ) ( 0x424E01E8UL ) )
    #define bFM3_ADC0_SCFDH_SD7                  *( ( volatile unsigned int * ) ( 0x424E01ECUL ) )
    #define bFM3_ADC0_SCFDH_SD8                  *( ( volatile unsigned int * ) ( 0x424E01F0UL ) )
    #define bFM3_ADC0_SCFDH_SD9                  *( ( volatile unsigned int * ) ( 0x424E01F4UL ) )
    #define bFM3_ADC0_SCFDH_SD10                 *( ( volatile unsigned int * ) ( 0x424E01F8UL ) )
    #define bFM3_ADC0_SCFDH_SD11                 *( ( volatile unsigned int * ) ( 0x424E01FCUL ) )
    #define bFM3_ADC0_SCIS23_AN16                *( ( volatile unsigned int * ) ( 0x424E0200UL ) )
    #define bFM3_ADC0_SCIS23_AN17                *( ( volatile unsigned int * ) ( 0x424E0204UL ) )
    #define bFM3_ADC0_SCIS23_AN18                *( ( volatile unsigned int * ) ( 0x424E0208UL ) )
    #define bFM3_ADC0_SCIS23_AN19                *( ( volatile unsigned int * ) ( 0x424E020CUL ) )
    #define bFM3_ADC0_SCIS23_AN20                *( ( volatile unsigned int * ) ( 0x424E0210UL ) )
    #define bFM3_ADC0_SCIS23_AN21                *( ( volatile unsigned int * ) ( 0x424E0214UL ) )
    #define bFM3_ADC0_SCIS23_AN22                *( ( volatile unsigned int * ) ( 0x424E0218UL ) )
    #define bFM3_ADC0_SCIS23_AN23                *( ( volatile unsigned int * ) ( 0x424E021CUL ) )
    #define bFM3_ADC0_SCIS23_AN24                *( ( volatile unsigned int * ) ( 0x424E0220UL ) )
    #define bFM3_ADC0_SCIS23_AN25                *( ( volatile unsigned int * ) ( 0x424E0224UL ) )
    #define bFM3_ADC0_SCIS23_AN26                *( ( volatile unsigned int * ) ( 0x424E0228UL ) )
    #define bFM3_ADC0_SCIS23_AN27                *( ( volatile unsigned int * ) ( 0x424E022CUL ) )
    #define bFM3_ADC0_SCIS23_AN28                *( ( volatile unsigned int * ) ( 0x424E0230UL ) )
    #define bFM3_ADC0_SCIS23_AN29                *( ( volatile unsigned int * ) ( 0x424E0234UL ) )
    #define bFM3_ADC0_SCIS23_AN30                *( ( volatile unsigned int * ) ( 0x424E0238UL ) )
    #define bFM3_ADC0_SCIS23_AN31                *( ( volatile unsigned int * ) ( 0x424E023CUL ) )
    #define bFM3_ADC0_SCIS2_AN16                 *( ( volatile unsigned int * ) ( 0x424E0200UL ) )
    #define bFM3_ADC0_SCIS2_AN17                 *( ( volatile unsigned int * ) ( 0x424E0204UL ) )
    #define bFM3_ADC0_SCIS2_AN18                 *( ( volatile unsigned int * ) ( 0x424E0208UL ) )
    #define bFM3_ADC0_SCIS2_AN19                 *( ( volatile unsigned int * ) ( 0x424E020CUL ) )
    #define bFM3_ADC0_SCIS2_AN20                 *( ( volatile unsigned int * ) ( 0x424E0210UL ) )
    #define bFM3_ADC0_SCIS2_AN21                 *( ( volatile unsigned int * ) ( 0x424E0214UL ) )
    #define bFM3_ADC0_SCIS2_AN22                 *( ( volatile unsigned int * ) ( 0x424E0218UL ) )
    #define bFM3_ADC0_SCIS2_AN23                 *( ( volatile unsigned int * ) ( 0x424E021CUL ) )
    #define bFM3_ADC0_SCIS3_AN24                 *( ( volatile unsigned int * ) ( 0x424E0220UL ) )
    #define bFM3_ADC0_SCIS3_AN25                 *( ( volatile unsigned int * ) ( 0x424E0224UL ) )
    #define bFM3_ADC0_SCIS3_AN26                 *( ( volatile unsigned int * ) ( 0x424E0228UL ) )
    #define bFM3_ADC0_SCIS3_AN27                 *( ( volatile unsigned int * ) ( 0x424E022CUL ) )
    #define bFM3_ADC0_SCIS3_AN28                 *( ( volatile unsigned int * ) ( 0x424E0230UL ) )
    #define bFM3_ADC0_SCIS3_AN29                 *( ( volatile unsigned int * ) ( 0x424E0234UL ) )
    #define bFM3_ADC0_SCIS3_AN30                 *( ( volatile unsigned int * ) ( 0x424E0238UL ) )
    #define bFM3_ADC0_SCIS3_AN31                 *( ( volatile unsigned int * ) ( 0x424E023CUL ) )
    #define bFM3_ADC0_SCIS01_AN0                 *( ( volatile unsigned int * ) ( 0x424E0280UL ) )
    #define bFM3_ADC0_SCIS01_AN1                 *( ( volatile unsigned int * ) ( 0x424E0284UL ) )
    #define bFM3_ADC0_SCIS01_AN2                 *( ( volatile unsigned int * ) ( 0x424E0288UL ) )
    #define bFM3_ADC0_SCIS01_AN3                 *( ( volatile unsigned int * ) ( 0x424E028CUL ) )
    #define bFM3_ADC0_SCIS01_AN4                 *( ( volatile unsigned int * ) ( 0x424E0290UL ) )
    #define bFM3_ADC0_SCIS01_AN5                 *( ( volatile unsigned int * ) ( 0x424E0294UL ) )
    #define bFM3_ADC0_SCIS01_AN6                 *( ( volatile unsigned int * ) ( 0x424E0298UL ) )
    #define bFM3_ADC0_SCIS01_AN7                 *( ( volatile unsigned int * ) ( 0x424E029CUL ) )
    #define bFM3_ADC0_SCIS01_AN8                 *( ( volatile unsigned int * ) ( 0x424E02A0UL ) )
    #define bFM3_ADC0_SCIS01_AN9                 *( ( volatile unsigned int * ) ( 0x424E02A4UL ) )
    #define bFM3_ADC0_SCIS01_AN10                *( ( volatile unsigned int * ) ( 0x424E02A8UL ) )
    #define bFM3_ADC0_SCIS01_AN11                *( ( volatile unsigned int * ) ( 0x424E02ACUL ) )
    #define bFM3_ADC0_SCIS01_AN12                *( ( volatile unsigned int * ) ( 0x424E02B0UL ) )
    #define bFM3_ADC0_SCIS01_AN13                *( ( volatile unsigned int * ) ( 0x424E02B4UL ) )
    #define bFM3_ADC0_SCIS01_AN14                *( ( volatile unsigned int * ) ( 0x424E02B8UL ) )
    #define bFM3_ADC0_SCIS01_AN15                *( ( volatile unsigned int * ) ( 0x424E02BCUL ) )
    #define bFM3_ADC0_SCIS0_AN0                  *( ( volatile unsigned int * ) ( 0x424E0280UL ) )
    #define bFM3_ADC0_SCIS0_AN1                  *( ( volatile unsigned int * ) ( 0x424E0284UL ) )
    #define bFM3_ADC0_SCIS0_AN2                  *( ( volatile unsigned int * ) ( 0x424E0288UL ) )
    #define bFM3_ADC0_SCIS0_AN3                  *( ( volatile unsigned int * ) ( 0x424E028CUL ) )
    #define bFM3_ADC0_SCIS0_AN4                  *( ( volatile unsigned int * ) ( 0x424E0290UL ) )
    #define bFM3_ADC0_SCIS0_AN5                  *( ( volatile unsigned int * ) ( 0x424E0294UL ) )
    #define bFM3_ADC0_SCIS0_AN6                  *( ( volatile unsigned int * ) ( 0x424E0298UL ) )
    #define bFM3_ADC0_SCIS0_AN7                  *( ( volatile unsigned int * ) ( 0x424E029CUL ) )
    #define bFM3_ADC0_SCIS1_AN8                  *( ( volatile unsigned int * ) ( 0x424E02A0UL ) )
    #define bFM3_ADC0_SCIS1_AN9                  *( ( volatile unsigned int * ) ( 0x424E02A4UL ) )
    #define bFM3_ADC0_SCIS1_AN10                 *( ( volatile unsigned int * ) ( 0x424E02A8UL ) )
    #define bFM3_ADC0_SCIS1_AN11                 *( ( volatile unsigned int * ) ( 0x424E02ACUL ) )
    #define bFM3_ADC0_SCIS1_AN12                 *( ( volatile unsigned int * ) ( 0x424E02B0UL ) )
    #define bFM3_ADC0_SCIS1_AN13                 *( ( volatile unsigned int * ) ( 0x424E02B4UL ) )
    #define bFM3_ADC0_SCIS1_AN14                 *( ( volatile unsigned int * ) ( 0x424E02B8UL ) )
    #define bFM3_ADC0_SCIS1_AN15                 *( ( volatile unsigned int * ) ( 0x424E02BCUL ) )
    #define bFM3_ADC0_PFNS_PFS0                  *( ( volatile unsigned int * ) ( 0x424E0300UL ) )
    #define bFM3_ADC0_PFNS_PFS1                  *( ( volatile unsigned int * ) ( 0x424E0304UL ) )
    #define bFM3_ADC0_PFNS_TEST0                 *( ( volatile unsigned int * ) ( 0x424E0310UL ) )
    #define bFM3_ADC0_PFNS_TEST1                 *( ( volatile unsigned int * ) ( 0x424E0314UL ) )
    #define bFM3_ADC0_PCCR_PSTR                  *( ( volatile unsigned int * ) ( 0x424E0320UL ) )
    #define bFM3_ADC0_PCCR_PHEN                  *( ( volatile unsigned int * ) ( 0x424E0324UL ) )
    #define bFM3_ADC0_PCCR_PEEN                  *( ( volatile unsigned int * ) ( 0x424E0328UL ) )
    #define bFM3_ADC0_PCCR_ESCE                  *( ( volatile unsigned int * ) ( 0x424E032CUL ) )
    #define bFM3_ADC0_PCCR_PFCLR                 *( ( volatile unsigned int * ) ( 0x424E0330UL ) )
    #define bFM3_ADC0_PCCR_POVR                  *( ( volatile unsigned int * ) ( 0x424E0334UL ) )
    #define bFM3_ADC0_PCCR_PFUL                  *( ( volatile unsigned int * ) ( 0x424E0338UL ) )
    #define bFM3_ADC0_PCCR_PEMP                  *( ( volatile unsigned int * ) ( 0x424E033CUL ) )
    #define bFM3_ADC0_PCFD_PC0                   *( ( volatile unsigned int * ) ( 0x424E0380UL ) )
    #define bFM3_ADC0_PCFD_PC1                   *( ( volatile unsigned int * ) ( 0x424E0384UL ) )
    #define bFM3_ADC0_PCFD_PC2                   *( ( volatile unsigned int * ) ( 0x424E0388UL ) )
    #define bFM3_ADC0_PCFD_PC3                   *( ( volatile unsigned int * ) ( 0x424E038CUL ) )
    #define bFM3_ADC0_PCFD_PC4                   *( ( volatile unsigned int * ) ( 0x424E0390UL ) )
    #define bFM3_ADC0_PCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E03A0UL ) )
    #define bFM3_ADC0_PCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E03A4UL ) )
    #define bFM3_ADC0_PCFD_RS2                   *( ( volatile unsigned int * ) ( 0x424E03A8UL ) )
    #define bFM3_ADC0_PCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E03B0UL ) )
    #define bFM3_ADC0_PCFD_PD0                   *( ( volatile unsigned int * ) ( 0x424E03D0UL ) )
    #define bFM3_ADC0_PCFD_PD1                   *( ( volatile unsigned int * ) ( 0x424E03D4UL ) )
    #define bFM3_ADC0_PCFD_PD2                   *( ( volatile unsigned int * ) ( 0x424E03D8UL ) )
    #define bFM3_ADC0_PCFD_PD3                   *( ( volatile unsigned int * ) ( 0x424E03DCUL ) )
    #define bFM3_ADC0_PCFD_PD4                   *( ( volatile unsigned int * ) ( 0x424E03E0UL ) )
    #define bFM3_ADC0_PCFD_PD5                   *( ( volatile unsigned int * ) ( 0x424E03E4UL ) )
    #define bFM3_ADC0_PCFD_PD6                   *( ( volatile unsigned int * ) ( 0x424E03E8UL ) )
    #define bFM3_ADC0_PCFD_PD7                   *( ( volatile unsigned int * ) ( 0x424E03ECUL ) )
    #define bFM3_ADC0_PCFD_PD8                   *( ( volatile unsigned int * ) ( 0x424E03F0UL ) )
    #define bFM3_ADC0_PCFD_PD9                   *( ( volatile unsigned int * ) ( 0x424E03F4UL ) )
    #define bFM3_ADC0_PCFD_PD10                  *( ( volatile unsigned int * ) ( 0x424E03F8UL ) )
    #define bFM3_ADC0_PCFD_PD11                  *( ( volatile unsigned int * ) ( 0x424E03FCUL ) )
    #define bFM3_ADC0_PCFDL_PC0                  *( ( volatile unsigned int * ) ( 0x424E0380UL ) )
    #define bFM3_ADC0_PCFDL_PC1                  *( ( volatile unsigned int * ) ( 0x424E0384UL ) )
    #define bFM3_ADC0_PCFDL_PC2                  *( ( volatile unsigned int * ) ( 0x424E0388UL ) )
    #define bFM3_ADC0_PCFDL_PC3                  *( ( volatile unsigned int * ) ( 0x424E038CUL ) )
    #define bFM3_ADC0_PCFDL_PC4                  *( ( volatile unsigned int * ) ( 0x424E0390UL ) )
    #define bFM3_ADC0_PCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E03A0UL ) )
    #define bFM3_ADC0_PCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E03A4UL ) )
    #define bFM3_ADC0_PCFDL_RS2                  *( ( volatile unsigned int * ) ( 0x424E03A8UL ) )
    #define bFM3_ADC0_PCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E03B0UL ) )
    #define bFM3_ADC0_PCFDH_PD0                  *( ( volatile unsigned int * ) ( 0x424E03D0UL ) )
    #define bFM3_ADC0_PCFDH_PD1                  *( ( volatile unsigned int * ) ( 0x424E03D4UL ) )
    #define bFM3_ADC0_PCFDH_PD2                  *( ( volatile unsigned int * ) ( 0x424E03D8UL ) )
    #define bFM3_ADC0_PCFDH_PD3                  *( ( volatile unsigned int * ) ( 0x424E03DCUL ) )
    #define bFM3_ADC0_PCFDH_PD4                  *( ( volatile unsigned int * ) ( 0x424E03E0UL ) )
    #define bFM3_ADC0_PCFDH_PD5                  *( ( volatile unsigned int * ) ( 0x424E03E4UL ) )
    #define bFM3_ADC0_PCFDH_PD6                  *( ( volatile unsigned int * ) ( 0x424E03E8UL ) )
    #define bFM3_ADC0_PCFDH_PD7                  *( ( volatile unsigned int * ) ( 0x424E03ECUL ) )
    #define bFM3_ADC0_PCFDH_PD8                  *( ( volatile unsigned int * ) ( 0x424E03F0UL ) )
    #define bFM3_ADC0_PCFDH_PD9                  *( ( volatile unsigned int * ) ( 0x424E03F4UL ) )
    #define bFM3_ADC0_PCFDH_PD10                 *( ( volatile unsigned int * ) ( 0x424E03F8UL ) )
    #define bFM3_ADC0_PCFDH_PD11                 *( ( volatile unsigned int * ) ( 0x424E03FCUL ) )
    #define bFM3_ADC0_PCIS_P1A0                  *( ( volatile unsigned int * ) ( 0x424E0400UL ) )
    #define bFM3_ADC0_PCIS_P1A1                  *( ( volatile unsigned int * ) ( 0x424E0404UL ) )
    #define bFM3_ADC0_PCIS_P1A2                  *( ( volatile unsigned int * ) ( 0x424E0408UL ) )
    #define bFM3_ADC0_PCIS_P2A0                  *( ( volatile unsigned int * ) ( 0x424E040CUL ) )
    #define bFM3_ADC0_PCIS_P2A1                  *( ( volatile unsigned int * ) ( 0x424E0410UL ) )
    #define bFM3_ADC0_PCIS_P2A2                  *( ( volatile unsigned int * ) ( 0x424E0414UL ) )
    #define bFM3_ADC0_PCIS_P2A3                  *( ( volatile unsigned int * ) ( 0x424E0418UL ) )
    #define bFM3_ADC0_PCIS_P2A4                  *( ( volatile unsigned int * ) ( 0x424E041CUL ) )
    #define bFM3_ADC0_CMPCR_CCH0                 *( ( volatile unsigned int * ) ( 0x424E0480UL ) )
    #define bFM3_ADC0_CMPCR_CCH1                 *( ( volatile unsigned int * ) ( 0x424E0484UL ) )
    #define bFM3_ADC0_CMPCR_CCH2                 *( ( volatile unsigned int * ) ( 0x424E0488UL ) )
    #define bFM3_ADC0_CMPCR_CCH3                 *( ( volatile unsigned int * ) ( 0x424E048CUL ) )
    #define bFM3_ADC0_CMPCR_CCH4                 *( ( volatile unsigned int * ) ( 0x424E0490UL ) )
    #define bFM3_ADC0_CMPCR_CMD0                 *( ( volatile unsigned int * ) ( 0x424E0494UL ) )
    #define bFM3_ADC0_CMPCR_CMD1                 *( ( volatile unsigned int * ) ( 0x424E0498UL ) )
    #define bFM3_ADC0_CMPCR_CMPEN                *( ( volatile unsigned int * ) ( 0x424E049CUL ) )
    #define bFM3_ADC0_CMPD_CMAD2                 *( ( volatile unsigned int * ) ( 0x424E04D8UL ) )
    #define bFM3_ADC0_CMPD_CMAD3                 *( ( volatile unsigned int * ) ( 0x424E04DCUL ) )
    #define bFM3_ADC0_CMPD_CMAD4                 *( ( volatile unsigned int * ) ( 0x424E04E0UL ) )
    #define bFM3_ADC0_CMPD_CMAD5                 *( ( volatile unsigned int * ) ( 0x424E04E4UL ) )
    #define bFM3_ADC0_CMPD_CMAD6                 *( ( volatile unsigned int * ) ( 0x424E04E8UL ) )
    #define bFM3_ADC0_CMPD_CMAD7                 *( ( volatile unsigned int * ) ( 0x424E04ECUL ) )
    #define bFM3_ADC0_CMPD_CMAD8                 *( ( volatile unsigned int * ) ( 0x424E04F0UL ) )
    #define bFM3_ADC0_CMPD_CMAD9                 *( ( volatile unsigned int * ) ( 0x424E04F4UL ) )
    #define bFM3_ADC0_CMPD_CMAD10                *( ( volatile unsigned int * ) ( 0x424E04F8UL ) )
    #define bFM3_ADC0_CMPD_CMAD11                *( ( volatile unsigned int * ) ( 0x424E04FCUL ) )
    #define bFM3_ADC0_ADSS23_TS16                *( ( volatile unsigned int * ) ( 0x424E0500UL ) )
    #define bFM3_ADC0_ADSS23_TS17                *( ( volatile unsigned int * ) ( 0x424E0504UL ) )
    #define bFM3_ADC0_ADSS23_TS18                *( ( volatile unsigned int * ) ( 0x424E0508UL ) )
    #define bFM3_ADC0_ADSS23_TS19                *( ( volatile unsigned int * ) ( 0x424E050CUL ) )
    #define bFM3_ADC0_ADSS23_TS20                *( ( volatile unsigned int * ) ( 0x424E0510UL ) )
    #define bFM3_ADC0_ADSS23_TS21                *( ( volatile unsigned int * ) ( 0x424E0514UL ) )
    #define bFM3_ADC0_ADSS23_TS22                *( ( volatile unsigned int * ) ( 0x424E0518UL ) )
    #define bFM3_ADC0_ADSS23_TS23                *( ( volatile unsigned int * ) ( 0x424E051CUL ) )
    #define bFM3_ADC0_ADSS23_TS24                *( ( volatile unsigned int * ) ( 0x424E0520UL ) )
    #define bFM3_ADC0_ADSS23_TS25                *( ( volatile unsigned int * ) ( 0x424E0524UL ) )
    #define bFM3_ADC0_ADSS23_TS26                *( ( volatile unsigned int * ) ( 0x424E0528UL ) )
    #define bFM3_ADC0_ADSS23_TS27                *( ( volatile unsigned int * ) ( 0x424E052CUL ) )
    #define bFM3_ADC0_ADSS23_TS28                *( ( volatile unsigned int * ) ( 0x424E0530UL ) )
    #define bFM3_ADC0_ADSS23_TS29                *( ( volatile unsigned int * ) ( 0x424E0534UL ) )
    #define bFM3_ADC0_ADSS23_TS30                *( ( volatile unsigned int * ) ( 0x424E0538UL ) )
    #define bFM3_ADC0_ADSS23_TS31                *( ( volatile unsigned int * ) ( 0x424E053CUL ) )
    #define bFM3_ADC0_ADSS2_TS16                 *( ( volatile unsigned int * ) ( 0x424E0500UL ) )
    #define bFM3_ADC0_ADSS2_TS17                 *( ( volatile unsigned int * ) ( 0x424E0504UL ) )
    #define bFM3_ADC0_ADSS2_TS18                 *( ( volatile unsigned int * ) ( 0x424E0508UL ) )
    #define bFM3_ADC0_ADSS2_TS19                 *( ( volatile unsigned int * ) ( 0x424E050CUL ) )
    #define bFM3_ADC0_ADSS2_TS20                 *( ( volatile unsigned int * ) ( 0x424E0510UL ) )
    #define bFM3_ADC0_ADSS2_TS21                 *( ( volatile unsigned int * ) ( 0x424E0514UL ) )
    #define bFM3_ADC0_ADSS2_TS22                 *( ( volatile unsigned int * ) ( 0x424E0518UL ) )
    #define bFM3_ADC0_ADSS2_TS23                 *( ( volatile unsigned int * ) ( 0x424E051CUL ) )
    #define bFM3_ADC0_ADSS3_TS24                 *( ( volatile unsigned int * ) ( 0x424E0520UL ) )
    #define bFM3_ADC0_ADSS3_TS25                 *( ( volatile unsigned int * ) ( 0x424E0524UL ) )
    #define bFM3_ADC0_ADSS3_TS26                 *( ( volatile unsigned int * ) ( 0x424E0528UL ) )
    #define bFM3_ADC0_ADSS3_TS27                 *( ( volatile unsigned int * ) ( 0x424E052CUL ) )
    #define bFM3_ADC0_ADSS3_TS28                 *( ( volatile unsigned int * ) ( 0x424E0530UL ) )
    #define bFM3_ADC0_ADSS3_TS29                 *( ( volatile unsigned int * ) ( 0x424E0534UL ) )
    #define bFM3_ADC0_ADSS3_TS30                 *( ( volatile unsigned int * ) ( 0x424E0538UL ) )
    #define bFM3_ADC0_ADSS3_TS31                 *( ( volatile unsigned int * ) ( 0x424E053CUL ) )
    #define bFM3_ADC0_ADSS01_TS0                 *( ( volatile unsigned int * ) ( 0x424E0580UL ) )
    #define bFM3_ADC0_ADSS01_TS1                 *( ( volatile unsigned int * ) ( 0x424E0584UL ) )
    #define bFM3_ADC0_ADSS01_TS2                 *( ( volatile unsigned int * ) ( 0x424E0588UL ) )
