FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_ADC0_ADSS01_TS3                 *( ( volatile unsigned int * ) ( 0x424E058CUL ) )
    #define bFM3_ADC0_ADSS01_TS4                 *( ( volatile unsigned int * ) ( 0x424E0590UL ) )
    #define bFM3_ADC0_ADSS01_TS5                 *( ( volatile unsigned int * ) ( 0x424E0594UL ) )
    #define bFM3_ADC0_ADSS01_TS6                 *( ( volatile unsigned int * ) ( 0x424E0598UL ) )
    #define bFM3_ADC0_ADSS01_TS7                 *( ( volatile unsigned int * ) ( 0x424E059CUL ) )
    #define bFM3_ADC0_ADSS01_TS8                 *( ( volatile unsigned int * ) ( 0x424E05A0UL ) )
    #define bFM3_ADC0_ADSS01_TS9                 *( ( volatile unsigned int * ) ( 0x424E05A4UL ) )
    #define bFM3_ADC0_ADSS01_TS10                *( ( volatile unsigned int * ) ( 0x424E05A8UL ) )
    #define bFM3_ADC0_ADSS01_TS11                *( ( volatile unsigned int * ) ( 0x424E05ACUL ) )
    #define bFM3_ADC0_ADSS01_TS12                *( ( volatile unsigned int * ) ( 0x424E05B0UL ) )
    #define bFM3_ADC0_ADSS01_TS13                *( ( volatile unsigned int * ) ( 0x424E05B4UL ) )
    #define bFM3_ADC0_ADSS01_TS14                *( ( volatile unsigned int * ) ( 0x424E05B8UL ) )
    #define bFM3_ADC0_ADSS01_TS15                *( ( volatile unsigned int * ) ( 0x424E05BCUL ) )
    #define bFM3_ADC0_ADSS0_TS0                  *( ( volatile unsigned int * ) ( 0x424E0580UL ) )
    #define bFM3_ADC0_ADSS0_TS1                  *( ( volatile unsigned int * ) ( 0x424E0584UL ) )
    #define bFM3_ADC0_ADSS0_TS2                  *( ( volatile unsigned int * ) ( 0x424E0588UL ) )
    #define bFM3_ADC0_ADSS0_TS3                  *( ( volatile unsigned int * ) ( 0x424E058CUL ) )
    #define bFM3_ADC0_ADSS0_TS4                  *( ( volatile unsigned int * ) ( 0x424E0590UL ) )
    #define bFM3_ADC0_ADSS0_TS5                  *( ( volatile unsigned int * ) ( 0x424E0594UL ) )
    #define bFM3_ADC0_ADSS0_TS6                  *( ( volatile unsigned int * ) ( 0x424E0598UL ) )
    #define bFM3_ADC0_ADSS0_TS7                  *( ( volatile unsigned int * ) ( 0x424E059CUL ) )
    #define bFM3_ADC0_ADSS1_TS8                  *( ( volatile unsigned int * ) ( 0x424E05A0UL ) )
    #define bFM3_ADC0_ADSS1_TS9                  *( ( volatile unsigned int * ) ( 0x424E05A4UL ) )
    #define bFM3_ADC0_ADSS1_TS10                 *( ( volatile unsigned int * ) ( 0x424E05A8UL ) )
    #define bFM3_ADC0_ADSS1_TS11                 *( ( volatile unsigned int * ) ( 0x424E05ACUL ) )
    #define bFM3_ADC0_ADSS1_TS12                 *( ( volatile unsigned int * ) ( 0x424E05B0UL ) )
    #define bFM3_ADC0_ADSS1_TS13                 *( ( volatile unsigned int * ) ( 0x424E05B4UL ) )
    #define bFM3_ADC0_ADSS1_TS14                 *( ( volatile unsigned int * ) ( 0x424E05B8UL ) )
    #define bFM3_ADC0_ADSS1_TS15                 *( ( volatile unsigned int * ) ( 0x424E05BCUL ) )
    #define bFM3_ADC0_ADST01_ST10                *( ( volatile unsigned int * ) ( 0x424E0600UL ) )
    #define bFM3_ADC0_ADST01_ST11                *( ( volatile unsigned int * ) ( 0x424E0604UL ) )
    #define bFM3_ADC0_ADST01_ST12                *( ( volatile unsigned int * ) ( 0x424E0608UL ) )
    #define bFM3_ADC0_ADST01_ST13                *( ( volatile unsigned int * ) ( 0x424E060CUL ) )
    #define bFM3_ADC0_ADST01_ST14                *( ( volatile unsigned int * ) ( 0x424E0610UL ) )
    #define bFM3_ADC0_ADST01_STX10               *( ( volatile unsigned int * ) ( 0x424E0614UL ) )
    #define bFM3_ADC0_ADST01_STX11               *( ( volatile unsigned int * ) ( 0x424E0618UL ) )
    #define bFM3_ADC0_ADST01_STX12               *( ( volatile unsigned int * ) ( 0x424E061CUL ) )
    #define bFM3_ADC0_ADST01_ST00                *( ( volatile unsigned int * ) ( 0x424E0620UL ) )
    #define bFM3_ADC0_ADST01_ST01                *( ( volatile unsigned int * ) ( 0x424E0624UL ) )
    #define bFM3_ADC0_ADST01_ST02                *( ( volatile unsigned int * ) ( 0x424E0628UL ) )
    #define bFM3_ADC0_ADST01_ST03                *( ( volatile unsigned int * ) ( 0x424E062CUL ) )
    #define bFM3_ADC0_ADST01_ST04                *( ( volatile unsigned int * ) ( 0x424E0630UL ) )
    #define bFM3_ADC0_ADST01_STX00               *( ( volatile unsigned int * ) ( 0x424E0634UL ) )
    #define bFM3_ADC0_ADST01_STX01               *( ( volatile unsigned int * ) ( 0x424E0638UL ) )
    #define bFM3_ADC0_ADST01_STX02               *( ( volatile unsigned int * ) ( 0x424E063CUL ) )
    #define bFM3_ADC0_ADST1_ST10                 *( ( volatile unsigned int * ) ( 0x424E0600UL ) )
    #define bFM3_ADC0_ADST1_ST11                 *( ( volatile unsigned int * ) ( 0x424E0604UL ) )
    #define bFM3_ADC0_ADST1_ST12                 *( ( volatile unsigned int * ) ( 0x424E0608UL ) )
    #define bFM3_ADC0_ADST1_ST13                 *( ( volatile unsigned int * ) ( 0x424E060CUL ) )
    #define bFM3_ADC0_ADST1_ST14                 *( ( volatile unsigned int * ) ( 0x424E0610UL ) )
    #define bFM3_ADC0_ADST1_STX10                *( ( volatile unsigned int * ) ( 0x424E0614UL ) )
    #define bFM3_ADC0_ADST1_STX11                *( ( volatile unsigned int * ) ( 0x424E0618UL ) )
    #define bFM3_ADC0_ADST1_STX12                *( ( volatile unsigned int * ) ( 0x424E061CUL ) )
    #define bFM3_ADC0_ADST0_ST00                 *( ( volatile unsigned int * ) ( 0x424E0620UL ) )
    #define bFM3_ADC0_ADST0_ST01                 *( ( volatile unsigned int * ) ( 0x424E0624UL ) )
    #define bFM3_ADC0_ADST0_ST02                 *( ( volatile unsigned int * ) ( 0x424E0628UL ) )
    #define bFM3_ADC0_ADST0_ST03                 *( ( volatile unsigned int * ) ( 0x424E062CUL ) )
    #define bFM3_ADC0_ADST0_ST04                 *( ( volatile unsigned int * ) ( 0x424E0630UL ) )
    #define bFM3_ADC0_ADST0_STX00                *( ( volatile unsigned int * ) ( 0x424E0634UL ) )
    #define bFM3_ADC0_ADST0_STX01                *( ( volatile unsigned int * ) ( 0x424E0638UL ) )
    #define bFM3_ADC0_ADST0_STX02                *( ( volatile unsigned int * ) ( 0x424E063CUL ) )
    #define bFM3_ADC0_ADCT_CT0                   *( ( volatile unsigned int * ) ( 0x424E0680UL ) )
    #define bFM3_ADC0_ADCT_CT1                   *( ( volatile unsigned int * ) ( 0x424E0684UL ) )
    #define bFM3_ADC0_ADCT_CT2                   *( ( volatile unsigned int * ) ( 0x424E0688UL ) )
    #define bFM3_ADC0_PRTSL_PRTSL0               *( ( volatile unsigned int * ) ( 0x424E0700UL ) )
    #define bFM3_ADC0_PRTSL_PRTSL1               *( ( volatile unsigned int * ) ( 0x424E0704UL ) )
    #define bFM3_ADC0_PRTSL_PRTSL2               *( ( volatile unsigned int * ) ( 0x424E0708UL ) )
    #define bFM3_ADC0_PRTSL_PRTSL3               *( ( volatile unsigned int * ) ( 0x424E070CUL ) )
    #define bFM3_ADC0_SCTSL_SCTSL0               *( ( volatile unsigned int * ) ( 0x424E0720UL ) )
    #define bFM3_ADC0_SCTSL_SCTSL1               *( ( volatile unsigned int * ) ( 0x424E0724UL ) )
    #define bFM3_ADC0_SCTSL_SCTSL2               *( ( volatile unsigned int * ) ( 0x424E0728UL ) )
    #define bFM3_ADC0_SCTSL_SCTSL3               *( ( volatile unsigned int * ) ( 0x424E072CUL ) )
    #define bFM3_ADC0_ADCEN_ENBL                 *( ( volatile unsigned int * ) ( 0x424E0780UL ) )
    #define bFM3_ADC0_ADCEN_READY                *( ( volatile unsigned int * ) ( 0x424E0784UL ) )

