FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* 12-bit ADC unit 1 registers */
    #define bFM3_ADC1_ADSR_SCS                   *( ( volatile unsigned int * ) ( 0x424E2000UL ) )
    #define bFM3_ADC1_ADSR_PCS                   *( ( volatile unsigned int * ) ( 0x424E2004UL ) )
    #define bFM3_ADC1_ADSR_PCNS                  *( ( volatile unsigned int * ) ( 0x424E2008UL ) )
    #define bFM3_ADC1_ADSR_FDAS                  *( ( volatile unsigned int * ) ( 0x424E2018UL ) )
    #define bFM3_ADC1_ADSR_ADSTP                 *( ( volatile unsigned int * ) ( 0x424E201CUL ) )
    #define bFM3_ADC1_ADCR_OVRIE                 *( ( volatile unsigned int * ) ( 0x424E2020UL ) )
    #define bFM3_ADC1_ADCR_CMPIE                 *( ( volatile unsigned int * ) ( 0x424E2024UL ) )
    #define bFM3_ADC1_ADCR_PCIE                  *( ( volatile unsigned int * ) ( 0x424E2028UL ) )
    #define bFM3_ADC1_ADCR_SCIE                  *( ( volatile unsigned int * ) ( 0x424E202CUL ) )
    #define bFM3_ADC1_ADCR_CMPIF                 *( ( volatile unsigned int * ) ( 0x424E2034UL ) )
    #define bFM3_ADC1_ADCR_PCIF                  *( ( volatile unsigned int * ) ( 0x424E2038UL ) )
    #define bFM3_ADC1_ADCR_SCIF                  *( ( volatile unsigned int * ) ( 0x424E203CUL ) )
    #define bFM3_ADC1_SFNS_SFS0                  *( ( volatile unsigned int * ) ( 0x424E2100UL ) )
    #define bFM3_ADC1_SFNS_SFS1                  *( ( volatile unsigned int * ) ( 0x424E2104UL ) )
    #define bFM3_ADC1_SFNS_SFS2                  *( ( volatile unsigned int * ) ( 0x424E2108UL ) )
    #define bFM3_ADC1_SFNS_SFS3                  *( ( volatile unsigned int * ) ( 0x424E210CUL ) )
    #define bFM3_ADC1_SCCR_SSTR                  *( ( volatile unsigned int * ) ( 0x424E2120UL ) )
    #define bFM3_ADC1_SCCR_SHEN                  *( ( volatile unsigned int * ) ( 0x424E2124UL ) )
    #define bFM3_ADC1_SCCR_RPT                   *( ( volatile unsigned int * ) ( 0x424E2128UL ) )
    #define bFM3_ADC1_SCCR_SFCLR                 *( ( volatile unsigned int * ) ( 0x424E2130UL ) )
    #define bFM3_ADC1_SCCR_SOVR                  *( ( volatile unsigned int * ) ( 0x424E2134UL ) )
    #define bFM3_ADC1_SCCR_SFUL                  *( ( volatile unsigned int * ) ( 0x424E2138UL ) )
    #define bFM3_ADC1_SCCR_SEMP                  *( ( volatile unsigned int * ) ( 0x424E213CUL ) )
    #define bFM3_ADC1_SCFD_SC0                   *( ( volatile unsigned int * ) ( 0x424E2180UL ) )
    #define bFM3_ADC1_SCFD_SC1                   *( ( volatile unsigned int * ) ( 0x424E2184UL ) )
    #define bFM3_ADC1_SCFD_SC2                   *( ( volatile unsigned int * ) ( 0x424E2188UL ) )
    #define bFM3_ADC1_SCFD_SC3                   *( ( volatile unsigned int * ) ( 0x424E218CUL ) )
    #define bFM3_ADC1_SCFD_SC4                   *( ( volatile unsigned int * ) ( 0x424E2190UL ) )
    #define bFM3_ADC1_SCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E21A0UL ) )
    #define bFM3_ADC1_SCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E21A4UL ) )
    #define bFM3_ADC1_SCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E21B0UL ) )
    #define bFM3_ADC1_SCFD_SD0                   *( ( volatile unsigned int * ) ( 0x424E21D0UL ) )
    #define bFM3_ADC1_SCFD_SD1                   *( ( volatile unsigned int * ) ( 0x424E21D4UL ) )
    #define bFM3_ADC1_SCFD_SD2                   *( ( volatile unsigned int * ) ( 0x424E21D8UL ) )
    #define bFM3_ADC1_SCFD_SD3                   *( ( volatile unsigned int * ) ( 0x424E21DCUL ) )
    #define bFM3_ADC1_SCFD_SD4                   *( ( volatile unsigned int * ) ( 0x424E21E0UL ) )
    #define bFM3_ADC1_SCFD_SD5                   *( ( volatile unsigned int * ) ( 0x424E21E4UL ) )
    #define bFM3_ADC1_SCFD_SD6                   *( ( volatile unsigned int * ) ( 0x424E21E8UL ) )
    #define bFM3_ADC1_SCFD_SD7                   *( ( volatile unsigned int * ) ( 0x424E21ECUL ) )
    #define bFM3_ADC1_SCFD_SD8                   *( ( volatile unsigned int * ) ( 0x424E21F0UL ) )
    #define bFM3_ADC1_SCFD_SD9                   *( ( volatile unsigned int * ) ( 0x424E21F4UL ) )
    #define bFM3_ADC1_SCFD_SD10                  *( ( volatile unsigned int * ) ( 0x424E21F8UL ) )
    #define bFM3_ADC1_SCFD_SD11                  *( ( volatile unsigned int * ) ( 0x424E21FCUL ) )
    #define bFM3_ADC1_SCFDL_SC0                  *( ( volatile unsigned int * ) ( 0x424E2180UL ) )
    #define bFM3_ADC1_SCFDL_SC1                  *( ( volatile unsigned int * ) ( 0x424E2184UL ) )
    #define bFM3_ADC1_SCFDL_SC2                  *( ( volatile unsigned int * ) ( 0x424E2188UL ) )
    #define bFM3_ADC1_SCFDL_SC3                  *( ( volatile unsigned int * ) ( 0x424E218CUL ) )
    #define bFM3_ADC1_SCFDL_SC4                  *( ( volatile unsigned int * ) ( 0x424E2190UL ) )
    #define bFM3_ADC1_SCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E21A0UL ) )
    #define bFM3_ADC1_SCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E21A4UL ) )
    #define bFM3_ADC1_SCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E21B0UL ) )
    #define bFM3_ADC1_SCFDH_SD0                  *( ( volatile unsigned int * ) ( 0x424E21D0UL ) )
    #define bFM3_ADC1_SCFDH_SD1                  *( ( volatile unsigned int * ) ( 0x424E21D4UL ) )
    #define bFM3_ADC1_SCFDH_SD2                  *( ( volatile unsigned int * ) ( 0x424E21D8UL ) )
    #define bFM3_ADC1_SCFDH_SD3                  *( ( volatile unsigned int * ) ( 0x424E21DCUL ) )
    #define bFM3_ADC1_SCFDH_SD4                  *( ( volatile unsigned int * ) ( 0x424E21E0UL ) )
    #define bFM3_ADC1_SCFDH_SD5                  *( ( volatile unsigned int * ) ( 0x424E21E4UL ) )
    #define bFM3_ADC1_SCFDH_SD6                  *( ( volatile unsigned int * ) ( 0x424E21E8UL ) )
    #define bFM3_ADC1_SCFDH_SD7                  *( ( volatile unsigned int * ) ( 0x424E21ECUL ) )
    #define bFM3_ADC1_SCFDH_SD8                  *( ( volatile unsigned int * ) ( 0x424E21F0UL ) )
    #define bFM3_ADC1_SCFDH_SD9                  *( ( volatile unsigned int * ) ( 0x424E21F4UL ) )
    #define bFM3_ADC1_SCFDH_SD10                 *( ( volatile unsigned int * ) ( 0x424E21F8UL ) )
    #define bFM3_ADC1_SCFDH_SD11                 *( ( volatile unsigned int * ) ( 0x424E21FCUL ) )
    #define bFM3_ADC1_SCIS23_AN16                *( ( volatile unsigned int * ) ( 0x424E2200UL ) )
    #define bFM3_ADC1_SCIS23_AN17                *( ( volatile unsigned int * ) ( 0x424E2204UL ) )
    #define bFM3_ADC1_SCIS23_AN18                *( ( volatile unsigned int * ) ( 0x424E2208UL ) )
    #define bFM3_ADC1_SCIS23_AN19                *( ( volatile unsigned int * ) ( 0x424E220CUL ) )
    #define bFM3_ADC1_SCIS23_AN20                *( ( volatile unsigned int * ) ( 0x424E2210UL ) )
    #define bFM3_ADC1_SCIS23_AN21                *( ( volatile unsigned int * ) ( 0x424E2214UL ) )
    #define bFM3_ADC1_SCIS23_AN22                *( ( volatile unsigned int * ) ( 0x424E2218UL ) )
    #define bFM3_ADC1_SCIS23_AN23                *( ( volatile unsigned int * ) ( 0x424E221CUL ) )
    #define bFM3_ADC1_SCIS23_AN24                *( ( volatile unsigned int * ) ( 0x424E2220UL ) )
    #define bFM3_ADC1_SCIS23_AN25                *( ( volatile unsigned int * ) ( 0x424E2224UL ) )
    #define bFM3_ADC1_SCIS23_AN26                *( ( volatile unsigned int * ) ( 0x424E2228UL ) )
    #define bFM3_ADC1_SCIS23_AN27                *( ( volatile unsigned int * ) ( 0x424E222CUL ) )
    #define bFM3_ADC1_SCIS23_AN28                *( ( volatile unsigned int * ) ( 0x424E2230UL ) )
    #define bFM3_ADC1_SCIS23_AN29                *( ( volatile unsigned int * ) ( 0x424E2234UL ) )
    #define bFM3_ADC1_SCIS23_AN30                *( ( volatile unsigned int * ) ( 0x424E2238UL ) )
    #define bFM3_ADC1_SCIS23_AN31                *( ( volatile unsigned int * ) ( 0x424E223CUL ) )
    #define bFM3_ADC1_SCIS2_AN16                 *( ( volatile unsigned int * ) ( 0x424E2200UL ) )
    #define bFM3_ADC1_SCIS2_AN17                 *( ( volatile unsigned int * ) ( 0x424E2204UL ) )
    #define bFM3_ADC1_SCIS2_AN18                 *( ( volatile unsigned int * ) ( 0x424E2208UL ) )
    #define bFM3_ADC1_SCIS2_AN19                 *( ( volatile unsigned int * ) ( 0x424E220CUL ) )
    #define bFM3_ADC1_SCIS2_AN20                 *( ( volatile unsigned int * ) ( 0x424E2210UL ) )
    #define bFM3_ADC1_SCIS2_AN21                 *( ( volatile unsigned int * ) ( 0x424E2214UL ) )
    #define bFM3_ADC1_SCIS2_AN22                 *( ( volatile unsigned int * ) ( 0x424E2218UL ) )
    #define bFM3_ADC1_SCIS2_AN23                 *( ( volatile unsigned int * ) ( 0x424E221CUL ) )
    #define bFM3_ADC1_SCIS3_AN24                 *( ( volatile unsigned int * ) ( 0x424E2220UL ) )
    #define bFM3_ADC1_SCIS3_AN25                 *( ( volatile unsigned int * ) ( 0x424E2224UL ) )
    #define bFM3_ADC1_SCIS3_AN26                 *( ( volatile unsigned int * ) ( 0x424E2228UL ) )
    #define bFM3_ADC1_SCIS3_AN27                 *( ( volatile unsigned int * ) ( 0x424E222CUL ) )
    #define bFM3_ADC1_SCIS3_AN28                 *( ( volatile unsigned int * ) ( 0x424E2230UL ) )
    #define bFM3_ADC1_SCIS3_AN29                 *( ( volatile unsigned int * ) ( 0x424E2234UL ) )
    #define bFM3_ADC1_SCIS3_AN30                 *( ( volatile unsigned int * ) ( 0x424E2238UL ) )
    #define bFM3_ADC1_SCIS3_AN31                 *( ( volatile unsigned int * ) ( 0x424E223CUL ) )
    #define bFM3_ADC1_SCIS01_AN0                 *( ( volatile unsigned int * ) ( 0x424E2280UL ) )
    #define bFM3_ADC1_SCIS01_AN1                 *( ( volatile unsigned int * ) ( 0x424E2284UL ) )
    #define bFM3_ADC1_SCIS01_AN2                 *( ( volatile unsigned int * ) ( 0x424E2288UL ) )
    #define bFM3_ADC1_SCIS01_AN3                 *( ( volatile unsigned int * ) ( 0x424E228CUL ) )
    #define bFM3_ADC1_SCIS01_AN4                 *( ( volatile unsigned int * ) ( 0x424E2290UL ) )
    #define bFM3_ADC1_SCIS01_AN5                 *( ( volatile unsigned int * ) ( 0x424E2294UL ) )
    #define bFM3_ADC1_SCIS01_AN6                 *( ( volatile unsigned int * ) ( 0x424E2298UL ) )
    #define bFM3_ADC1_SCIS01_AN7                 *( ( volatile unsigned int * ) ( 0x424E229CUL ) )
    #define bFM3_ADC1_SCIS01_AN8                 *( ( volatile unsigned int * ) ( 0x424E22A0UL ) )
    #define bFM3_ADC1_SCIS01_AN9                 *( ( volatile unsigned int * ) ( 0x424E22A4UL ) )
    #define bFM3_ADC1_SCIS01_AN10                *( ( volatile unsigned int * ) ( 0x424E22A8UL ) )
    #define bFM3_ADC1_SCIS01_AN11                *( ( volatile unsigned int * ) ( 0x424E22ACUL ) )
    #define bFM3_ADC1_SCIS01_AN12                *( ( volatile unsigned int * ) ( 0x424E22B0UL ) )
    #define bFM3_ADC1_SCIS01_AN13                *( ( volatile unsigned int * ) ( 0x424E22B4UL ) )
    #define bFM3_ADC1_SCIS01_AN14                *( ( volatile unsigned int * ) ( 0x424E22B8UL ) )
    #define bFM3_ADC1_SCIS01_AN15                *( ( volatile unsigned int * ) ( 0x424E22BCUL ) )
    #define bFM3_ADC1_SCIS0_AN0                  *( ( volatile unsigned int * ) ( 0x424E2280UL ) )
    #define bFM3_ADC1_SCIS0_AN1                  *( ( volatile unsigned int * ) ( 0x424E2284UL ) )
    #define bFM3_ADC1_SCIS0_AN2                  *( ( volatile unsigned int * ) ( 0x424E2288UL ) )
    #define bFM3_ADC1_SCIS0_AN3                  *( ( volatile unsigned int * ) ( 0x424E228CUL ) )
    #define bFM3_ADC1_SCIS0_AN4                  *( ( volatile unsigned int * ) ( 0x424E2290UL ) )
    #define bFM3_ADC1_SCIS0_AN5                  *( ( volatile unsigned int * ) ( 0x424E2294UL ) )
    #define bFM3_ADC1_SCIS0_AN6                  *( ( volatile unsigned int * ) ( 0x424E2298UL ) )
    #define bFM3_ADC1_SCIS0_AN7                  *( ( volatile unsigned int * ) ( 0x424E229CUL ) )
    #define bFM3_ADC1_SCIS1_AN8                  *( ( volatile unsigned int * ) ( 0x424E22A0UL ) )
    #define bFM3_ADC1_SCIS1_AN9                  *( ( volatile unsigned int * ) ( 0x424E22A4UL ) )
    #define bFM3_ADC1_SCIS1_AN10                 *( ( volatile unsigned int * ) ( 0x424E22A8UL ) )
    #define bFM3_ADC1_SCIS1_AN11                 *( ( volatile unsigned int * ) ( 0x424E22ACUL ) )
    #define bFM3_ADC1_SCIS1_AN12                 *( ( volatile unsigned int * ) ( 0x424E22B0UL ) )
    #define bFM3_ADC1_SCIS1_AN13                 *( ( volatile unsigned int * ) ( 0x424E22B4UL ) )
    #define bFM3_ADC1_SCIS1_AN14                 *( ( volatile unsigned int * ) ( 0x424E22B8UL ) )
    #define bFM3_ADC1_SCIS1_AN15                 *( ( volatile unsigned int * ) ( 0x424E22BCUL ) )
    #define bFM3_ADC1_PFNS_PFS0                  *( ( volatile unsigned int * ) ( 0x424E2300UL ) )
    #define bFM3_ADC1_PFNS_PFS1                  *( ( volatile unsigned int * ) ( 0x424E2304UL ) )
    #define bFM3_ADC1_PFNS_TEST0                 *( ( volatile unsigned int * ) ( 0x424E2310UL ) )
    #define bFM3_ADC1_PFNS_TEST1                 *( ( volatile unsigned int * ) ( 0x424E2314UL ) )
    #define bFM3_ADC1_PCCR_PSTR                  *( ( volatile unsigned int * ) ( 0x424E2320UL ) )
    #define bFM3_ADC1_PCCR_PHEN                  *( ( volatile unsigned int * ) ( 0x424E2324UL ) )
    #define bFM3_ADC1_PCCR_PEEN                  *( ( volatile unsigned int * ) ( 0x424E2328UL ) )
    #define bFM3_ADC1_PCCR_ESCE                  *( ( volatile unsigned int * ) ( 0x424E232CUL ) )
    #define bFM3_ADC1_PCCR_PFCLR                 *( ( volatile unsigned int * ) ( 0x424E2330UL ) )
    #define bFM3_ADC1_PCCR_POVR                  *( ( volatile unsigned int * ) ( 0x424E2334UL ) )
    #define bFM3_ADC1_PCCR_PFUL                  *( ( volatile unsigned int * ) ( 0x424E2338UL ) )
    #define bFM3_ADC1_PCCR_PEMP                  *( ( volatile unsigned int * ) ( 0x424E233CUL ) )
    #define bFM3_ADC1_PCFD_PC0                   *( ( volatile unsigned int * ) ( 0x424E2380UL ) )
    #define bFM3_ADC1_PCFD_PC1                   *( ( volatile unsigned int * ) ( 0x424E2384UL ) )
    #define bFM3_ADC1_PCFD_PC2                   *( ( volatile unsigned int * ) ( 0x424E2388UL ) )
    #define bFM3_ADC1_PCFD_PC3                   *( ( volatile unsigned int * ) ( 0x424E238CUL ) )
    #define bFM3_ADC1_PCFD_PC4                   *( ( volatile unsigned int * ) ( 0x424E2390UL ) )
    #define bFM3_ADC1_PCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E23A0UL ) )
    #define bFM3_ADC1_PCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E23A4UL ) )
    #define bFM3_ADC1_PCFD_RS2                   *( ( volatile unsigned int * ) ( 0x424E23A8UL ) )
    #define bFM3_ADC1_PCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E23B0UL ) )
    #define bFM3_ADC1_PCFD_PD0                   *( ( volatile unsigned int * ) ( 0x424E23D0UL ) )
    #define bFM3_ADC1_PCFD_PD1                   *( ( volatile unsigned int * ) ( 0x424E23D4UL ) )
    #define bFM3_ADC1_PCFD_PD2                   *( ( volatile unsigned int * ) ( 0x424E23D8UL ) )
    #define bFM3_ADC1_PCFD_PD3                   *( ( volatile unsigned int * ) ( 0x424E23DCUL ) )
    #define bFM3_ADC1_PCFD_PD4                   *( ( volatile unsigned int * ) ( 0x424E23E0UL ) )
    #define bFM3_ADC1_PCFD_PD5                   *( ( volatile unsigned int * ) ( 0x424E23E4UL ) )
    #define bFM3_ADC1_PCFD_PD6                   *( ( volatile unsigned int * ) ( 0x424E23E8UL ) )
    #define bFM3_ADC1_PCFD_PD7                   *( ( volatile unsigned int * ) ( 0x424E23ECUL ) )
    #define bFM3_ADC1_PCFD_PD8                   *( ( volatile unsigned int * ) ( 0x424E23F0UL ) )
    #define bFM3_ADC1_PCFD_PD9                   *( ( volatile unsigned int * ) ( 0x424E23F4UL ) )
    #define bFM3_ADC1_PCFD_PD10                  *( ( volatile unsigned int * ) ( 0x424E23F8UL ) )
    #define bFM3_ADC1_PCFD_PD11                  *( ( volatile unsigned int * ) ( 0x424E23FCUL ) )
    #define bFM3_ADC1_PCFDL_PC0                  *( ( volatile unsigned int * ) ( 0x424E2380UL ) )
    #define bFM3_ADC1_PCFDL_PC1                  *( ( volatile unsigned int * ) ( 0x424E2384UL ) )
    #define bFM3_ADC1_PCFDL_PC2                  *( ( volatile unsigned int * ) ( 0x424E2388UL ) )
    #define bFM3_ADC1_PCFDL_PC3                  *( ( volatile unsigned int * ) ( 0x424E238CUL ) )
    #define bFM3_ADC1_PCFDL_PC4                  *( ( volatile unsigned int * ) ( 0x424E2390UL ) )
    #define bFM3_ADC1_PCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E23A0UL ) )
    #define bFM3_ADC1_PCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E23A4UL ) )
    #define bFM3_ADC1_PCFDL_RS2                  *( ( volatile unsigned int * ) ( 0x424E23A8UL ) )
    #define bFM3_ADC1_PCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E23B0UL ) )
    #define bFM3_ADC1_PCFDH_PD0                  *( ( volatile unsigned int * ) ( 0x424E23D0UL ) )
    #define bFM3_ADC1_PCFDH_PD1                  *( ( volatile unsigned int * ) ( 0x424E23D4UL ) )
    #define bFM3_ADC1_PCFDH_PD2                  *( ( volatile unsigned int * ) ( 0x424E23D8UL ) )
    #define bFM3_ADC1_PCFDH_PD3                  *( ( volatile unsigned int * ) ( 0x424E23DCUL ) )
    #define bFM3_ADC1_PCFDH_PD4                  *( ( volatile unsigned int * ) ( 0x424E23E0UL ) )
    #define bFM3_ADC1_PCFDH_PD5                  *( ( volatile unsigned int * ) ( 0x424E23E4UL ) )
    #define bFM3_ADC1_PCFDH_PD6                  *( ( volatile unsigned int * ) ( 0x424E23E8UL ) )
    #define bFM3_ADC1_PCFDH_PD7                  *( ( volatile unsigned int * ) ( 0x424E23ECUL ) )
    #define bFM3_ADC1_PCFDH_PD8                  *( ( volatile unsigned int * ) ( 0x424E23F0UL ) )
    #define bFM3_ADC1_PCFDH_PD9                  *( ( volatile unsigned int * ) ( 0x424E23F4UL ) )
    #define bFM3_ADC1_PCFDH_PD10                 *( ( volatile unsigned int * ) ( 0x424E23F8UL ) )
    #define bFM3_ADC1_PCFDH_PD11                 *( ( volatile unsigned int * ) ( 0x424E23FCUL ) )
    #define bFM3_ADC1_PCIS_P1A0                  *( ( volatile unsigned int * ) ( 0x424E2400UL ) )
    #define bFM3_ADC1_PCIS_P1A1                  *( ( volatile unsigned int * ) ( 0x424E2404UL ) )
    #define bFM3_ADC1_PCIS_P1A2                  *( ( volatile unsigned int * ) ( 0x424E2408UL ) )
    #define bFM3_ADC1_PCIS_P2A0                  *( ( volatile unsigned int * ) ( 0x424E240CUL ) )
    #define bFM3_ADC1_PCIS_P2A1                  *( ( volatile unsigned int * ) ( 0x424E2410UL ) )
    #define bFM3_ADC1_PCIS_P2A2                  *( ( volatile unsigned int * ) ( 0x424E2414UL ) )
    #define bFM3_ADC1_PCIS_P2A3                  *( ( volatile unsigned int * ) ( 0x424E2418UL ) )
    #define bFM3_ADC1_PCIS_P2A4                  *( ( volatile unsigned int * ) ( 0x424E241CUL ) )
    #define bFM3_ADC1_CMPCR_CCH0                 *( ( volatile unsigned int * ) ( 0x424E2480UL ) )
    #define bFM3_ADC1_CMPCR_CCH1                 *( ( volatile unsigned int * ) ( 0x424E2484UL ) )
    #define bFM3_ADC1_CMPCR_CCH2                 *( ( volatile unsigned int * ) ( 0x424E2488UL ) )
    #define bFM3_ADC1_CMPCR_CCH3                 *( ( volatile unsigned int * ) ( 0x424E248CUL ) )
    #define bFM3_ADC1_CMPCR_CCH4                 *( ( volatile unsigned int * ) ( 0x424E2490UL ) )
    #define bFM3_ADC1_CMPCR_CMD0                 *( ( volatile unsigned int * ) ( 0x424E2494UL ) )
    #define bFM3_ADC1_CMPCR_CMD1                 *( ( volatile unsigned int * ) ( 0x424E2498UL ) )
    #define bFM3_ADC1_CMPCR_CMPEN                *( ( volatile unsigned int * ) ( 0x424E249CUL ) )
    #define bFM3_ADC1_CMPD_CMAD2                 *( ( volatile unsigned int * ) ( 0x424E24D8UL ) )
    #define bFM3_ADC1_CMPD_CMAD3                 *( ( volatile unsigned int * ) ( 0x424E24DCUL ) )
    #define bFM3_ADC1_CMPD_CMAD4                 *( ( volatile unsigned int * ) ( 0x424E24E0UL ) )
    #define bFM3_ADC1_CMPD_CMAD5                 *( ( volatile unsigned int * ) ( 0x424E24E4UL ) )
    #define bFM3_ADC1_CMPD_CMAD6                 *( ( volatile unsigned int * ) ( 0x424E24E8UL ) )
    #define bFM3_ADC1_CMPD_CMAD7                 *( ( volatile unsigned int * ) ( 0x424E24ECUL ) )
    #define bFM3_ADC1_CMPD_CMAD8                 *( ( volatile unsigned int * ) ( 0x424E24F0UL ) )
    #define bFM3_ADC1_CMPD_CMAD9                 *( ( volatile unsigned int * ) ( 0x424E24F4UL ) )
    #define bFM3_ADC1_CMPD_CMAD10                *( ( volatile unsigned int * ) ( 0x424E24F8UL ) )
    #define bFM3_ADC1_CMPD_CMAD11                *( ( volatile unsigned int * ) ( 0x424E24FCUL ) )
    #define bFM3_ADC1_ADSS23_TS16                *( ( volatile unsigned int * ) ( 0x424E2500UL ) )
    #define bFM3_ADC1_ADSS23_TS17                *( ( volatile unsigned int * ) ( 0x424E2504UL ) )
    #define bFM3_ADC1_ADSS23_TS18                *( ( volatile unsigned int * ) ( 0x424E2508UL ) )
    #define bFM3_ADC1_ADSS23_TS19                *( ( volatile unsigned int * ) ( 0x424E250CUL ) )
    #define bFM3_ADC1_ADSS23_TS20                *( ( volatile unsigned int * ) ( 0x424E2510UL ) )
    #define bFM3_ADC1_ADSS23_TS21                *( ( volatile unsigned int * ) ( 0x424E2514UL ) )
    #define bFM3_ADC1_ADSS23_TS22                *( ( volatile unsigned int * ) ( 0x424E2518UL ) )
    #define bFM3_ADC1_ADSS23_TS23                *( ( volatile unsigned int * ) ( 0x424E251CUL ) )
    #define bFM3_ADC1_ADSS23_TS24                *( ( volatile unsigned int * ) ( 0x424E2520UL ) )
    #define bFM3_ADC1_ADSS23_TS25                *( ( volatile unsigned int * ) ( 0x424E2524UL ) )
    #define bFM3_ADC1_ADSS23_TS26                *( ( volatile unsigned int * ) ( 0x424E2528UL ) )
    #define bFM3_ADC1_ADSS23_TS27                *( ( volatile unsigned int * ) ( 0x424E252CUL ) )
    #define bFM3_ADC1_ADSS23_TS28                *( ( volatile unsigned int * ) ( 0x424E2530UL ) )
    #define bFM3_ADC1_ADSS23_TS29                *( ( volatile unsigned int * ) ( 0x424E2534UL ) )
    #define bFM3_ADC1_ADSS23_TS30                *( ( volatile unsigned int * ) ( 0x424E2538UL ) )
    #define bFM3_ADC1_ADSS23_TS31                *( ( volatile unsigned int * ) ( 0x424E253CUL ) )
    #define bFM3_ADC1_ADSS2_TS16                 *( ( volatile unsigned int * ) ( 0x424E2500UL ) )
    #define bFM3_ADC1_ADSS2_TS17                 *( ( volatile unsigned int * ) ( 0x424E2504UL ) )
    #define bFM3_ADC1_ADSS2_TS18                 *( ( volatile unsigned int * ) ( 0x424E2508UL ) )
    #define bFM3_ADC1_ADSS2_TS19                 *( ( volatile unsigned int * ) ( 0x424E250CUL ) )
    #define bFM3_ADC1_ADSS2_TS20                 *( ( volatile unsigned int * ) ( 0x424E2510UL ) )
    #define bFM3_ADC1_ADSS2_TS21                 *( ( volatile unsigned int * ) ( 0x424E2514UL ) )
    #define bFM3_ADC1_ADSS2_TS22                 *( ( volatile unsigned int * ) ( 0x424E2518UL ) )
    #define bFM3_ADC1_ADSS2_TS23                 *( ( volatile unsigned int * ) ( 0x424E251CUL ) )
    #define bFM3_ADC1_ADSS3_TS24                 *( ( volatile unsigned int * ) ( 0x424E2520UL ) )
    #define bFM3_ADC1_ADSS3_TS25                 *( ( volatile unsigned int * ) ( 0x424E2524UL ) )
    #define bFM3_ADC1_ADSS3_TS26                 *( ( volatile unsigned int * ) ( 0x424E2528UL ) )
    #define bFM3_ADC1_ADSS3_TS27                 *( ( volatile unsigned int * ) ( 0x424E252CUL ) )
    #define bFM3_ADC1_ADSS3_TS28                 *( ( volatile unsigned int * ) ( 0x424E2530UL ) )
    #define bFM3_ADC1_ADSS3_TS29                 *( ( volatile unsigned int * ) ( 0x424E2534UL ) )
    #define bFM3_ADC1_ADSS3_TS30                 *( ( volatile unsigned int * ) ( 0x424E2538UL ) )
    #define bFM3_ADC1_ADSS3_TS31                 *( ( volatile unsigned int * ) ( 0x424E253CUL ) )
    #define bFM3_ADC1_ADSS01_TS0                 *( ( volatile unsigned int * ) ( 0x424E2580UL ) )
    #define bFM3_ADC1_ADSS01_TS1                 *( ( volatile unsigned int * ) ( 0x424E2584UL ) )
    #define bFM3_ADC1_ADSS01_TS2                 *( ( volatile unsigned int * ) ( 0x424E2588UL ) )
