FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_ADC1_ADSS01_TS3                 *( ( volatile unsigned int * ) ( 0x424E258CUL ) )
    #define bFM3_ADC1_ADSS01_TS4                 *( ( volatile unsigned int * ) ( 0x424E2590UL ) )
    #define bFM3_ADC1_ADSS01_TS5                 *( ( volatile unsigned int * ) ( 0x424E2594UL ) )
    #define bFM3_ADC1_ADSS01_TS6                 *( ( volatile unsigned int * ) ( 0x424E2598UL ) )
    #define bFM3_ADC1_ADSS01_TS7                 *( ( volatile unsigned int * ) ( 0x424E259CUL ) )
    #define bFM3_ADC1_ADSS01_TS8                 *( ( volatile unsigned int * ) ( 0x424E25A0UL ) )
    #define bFM3_ADC1_ADSS01_TS9                 *( ( volatile unsigned int * ) ( 0x424E25A4UL ) )
    #define bFM3_ADC1_ADSS01_TS10                *( ( volatile unsigned int * ) ( 0x424E25A8UL ) )
    #define bFM3_ADC1_ADSS01_TS11                *( ( volatile unsigned int * ) ( 0x424E25ACUL ) )
    #define bFM3_ADC1_ADSS01_TS12                *( ( volatile unsigned int * ) ( 0x424E25B0UL ) )
    #define bFM3_ADC1_ADSS01_TS13                *( ( volatile unsigned int * ) ( 0x424E25B4UL ) )
    #define bFM3_ADC1_ADSS01_TS14                *( ( volatile unsigned int * ) ( 0x424E25B8UL ) )
    #define bFM3_ADC1_ADSS01_TS15                *( ( volatile unsigned int * ) ( 0x424E25BCUL ) )
    #define bFM3_ADC1_ADSS0_TS0                  *( ( volatile unsigned int * ) ( 0x424E2580UL ) )
    #define bFM3_ADC1_ADSS0_TS1                  *( ( volatile unsigned int * ) ( 0x424E2584UL ) )
    #define bFM3_ADC1_ADSS0_TS2                  *( ( volatile unsigned int * ) ( 0x424E2588UL ) )
    #define bFM3_ADC1_ADSS0_TS3                  *( ( volatile unsigned int * ) ( 0x424E258CUL ) )
    #define bFM3_ADC1_ADSS0_TS4                  *( ( volatile unsigned int * ) ( 0x424E2590UL ) )
    #define bFM3_ADC1_ADSS0_TS5                  *( ( volatile unsigned int * ) ( 0x424E2594UL ) )
    #define bFM3_ADC1_ADSS0_TS6                  *( ( volatile unsigned int * ) ( 0x424E2598UL ) )
    #define bFM3_ADC1_ADSS0_TS7                  *( ( volatile unsigned int * ) ( 0x424E259CUL ) )
    #define bFM3_ADC1_ADSS1_TS8                  *( ( volatile unsigned int * ) ( 0x424E25A0UL ) )
    #define bFM3_ADC1_ADSS1_TS9                  *( ( volatile unsigned int * ) ( 0x424E25A4UL ) )
    #define bFM3_ADC1_ADSS1_TS10                 *( ( volatile unsigned int * ) ( 0x424E25A8UL ) )
    #define bFM3_ADC1_ADSS1_TS11                 *( ( volatile unsigned int * ) ( 0x424E25ACUL ) )
    #define bFM3_ADC1_ADSS1_TS12                 *( ( volatile unsigned int * ) ( 0x424E25B0UL ) )
    #define bFM3_ADC1_ADSS1_TS13                 *( ( volatile unsigned int * ) ( 0x424E25B4UL ) )
    #define bFM3_ADC1_ADSS1_TS14                 *( ( volatile unsigned int * ) ( 0x424E25B8UL ) )
    #define bFM3_ADC1_ADSS1_TS15                 *( ( volatile unsigned int * ) ( 0x424E25BCUL ) )
    #define bFM3_ADC1_ADST01_ST10                *( ( volatile unsigned int * ) ( 0x424E2600UL ) )
    #define bFM3_ADC1_ADST01_ST11                *( ( volatile unsigned int * ) ( 0x424E2604UL ) )
    #define bFM3_ADC1_ADST01_ST12                *( ( volatile unsigned int * ) ( 0x424E2608UL ) )
    #define bFM3_ADC1_ADST01_ST13                *( ( volatile unsigned int * ) ( 0x424E260CUL ) )
    #define bFM3_ADC1_ADST01_ST14                *( ( volatile unsigned int * ) ( 0x424E2610UL ) )
    #define bFM3_ADC1_ADST01_STX10               *( ( volatile unsigned int * ) ( 0x424E2614UL ) )
    #define bFM3_ADC1_ADST01_STX11               *( ( volatile unsigned int * ) ( 0x424E2618UL ) )
    #define bFM3_ADC1_ADST01_STX12               *( ( volatile unsigned int * ) ( 0x424E261CUL ) )
    #define bFM3_ADC1_ADST01_ST00                *( ( volatile unsigned int * ) ( 0x424E2620UL ) )
    #define bFM3_ADC1_ADST01_ST01                *( ( volatile unsigned int * ) ( 0x424E2624UL ) )
    #define bFM3_ADC1_ADST01_ST02                *( ( volatile unsigned int * ) ( 0x424E2628UL ) )
    #define bFM3_ADC1_ADST01_ST03                *( ( volatile unsigned int * ) ( 0x424E262CUL ) )
    #define bFM3_ADC1_ADST01_ST04                *( ( volatile unsigned int * ) ( 0x424E2630UL ) )
    #define bFM3_ADC1_ADST01_STX00               *( ( volatile unsigned int * ) ( 0x424E2634UL ) )
    #define bFM3_ADC1_ADST01_STX01               *( ( volatile unsigned int * ) ( 0x424E2638UL ) )
    #define bFM3_ADC1_ADST01_STX02               *( ( volatile unsigned int * ) ( 0x424E263CUL ) )
    #define bFM3_ADC1_ADST1_ST10                 *( ( volatile unsigned int * ) ( 0x424E2600UL ) )
    #define bFM3_ADC1_ADST1_ST11                 *( ( volatile unsigned int * ) ( 0x424E2604UL ) )
    #define bFM3_ADC1_ADST1_ST12                 *( ( volatile unsigned int * ) ( 0x424E2608UL ) )
    #define bFM3_ADC1_ADST1_ST13                 *( ( volatile unsigned int * ) ( 0x424E260CUL ) )
    #define bFM3_ADC1_ADST1_ST14                 *( ( volatile unsigned int * ) ( 0x424E2610UL ) )
    #define bFM3_ADC1_ADST1_STX10                *( ( volatile unsigned int * ) ( 0x424E2614UL ) )
    #define bFM3_ADC1_ADST1_STX11                *( ( volatile unsigned int * ) ( 0x424E2618UL ) )
    #define bFM3_ADC1_ADST1_STX12                *( ( volatile unsigned int * ) ( 0x424E261CUL ) )
    #define bFM3_ADC1_ADST0_ST00                 *( ( volatile unsigned int * ) ( 0x424E2620UL ) )
    #define bFM3_ADC1_ADST0_ST01                 *( ( volatile unsigned int * ) ( 0x424E2624UL ) )
    #define bFM3_ADC1_ADST0_ST02                 *( ( volatile unsigned int * ) ( 0x424E2628UL ) )
    #define bFM3_ADC1_ADST0_ST03                 *( ( volatile unsigned int * ) ( 0x424E262CUL ) )
    #define bFM3_ADC1_ADST0_ST04                 *( ( volatile unsigned int * ) ( 0x424E2630UL ) )
    #define bFM3_ADC1_ADST0_STX00                *( ( volatile unsigned int * ) ( 0x424E2634UL ) )
    #define bFM3_ADC1_ADST0_STX01                *( ( volatile unsigned int * ) ( 0x424E2638UL ) )
    #define bFM3_ADC1_ADST0_STX02                *( ( volatile unsigned int * ) ( 0x424E263CUL ) )
    #define bFM3_ADC1_ADCT_CT0                   *( ( volatile unsigned int * ) ( 0x424E2680UL ) )
    #define bFM3_ADC1_ADCT_CT1                   *( ( volatile unsigned int * ) ( 0x424E2684UL ) )
    #define bFM3_ADC1_ADCT_CT2                   *( ( volatile unsigned int * ) ( 0x424E2688UL ) )
    #define bFM3_ADC1_PRTSL_PRTSL0               *( ( volatile unsigned int * ) ( 0x424E2700UL ) )
    #define bFM3_ADC1_PRTSL_PRTSL1               *( ( volatile unsigned int * ) ( 0x424E2704UL ) )
    #define bFM3_ADC1_PRTSL_PRTSL2               *( ( volatile unsigned int * ) ( 0x424E2708UL ) )
    #define bFM3_ADC1_PRTSL_PRTSL3               *( ( volatile unsigned int * ) ( 0x424E270CUL ) )
    #define bFM3_ADC1_SCTSL_SCTSL0               *( ( volatile unsigned int * ) ( 0x424E2720UL ) )
    #define bFM3_ADC1_SCTSL_SCTSL1               *( ( volatile unsigned int * ) ( 0x424E2724UL ) )
    #define bFM3_ADC1_SCTSL_SCTSL2               *( ( volatile unsigned int * ) ( 0x424E2728UL ) )
    #define bFM3_ADC1_SCTSL_SCTSL3               *( ( volatile unsigned int * ) ( 0x424E272CUL ) )
    #define bFM3_ADC1_ADCEN_ENBL                 *( ( volatile unsigned int * ) ( 0x424E2780UL ) )
    #define bFM3_ADC1_ADCEN_READY                *( ( volatile unsigned int * ) ( 0x424E2784UL ) )

