FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* 12-bit ADC unit 2 registers */
    #define bFM3_ADC2_ADSR_SCS                   *( ( volatile unsigned int * ) ( 0x424E4000UL ) )
    #define bFM3_ADC2_ADSR_PCS                   *( ( volatile unsigned int * ) ( 0x424E4004UL ) )
    #define bFM3_ADC2_ADSR_PCNS                  *( ( volatile unsigned int * ) ( 0x424E4008UL ) )
    #define bFM3_ADC2_ADSR_FDAS                  *( ( volatile unsigned int * ) ( 0x424E4018UL ) )
    #define bFM3_ADC2_ADSR_ADSTP                 *( ( volatile unsigned int * ) ( 0x424E401CUL ) )
    #define bFM3_ADC2_ADCR_OVRIE                 *( ( volatile unsigned int * ) ( 0x424E4020UL ) )
    #define bFM3_ADC2_ADCR_CMPIE                 *( ( volatile unsigned int * ) ( 0x424E4024UL ) )
    #define bFM3_ADC2_ADCR_PCIE                  *( ( volatile unsigned int * ) ( 0x424E4028UL ) )
    #define bFM3_ADC2_ADCR_SCIE                  *( ( volatile unsigned int * ) ( 0x424E402CUL ) )
    #define bFM3_ADC2_ADCR_CMPIF                 *( ( volatile unsigned int * ) ( 0x424E4034UL ) )
    #define bFM3_ADC2_ADCR_PCIF                  *( ( volatile unsigned int * ) ( 0x424E4038UL ) )
    #define bFM3_ADC2_ADCR_SCIF                  *( ( volatile unsigned int * ) ( 0x424E403CUL ) )
    #define bFM3_ADC2_SFNS_SFS0                  *( ( volatile unsigned int * ) ( 0x424E4100UL ) )
    #define bFM3_ADC2_SFNS_SFS1                  *( ( volatile unsigned int * ) ( 0x424E4104UL ) )
    #define bFM3_ADC2_SFNS_SFS2                  *( ( volatile unsigned int * ) ( 0x424E4108UL ) )
    #define bFM3_ADC2_SFNS_SFS3                  *( ( volatile unsigned int * ) ( 0x424E410CUL ) )
    #define bFM3_ADC2_SCCR_SSTR                  *( ( volatile unsigned int * ) ( 0x424E4120UL ) )
    #define bFM3_ADC2_SCCR_SHEN                  *( ( volatile unsigned int * ) ( 0x424E4124UL ) )
    #define bFM3_ADC2_SCCR_RPT                   *( ( volatile unsigned int * ) ( 0x424E4128UL ) )
    #define bFM3_ADC2_SCCR_SFCLR                 *( ( volatile unsigned int * ) ( 0x424E4130UL ) )
    #define bFM3_ADC2_SCCR_SOVR                  *( ( volatile unsigned int * ) ( 0x424E4134UL ) )
    #define bFM3_ADC2_SCCR_SFUL                  *( ( volatile unsigned int * ) ( 0x424E4138UL ) )
    #define bFM3_ADC2_SCCR_SEMP                  *( ( volatile unsigned int * ) ( 0x424E413CUL ) )
    #define bFM3_ADC2_SCFD_SC0                   *( ( volatile unsigned int * ) ( 0x424E4180UL ) )
    #define bFM3_ADC2_SCFD_SC1                   *( ( volatile unsigned int * ) ( 0x424E4184UL ) )
    #define bFM3_ADC2_SCFD_SC2                   *( ( volatile unsigned int * ) ( 0x424E4188UL ) )
    #define bFM3_ADC2_SCFD_SC3                   *( ( volatile unsigned int * ) ( 0x424E418CUL ) )
    #define bFM3_ADC2_SCFD_SC4                   *( ( volatile unsigned int * ) ( 0x424E4190UL ) )
    #define bFM3_ADC2_SCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E41A0UL ) )
    #define bFM3_ADC2_SCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E41A4UL ) )
    #define bFM3_ADC2_SCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E41B0UL ) )
    #define bFM3_ADC2_SCFD_SD0                   *( ( volatile unsigned int * ) ( 0x424E41D0UL ) )
    #define bFM3_ADC2_SCFD_SD1                   *( ( volatile unsigned int * ) ( 0x424E41D4UL ) )
    #define bFM3_ADC2_SCFD_SD2                   *( ( volatile unsigned int * ) ( 0x424E41D8UL ) )
    #define bFM3_ADC2_SCFD_SD3                   *( ( volatile unsigned int * ) ( 0x424E41DCUL ) )
    #define bFM3_ADC2_SCFD_SD4                   *( ( volatile unsigned int * ) ( 0x424E41E0UL ) )
    #define bFM3_ADC2_SCFD_SD5                   *( ( volatile unsigned int * ) ( 0x424E41E4UL ) )
    #define bFM3_ADC2_SCFD_SD6                   *( ( volatile unsigned int * ) ( 0x424E41E8UL ) )
    #define bFM3_ADC2_SCFD_SD7                   *( ( volatile unsigned int * ) ( 0x424E41ECUL ) )
    #define bFM3_ADC2_SCFD_SD8                   *( ( volatile unsigned int * ) ( 0x424E41F0UL ) )
    #define bFM3_ADC2_SCFD_SD9                   *( ( volatile unsigned int * ) ( 0x424E41F4UL ) )
    #define bFM3_ADC2_SCFD_SD10                  *( ( volatile unsigned int * ) ( 0x424E41F8UL ) )
    #define bFM3_ADC2_SCFD_SD11                  *( ( volatile unsigned int * ) ( 0x424E41FCUL ) )
    #define bFM3_ADC2_SCFDL_SC0                  *( ( volatile unsigned int * ) ( 0x424E4180UL ) )
    #define bFM3_ADC2_SCFDL_SC1                  *( ( volatile unsigned int * ) ( 0x424E4184UL ) )
    #define bFM3_ADC2_SCFDL_SC2                  *( ( volatile unsigned int * ) ( 0x424E4188UL ) )
    #define bFM3_ADC2_SCFDL_SC3                  *( ( volatile unsigned int * ) ( 0x424E418CUL ) )
    #define bFM3_ADC2_SCFDL_SC4                  *( ( volatile unsigned int * ) ( 0x424E4190UL ) )
    #define bFM3_ADC2_SCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E41A0UL ) )
    #define bFM3_ADC2_SCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E41A4UL ) )
    #define bFM3_ADC2_SCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E41B0UL ) )
    #define bFM3_ADC2_SCFDH_SD0                  *( ( volatile unsigned int * ) ( 0x424E41D0UL ) )
    #define bFM3_ADC2_SCFDH_SD1                  *( ( volatile unsigned int * ) ( 0x424E41D4UL ) )
    #define bFM3_ADC2_SCFDH_SD2                  *( ( volatile unsigned int * ) ( 0x424E41D8UL ) )
    #define bFM3_ADC2_SCFDH_SD3                  *( ( volatile unsigned int * ) ( 0x424E41DCUL ) )
    #define bFM3_ADC2_SCFDH_SD4                  *( ( volatile unsigned int * ) ( 0x424E41E0UL ) )
    #define bFM3_ADC2_SCFDH_SD5                  *( ( volatile unsigned int * ) ( 0x424E41E4UL ) )
    #define bFM3_ADC2_SCFDH_SD6                  *( ( volatile unsigned int * ) ( 0x424E41E8UL ) )
    #define bFM3_ADC2_SCFDH_SD7                  *( ( volatile unsigned int * ) ( 0x424E41ECUL ) )
    #define bFM3_ADC2_SCFDH_SD8                  *( ( volatile unsigned int * ) ( 0x424E41F0UL ) )
    #define bFM3_ADC2_SCFDH_SD9                  *( ( volatile unsigned int * ) ( 0x424E41F4UL ) )
    #define bFM3_ADC2_SCFDH_SD10                 *( ( volatile unsigned int * ) ( 0x424E41F8UL ) )
    #define bFM3_ADC2_SCFDH_SD11                 *( ( volatile unsigned int * ) ( 0x424E41FCUL ) )
    #define bFM3_ADC2_SCIS23_AN16                *( ( volatile unsigned int * ) ( 0x424E4200UL ) )
    #define bFM3_ADC2_SCIS23_AN17                *( ( volatile unsigned int * ) ( 0x424E4204UL ) )
    #define bFM3_ADC2_SCIS23_AN18                *( ( volatile unsigned int * ) ( 0x424E4208UL ) )
    #define bFM3_ADC2_SCIS23_AN19                *( ( volatile unsigned int * ) ( 0x424E420CUL ) )
    #define bFM3_ADC2_SCIS23_AN20                *( ( volatile unsigned int * ) ( 0x424E4210UL ) )
    #define bFM3_ADC2_SCIS23_AN21                *( ( volatile unsigned int * ) ( 0x424E4214UL ) )
    #define bFM3_ADC2_SCIS23_AN22                *( ( volatile unsigned int * ) ( 0x424E4218UL ) )
    #define bFM3_ADC2_SCIS23_AN23                *( ( volatile unsigned int * ) ( 0x424E421CUL ) )
    #define bFM3_ADC2_SCIS23_AN24                *( ( volatile unsigned int * ) ( 0x424E4220UL ) )
    #define bFM3_ADC2_SCIS23_AN25                *( ( volatile unsigned int * ) ( 0x424E4224UL ) )
    #define bFM3_ADC2_SCIS23_AN26                *( ( volatile unsigned int * ) ( 0x424E4228UL ) )
    #define bFM3_ADC2_SCIS23_AN27                *( ( volatile unsigned int * ) ( 0x424E422CUL ) )
    #define bFM3_ADC2_SCIS23_AN28                *( ( volatile unsigned int * ) ( 0x424E4230UL ) )
    #define bFM3_ADC2_SCIS23_AN29                *( ( volatile unsigned int * ) ( 0x424E4234UL ) )
    #define bFM3_ADC2_SCIS23_AN30                *( ( volatile unsigned int * ) ( 0x424E4238UL ) )
    #define bFM3_ADC2_SCIS23_AN31                *( ( volatile unsigned int * ) ( 0x424E423CUL ) )
    #define bFM3_ADC2_SCIS2_AN16                 *( ( volatile unsigned int * ) ( 0x424E4200UL ) )
    #define bFM3_ADC2_SCIS2_AN17                 *( ( volatile unsigned int * ) ( 0x424E4204UL ) )
    #define bFM3_ADC2_SCIS2_AN18                 *( ( volatile unsigned int * ) ( 0x424E4208UL ) )
    #define bFM3_ADC2_SCIS2_AN19                 *( ( volatile unsigned int * ) ( 0x424E420CUL ) )
    #define bFM3_ADC2_SCIS2_AN20                 *( ( volatile unsigned int * ) ( 0x424E4210UL ) )
    #define bFM3_ADC2_SCIS2_AN21                 *( ( volatile unsigned int * ) ( 0x424E4214UL ) )
    #define bFM3_ADC2_SCIS2_AN22                 *( ( volatile unsigned int * ) ( 0x424E4218UL ) )
    #define bFM3_ADC2_SCIS2_AN23                 *( ( volatile unsigned int * ) ( 0x424E421CUL ) )
    #define bFM3_ADC2_SCIS3_AN24                 *( ( volatile unsigned int * ) ( 0x424E4220UL ) )
    #define bFM3_ADC2_SCIS3_AN25                 *( ( volatile unsigned int * ) ( 0x424E4224UL ) )
    #define bFM3_ADC2_SCIS3_AN26                 *( ( volatile unsigned int * ) ( 0x424E4228UL ) )
    #define bFM3_ADC2_SCIS3_AN27                 *( ( volatile unsigned int * ) ( 0x424E422CUL ) )
    #define bFM3_ADC2_SCIS3_AN28                 *( ( volatile unsigned int * ) ( 0x424E4230UL ) )
    #define bFM3_ADC2_SCIS3_AN29                 *( ( volatile unsigned int * ) ( 0x424E4234UL ) )
    #define bFM3_ADC2_SCIS3_AN30                 *( ( volatile unsigned int * ) ( 0x424E4238UL ) )
    #define bFM3_ADC2_SCIS3_AN31                 *( ( volatile unsigned int * ) ( 0x424E423CUL ) )
    #define bFM3_ADC2_SCIS01_AN0                 *( ( volatile unsigned int * ) ( 0x424E4280UL ) )
    #define bFM3_ADC2_SCIS01_AN1                 *( ( volatile unsigned int * ) ( 0x424E4284UL ) )
    #define bFM3_ADC2_SCIS01_AN2                 *( ( volatile unsigned int * ) ( 0x424E4288UL ) )
    #define bFM3_ADC2_SCIS01_AN3                 *( ( volatile unsigned int * ) ( 0x424E428CUL ) )
    #define bFM3_ADC2_SCIS01_AN4                 *( ( volatile unsigned int * ) ( 0x424E4290UL ) )
    #define bFM3_ADC2_SCIS01_AN5                 *( ( volatile unsigned int * ) ( 0x424E4294UL ) )
    #define bFM3_ADC2_SCIS01_AN6                 *( ( volatile unsigned int * ) ( 0x424E4298UL ) )
    #define bFM3_ADC2_SCIS01_AN7                 *( ( volatile unsigned int * ) ( 0x424E429CUL ) )
    #define bFM3_ADC2_SCIS01_AN8                 *( ( volatile unsigned int * ) ( 0x424E42A0UL ) )
    #define bFM3_ADC2_SCIS01_AN9                 *( ( volatile unsigned int * ) ( 0x424E42A4UL ) )
    #define bFM3_ADC2_SCIS01_AN10                *( ( volatile unsigned int * ) ( 0x424E42A8UL ) )
    #define bFM3_ADC2_SCIS01_AN11                *( ( volatile unsigned int * ) ( 0x424E42ACUL ) )
    #define bFM3_ADC2_SCIS01_AN12                *( ( volatile unsigned int * ) ( 0x424E42B0UL ) )
    #define bFM3_ADC2_SCIS01_AN13                *( ( volatile unsigned int * ) ( 0x424E42B4UL ) )
    #define bFM3_ADC2_SCIS01_AN14                *( ( volatile unsigned int * ) ( 0x424E42B8UL ) )
    #define bFM3_ADC2_SCIS01_AN15                *( ( volatile unsigned int * ) ( 0x424E42BCUL ) )
    #define bFM3_ADC2_SCIS0_AN0                  *( ( volatile unsigned int * ) ( 0x424E4280UL ) )
    #define bFM3_ADC2_SCIS0_AN1                  *( ( volatile unsigned int * ) ( 0x424E4284UL ) )
    #define bFM3_ADC2_SCIS0_AN2                  *( ( volatile unsigned int * ) ( 0x424E4288UL ) )
    #define bFM3_ADC2_SCIS0_AN3                  *( ( volatile unsigned int * ) ( 0x424E428CUL ) )
    #define bFM3_ADC2_SCIS0_AN4                  *( ( volatile unsigned int * ) ( 0x424E4290UL ) )
    #define bFM3_ADC2_SCIS0_AN5                  *( ( volatile unsigned int * ) ( 0x424E4294UL ) )
    #define bFM3_ADC2_SCIS0_AN6                  *( ( volatile unsigned int * ) ( 0x424E4298UL ) )
    #define bFM3_ADC2_SCIS0_AN7                  *( ( volatile unsigned int * ) ( 0x424E429CUL ) )
    #define bFM3_ADC2_SCIS1_AN8                  *( ( volatile unsigned int * ) ( 0x424E42A0UL ) )
    #define bFM3_ADC2_SCIS1_AN9                  *( ( volatile unsigned int * ) ( 0x424E42A4UL ) )
    #define bFM3_ADC2_SCIS1_AN10                 *( ( volatile unsigned int * ) ( 0x424E42A8UL ) )
    #define bFM3_ADC2_SCIS1_AN11                 *( ( volatile unsigned int * ) ( 0x424E42ACUL ) )
    #define bFM3_ADC2_SCIS1_AN12                 *( ( volatile unsigned int * ) ( 0x424E42B0UL ) )
    #define bFM3_ADC2_SCIS1_AN13                 *( ( volatile unsigned int * ) ( 0x424E42B4UL ) )
    #define bFM3_ADC2_SCIS1_AN14                 *( ( volatile unsigned int * ) ( 0x424E42B8UL ) )
    #define bFM3_ADC2_SCIS1_AN15                 *( ( volatile unsigned int * ) ( 0x424E42BCUL ) )
    #define bFM3_ADC2_PFNS_PFS0                  *( ( volatile unsigned int * ) ( 0x424E4300UL ) )
    #define bFM3_ADC2_PFNS_PFS1                  *( ( volatile unsigned int * ) ( 0x424E4304UL ) )
    #define bFM3_ADC2_PFNS_TEST0                 *( ( volatile unsigned int * ) ( 0x424E4310UL ) )
    #define bFM3_ADC2_PFNS_TEST1                 *( ( volatile unsigned int * ) ( 0x424E4314UL ) )
    #define bFM3_ADC2_PCCR_PSTR                  *( ( volatile unsigned int * ) ( 0x424E4320UL ) )
    #define bFM3_ADC2_PCCR_PHEN                  *( ( volatile unsigned int * ) ( 0x424E4324UL ) )
    #define bFM3_ADC2_PCCR_PEEN                  *( ( volatile unsigned int * ) ( 0x424E4328UL ) )
    #define bFM3_ADC2_PCCR_ESCE                  *( ( volatile unsigned int * ) ( 0x424E432CUL ) )
    #define bFM3_ADC2_PCCR_PFCLR                 *( ( volatile unsigned int * ) ( 0x424E4330UL ) )
    #define bFM3_ADC2_PCCR_POVR                  *( ( volatile unsigned int * ) ( 0x424E4334UL ) )
    #define bFM3_ADC2_PCCR_PFUL                  *( ( volatile unsigned int * ) ( 0x424E4338UL ) )
    #define bFM3_ADC2_PCCR_PEMP                  *( ( volatile unsigned int * ) ( 0x424E433CUL ) )
    #define bFM3_ADC2_PCFD_PC0                   *( ( volatile unsigned int * ) ( 0x424E4380UL ) )
    #define bFM3_ADC2_PCFD_PC1                   *( ( volatile unsigned int * ) ( 0x424E4384UL ) )
    #define bFM3_ADC2_PCFD_PC2                   *( ( volatile unsigned int * ) ( 0x424E4388UL ) )
    #define bFM3_ADC2_PCFD_PC3                   *( ( volatile unsigned int * ) ( 0x424E438CUL ) )
    #define bFM3_ADC2_PCFD_PC4                   *( ( volatile unsigned int * ) ( 0x424E4390UL ) )
    #define bFM3_ADC2_PCFD_RS0                   *( ( volatile unsigned int * ) ( 0x424E43A0UL ) )
    #define bFM3_ADC2_PCFD_RS1                   *( ( volatile unsigned int * ) ( 0x424E43A4UL ) )
    #define bFM3_ADC2_PCFD_RS2                   *( ( volatile unsigned int * ) ( 0x424E43A8UL ) )
    #define bFM3_ADC2_PCFD_INVL                  *( ( volatile unsigned int * ) ( 0x424E43B0UL ) )
    #define bFM3_ADC2_PCFD_PD0                   *( ( volatile unsigned int * ) ( 0x424E43D0UL ) )
    #define bFM3_ADC2_PCFD_PD1                   *( ( volatile unsigned int * ) ( 0x424E43D4UL ) )
    #define bFM3_ADC2_PCFD_PD2                   *( ( volatile unsigned int * ) ( 0x424E43D8UL ) )
    #define bFM3_ADC2_PCFD_PD3                   *( ( volatile unsigned int * ) ( 0x424E43DCUL ) )
    #define bFM3_ADC2_PCFD_PD4                   *( ( volatile unsigned int * ) ( 0x424E43E0UL ) )
    #define bFM3_ADC2_PCFD_PD5                   *( ( volatile unsigned int * ) ( 0x424E43E4UL ) )
    #define bFM3_ADC2_PCFD_PD6                   *( ( volatile unsigned int * ) ( 0x424E43E8UL ) )
    #define bFM3_ADC2_PCFD_PD7                   *( ( volatile unsigned int * ) ( 0x424E43ECUL ) )
    #define bFM3_ADC2_PCFD_PD8                   *( ( volatile unsigned int * ) ( 0x424E43F0UL ) )
    #define bFM3_ADC2_PCFD_PD9                   *( ( volatile unsigned int * ) ( 0x424E43F4UL ) )
    #define bFM3_ADC2_PCFD_PD10                  *( ( volatile unsigned int * ) ( 0x424E43F8UL ) )
    #define bFM3_ADC2_PCFD_PD11                  *( ( volatile unsigned int * ) ( 0x424E43FCUL ) )
    #define bFM3_ADC2_PCFDL_PC0                  *( ( volatile unsigned int * ) ( 0x424E4380UL ) )
    #define bFM3_ADC2_PCFDL_PC1                  *( ( volatile unsigned int * ) ( 0x424E4384UL ) )
    #define bFM3_ADC2_PCFDL_PC2                  *( ( volatile unsigned int * ) ( 0x424E4388UL ) )
    #define bFM3_ADC2_PCFDL_PC3                  *( ( volatile unsigned int * ) ( 0x424E438CUL ) )
    #define bFM3_ADC2_PCFDL_PC4                  *( ( volatile unsigned int * ) ( 0x424E4390UL ) )
    #define bFM3_ADC2_PCFDL_RS0                  *( ( volatile unsigned int * ) ( 0x424E43A0UL ) )
    #define bFM3_ADC2_PCFDL_RS1                  *( ( volatile unsigned int * ) ( 0x424E43A4UL ) )
    #define bFM3_ADC2_PCFDL_RS2                  *( ( volatile unsigned int * ) ( 0x424E43A8UL ) )
    #define bFM3_ADC2_PCFDL_INVL                 *( ( volatile unsigned int * ) ( 0x424E43B0UL ) )
    #define bFM3_ADC2_PCFDH_PD0                  *( ( volatile unsigned int * ) ( 0x424E43D0UL ) )
    #define bFM3_ADC2_PCFDH_PD1                  *( ( volatile unsigned int * ) ( 0x424E43D4UL ) )
    #define bFM3_ADC2_PCFDH_PD2                  *( ( volatile unsigned int * ) ( 0x424E43D8UL ) )
    #define bFM3_ADC2_PCFDH_PD3                  *( ( volatile unsigned int * ) ( 0x424E43DCUL ) )
    #define bFM3_ADC2_PCFDH_PD4                  *( ( volatile unsigned int * ) ( 0x424E43E0UL ) )
    #define bFM3_ADC2_PCFDH_PD5                  *( ( volatile unsigned int * ) ( 0x424E43E4UL ) )
    #define bFM3_ADC2_PCFDH_PD6                  *( ( volatile unsigned int * ) ( 0x424E43E8UL ) )
    #define bFM3_ADC2_PCFDH_PD7                  *( ( volatile unsigned int * ) ( 0x424E43ECUL ) )
    #define bFM3_ADC2_PCFDH_PD8                  *( ( volatile unsigned int * ) ( 0x424E43F0UL ) )
    #define bFM3_ADC2_PCFDH_PD9                  *( ( volatile unsigned int * ) ( 0x424E43F4UL ) )
    #define bFM3_ADC2_PCFDH_PD10                 *( ( volatile unsigned int * ) ( 0x424E43F8UL ) )
    #define bFM3_ADC2_PCFDH_PD11                 *( ( volatile unsigned int * ) ( 0x424E43FCUL ) )
    #define bFM3_ADC2_PCIS_P1A0                  *( ( volatile unsigned int * ) ( 0x424E4400UL ) )
    #define bFM3_ADC2_PCIS_P1A1                  *( ( volatile unsigned int * ) ( 0x424E4404UL ) )
    #define bFM3_ADC2_PCIS_P1A2                  *( ( volatile unsigned int * ) ( 0x424E4408UL ) )
    #define bFM3_ADC2_PCIS_P2A0                  *( ( volatile unsigned int * ) ( 0x424E440CUL ) )
    #define bFM3_ADC2_PCIS_P2A1                  *( ( volatile unsigned int * ) ( 0x424E4410UL ) )
    #define bFM3_ADC2_PCIS_P2A2                  *( ( volatile unsigned int * ) ( 0x424E4414UL ) )
    #define bFM3_ADC2_PCIS_P2A3                  *( ( volatile unsigned int * ) ( 0x424E4418UL ) )
    #define bFM3_ADC2_PCIS_P2A4                  *( ( volatile unsigned int * ) ( 0x424E441CUL ) )
    #define bFM3_ADC2_CMPCR_CCH0                 *( ( volatile unsigned int * ) ( 0x424E4480UL ) )
    #define bFM3_ADC2_CMPCR_CCH1                 *( ( volatile unsigned int * ) ( 0x424E4484UL ) )
    #define bFM3_ADC2_CMPCR_CCH2                 *( ( volatile unsigned int * ) ( 0x424E4488UL ) )
    #define bFM3_ADC2_CMPCR_CCH3                 *( ( volatile unsigned int * ) ( 0x424E448CUL ) )
    #define bFM3_ADC2_CMPCR_CCH4                 *( ( volatile unsigned int * ) ( 0x424E4490UL ) )
    #define bFM3_ADC2_CMPCR_CMD0                 *( ( volatile unsigned int * ) ( 0x424E4494UL ) )
    #define bFM3_ADC2_CMPCR_CMD1                 *( ( volatile unsigned int * ) ( 0x424E4498UL ) )
    #define bFM3_ADC2_CMPCR_CMPEN                *( ( volatile unsigned int * ) ( 0x424E449CUL ) )
    #define bFM3_ADC2_CMPD_CMAD2                 *( ( volatile unsigned int * ) ( 0x424E44D8UL ) )
    #define bFM3_ADC2_CMPD_CMAD3                 *( ( volatile unsigned int * ) ( 0x424E44DCUL ) )
    #define bFM3_ADC2_CMPD_CMAD4                 *( ( volatile unsigned int * ) ( 0x424E44E0UL ) )
    #define bFM3_ADC2_CMPD_CMAD5                 *( ( volatile unsigned int * ) ( 0x424E44E4UL ) )
    #define bFM3_ADC2_CMPD_CMAD6                 *( ( volatile unsigned int * ) ( 0x424E44E8UL ) )
    #define bFM3_ADC2_CMPD_CMAD7                 *( ( volatile unsigned int * ) ( 0x424E44ECUL ) )
    #define bFM3_ADC2_CMPD_CMAD8                 *( ( volatile unsigned int * ) ( 0x424E44F0UL ) )
    #define bFM3_ADC2_CMPD_CMAD9                 *( ( volatile unsigned int * ) ( 0x424E44F4UL ) )
    #define bFM3_ADC2_CMPD_CMAD10                *( ( volatile unsigned int * ) ( 0x424E44F8UL ) )
    #define bFM3_ADC2_CMPD_CMAD11                *( ( volatile unsigned int * ) ( 0x424E44FCUL ) )
    #define bFM3_ADC2_ADSS23_TS16                *( ( volatile unsigned int * ) ( 0x424E4500UL ) )
    #define bFM3_ADC2_ADSS23_TS17                *( ( volatile unsigned int * ) ( 0x424E4504UL ) )
    #define bFM3_ADC2_ADSS23_TS18                *( ( volatile unsigned int * ) ( 0x424E4508UL ) )
    #define bFM3_ADC2_ADSS23_TS19                *( ( volatile unsigned int * ) ( 0x424E450CUL ) )
    #define bFM3_ADC2_ADSS23_TS20                *( ( volatile unsigned int * ) ( 0x424E4510UL ) )
    #define bFM3_ADC2_ADSS23_TS21                *( ( volatile unsigned int * ) ( 0x424E4514UL ) )
    #define bFM3_ADC2_ADSS23_TS22                *( ( volatile unsigned int * ) ( 0x424E4518UL ) )
    #define bFM3_ADC2_ADSS23_TS23                *( ( volatile unsigned int * ) ( 0x424E451CUL ) )
    #define bFM3_ADC2_ADSS23_TS24                *( ( volatile unsigned int * ) ( 0x424E4520UL ) )
    #define bFM3_ADC2_ADSS23_TS25                *( ( volatile unsigned int * ) ( 0x424E4524UL ) )
    #define bFM3_ADC2_ADSS23_TS26                *( ( volatile unsigned int * ) ( 0x424E4528UL ) )
    #define bFM3_ADC2_ADSS23_TS27                *( ( volatile unsigned int * ) ( 0x424E452CUL ) )
    #define bFM3_ADC2_ADSS23_TS28                *( ( volatile unsigned int * ) ( 0x424E4530UL ) )
    #define bFM3_ADC2_ADSS23_TS29                *( ( volatile unsigned int * ) ( 0x424E4534UL ) )
    #define bFM3_ADC2_ADSS23_TS30                *( ( volatile unsigned int * ) ( 0x424E4538UL ) )
    #define bFM3_ADC2_ADSS23_TS31                *( ( volatile unsigned int * ) ( 0x424E453CUL ) )
    #define bFM3_ADC2_ADSS2_TS16                 *( ( volatile unsigned int * ) ( 0x424E4500UL ) )
    #define bFM3_ADC2_ADSS2_TS17                 *( ( volatile unsigned int * ) ( 0x424E4504UL ) )
    #define bFM3_ADC2_ADSS2_TS18                 *( ( volatile unsigned int * ) ( 0x424E4508UL ) )
    #define bFM3_ADC2_ADSS2_TS19                 *( ( volatile unsigned int * ) ( 0x424E450CUL ) )
    #define bFM3_ADC2_ADSS2_TS20                 *( ( volatile unsigned int * ) ( 0x424E4510UL ) )
    #define bFM3_ADC2_ADSS2_TS21                 *( ( volatile unsigned int * ) ( 0x424E4514UL ) )
    #define bFM3_ADC2_ADSS2_TS22                 *( ( volatile unsigned int * ) ( 0x424E4518UL ) )
    #define bFM3_ADC2_ADSS2_TS23                 *( ( volatile unsigned int * ) ( 0x424E451CUL ) )
    #define bFM3_ADC2_ADSS3_TS24                 *( ( volatile unsigned int * ) ( 0x424E4520UL ) )
    #define bFM3_ADC2_ADSS3_TS25                 *( ( volatile unsigned int * ) ( 0x424E4524UL ) )
    #define bFM3_ADC2_ADSS3_TS26                 *( ( volatile unsigned int * ) ( 0x424E4528UL ) )
    #define bFM3_ADC2_ADSS3_TS27                 *( ( volatile unsigned int * ) ( 0x424E452CUL ) )
    #define bFM3_ADC2_ADSS3_TS28                 *( ( volatile unsigned int * ) ( 0x424E4530UL ) )
    #define bFM3_ADC2_ADSS3_TS29                 *( ( volatile unsigned int * ) ( 0x424E4534UL ) )
    #define bFM3_ADC2_ADSS3_TS30                 *( ( volatile unsigned int * ) ( 0x424E4538UL ) )
    #define bFM3_ADC2_ADSS3_TS31                 *( ( volatile unsigned int * ) ( 0x424E453CUL ) )
    #define bFM3_ADC2_ADSS01_TS0                 *( ( volatile unsigned int * ) ( 0x424E4580UL ) )
    #define bFM3_ADC2_ADSS01_TS1                 *( ( volatile unsigned int * ) ( 0x424E4584UL ) )
    #define bFM3_ADC2_ADSS01_TS2                 *( ( volatile unsigned int * ) ( 0x424E4588UL ) )
