FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_ADC2_ADSS01_TS3                 *( ( volatile unsigned int * ) ( 0x424E458CUL ) )
    #define bFM3_ADC2_ADSS01_TS4                 *( ( volatile unsigned int * ) ( 0x424E4590UL ) )
    #define bFM3_ADC2_ADSS01_TS5                 *( ( volatile unsigned int * ) ( 0x424E4594UL ) )
    #define bFM3_ADC2_ADSS01_TS6                 *( ( volatile unsigned int * ) ( 0x424E4598UL ) )
    #define bFM3_ADC2_ADSS01_TS7                 *( ( volatile unsigned int * ) ( 0x424E459CUL ) )
    #define bFM3_ADC2_ADSS01_TS8                 *( ( volatile unsigned int * ) ( 0x424E45A0UL ) )
    #define bFM3_ADC2_ADSS01_TS9                 *( ( volatile unsigned int * ) ( 0x424E45A4UL ) )
    #define bFM3_ADC2_ADSS01_TS10                *( ( volatile unsigned int * ) ( 0x424E45A8UL ) )
    #define bFM3_ADC2_ADSS01_TS11                *( ( volatile unsigned int * ) ( 0x424E45ACUL ) )
    #define bFM3_ADC2_ADSS01_TS12                *( ( volatile unsigned int * ) ( 0x424E45B0UL ) )
    #define bFM3_ADC2_ADSS01_TS13                *( ( volatile unsigned int * ) ( 0x424E45B4UL ) )
    #define bFM3_ADC2_ADSS01_TS14                *( ( volatile unsigned int * ) ( 0x424E45B8UL ) )
    #define bFM3_ADC2_ADSS01_TS15                *( ( volatile unsigned int * ) ( 0x424E45BCUL ) )
    #define bFM3_ADC2_ADSS0_TS0                  *( ( volatile unsigned int * ) ( 0x424E4580UL ) )
    #define bFM3_ADC2_ADSS0_TS1                  *( ( volatile unsigned int * ) ( 0x424E4584UL ) )
    #define bFM3_ADC2_ADSS0_TS2                  *( ( volatile unsigned int * ) ( 0x424E4588UL ) )
    #define bFM3_ADC2_ADSS0_TS3                  *( ( volatile unsigned int * ) ( 0x424E458CUL ) )
    #define bFM3_ADC2_ADSS0_TS4                  *( ( volatile unsigned int * ) ( 0x424E4590UL ) )
    #define bFM3_ADC2_ADSS0_TS5                  *( ( volatile unsigned int * ) ( 0x424E4594UL ) )
    #define bFM3_ADC2_ADSS0_TS6                  *( ( volatile unsigned int * ) ( 0x424E4598UL ) )
    #define bFM3_ADC2_ADSS0_TS7                  *( ( volatile unsigned int * ) ( 0x424E459CUL ) )
    #define bFM3_ADC2_ADSS1_TS8                  *( ( volatile unsigned int * ) ( 0x424E45A0UL ) )
    #define bFM3_ADC2_ADSS1_TS9                  *( ( volatile unsigned int * ) ( 0x424E45A4UL ) )
    #define bFM3_ADC2_ADSS1_TS10                 *( ( volatile unsigned int * ) ( 0x424E45A8UL ) )
    #define bFM3_ADC2_ADSS1_TS11                 *( ( volatile unsigned int * ) ( 0x424E45ACUL ) )
    #define bFM3_ADC2_ADSS1_TS12                 *( ( volatile unsigned int * ) ( 0x424E45B0UL ) )
    #define bFM3_ADC2_ADSS1_TS13                 *( ( volatile unsigned int * ) ( 0x424E45B4UL ) )
    #define bFM3_ADC2_ADSS1_TS14                 *( ( volatile unsigned int * ) ( 0x424E45B8UL ) )
    #define bFM3_ADC2_ADSS1_TS15                 *( ( volatile unsigned int * ) ( 0x424E45BCUL ) )
    #define bFM3_ADC2_ADST01_ST10                *( ( volatile unsigned int * ) ( 0x424E4600UL ) )
    #define bFM3_ADC2_ADST01_ST11                *( ( volatile unsigned int * ) ( 0x424E4604UL ) )
    #define bFM3_ADC2_ADST01_ST12                *( ( volatile unsigned int * ) ( 0x424E4608UL ) )
    #define bFM3_ADC2_ADST01_ST13                *( ( volatile unsigned int * ) ( 0x424E460CUL ) )
    #define bFM3_ADC2_ADST01_ST14                *( ( volatile unsigned int * ) ( 0x424E4610UL ) )
    #define bFM3_ADC2_ADST01_STX10               *( ( volatile unsigned int * ) ( 0x424E4614UL ) )
    #define bFM3_ADC2_ADST01_STX11               *( ( volatile unsigned int * ) ( 0x424E4618UL ) )
    #define bFM3_ADC2_ADST01_STX12               *( ( volatile unsigned int * ) ( 0x424E461CUL ) )
    #define bFM3_ADC2_ADST01_ST00                *( ( volatile unsigned int * ) ( 0x424E4620UL ) )
    #define bFM3_ADC2_ADST01_ST01                *( ( volatile unsigned int * ) ( 0x424E4624UL ) )
    #define bFM3_ADC2_ADST01_ST02                *( ( volatile unsigned int * ) ( 0x424E4628UL ) )
    #define bFM3_ADC2_ADST01_ST03                *( ( volatile unsigned int * ) ( 0x424E462CUL ) )
    #define bFM3_ADC2_ADST01_ST04                *( ( volatile unsigned int * ) ( 0x424E4630UL ) )
    #define bFM3_ADC2_ADST01_STX00               *( ( volatile unsigned int * ) ( 0x424E4634UL ) )
    #define bFM3_ADC2_ADST01_STX01               *( ( volatile unsigned int * ) ( 0x424E4638UL ) )
    #define bFM3_ADC2_ADST01_STX02               *( ( volatile unsigned int * ) ( 0x424E463CUL ) )
    #define bFM3_ADC2_ADST1_ST10                 *( ( volatile unsigned int * ) ( 0x424E4600UL ) )
    #define bFM3_ADC2_ADST1_ST11                 *( ( volatile unsigned int * ) ( 0x424E4604UL ) )
    #define bFM3_ADC2_ADST1_ST12                 *( ( volatile unsigned int * ) ( 0x424E4608UL ) )
    #define bFM3_ADC2_ADST1_ST13                 *( ( volatile unsigned int * ) ( 0x424E460CUL ) )
    #define bFM3_ADC2_ADST1_ST14                 *( ( volatile unsigned int * ) ( 0x424E4610UL ) )
    #define bFM3_ADC2_ADST1_STX10                *( ( volatile unsigned int * ) ( 0x424E4614UL ) )
    #define bFM3_ADC2_ADST1_STX11                *( ( volatile unsigned int * ) ( 0x424E4618UL ) )
    #define bFM3_ADC2_ADST1_STX12                *( ( volatile unsigned int * ) ( 0x424E461CUL ) )
    #define bFM3_ADC2_ADST0_ST00                 *( ( volatile unsigned int * ) ( 0x424E4620UL ) )
    #define bFM3_ADC2_ADST0_ST01                 *( ( volatile unsigned int * ) ( 0x424E4624UL ) )
    #define bFM3_ADC2_ADST0_ST02                 *( ( volatile unsigned int * ) ( 0x424E4628UL ) )
    #define bFM3_ADC2_ADST0_ST03                 *( ( volatile unsigned int * ) ( 0x424E462CUL ) )
    #define bFM3_ADC2_ADST0_ST04                 *( ( volatile unsigned int * ) ( 0x424E4630UL ) )
    #define bFM3_ADC2_ADST0_STX00                *( ( volatile unsigned int * ) ( 0x424E4634UL ) )
    #define bFM3_ADC2_ADST0_STX01                *( ( volatile unsigned int * ) ( 0x424E4638UL ) )
    #define bFM3_ADC2_ADST0_STX02                *( ( volatile unsigned int * ) ( 0x424E463CUL ) )
    #define bFM3_ADC2_ADCT_CT0                   *( ( volatile unsigned int * ) ( 0x424E4680UL ) )
    #define bFM3_ADC2_ADCT_CT1                   *( ( volatile unsigned int * ) ( 0x424E4684UL ) )
    #define bFM3_ADC2_ADCT_CT2                   *( ( volatile unsigned int * ) ( 0x424E4688UL ) )
    #define bFM3_ADC2_PRTSL_PRTSL0               *( ( volatile unsigned int * ) ( 0x424E4700UL ) )
    #define bFM3_ADC2_PRTSL_PRTSL1               *( ( volatile unsigned int * ) ( 0x424E4704UL ) )
    #define bFM3_ADC2_PRTSL_PRTSL2               *( ( volatile unsigned int * ) ( 0x424E4708UL ) )
    #define bFM3_ADC2_PRTSL_PRTSL3               *( ( volatile unsigned int * ) ( 0x424E470CUL ) )
    #define bFM3_ADC2_SCTSL_SCTSL0               *( ( volatile unsigned int * ) ( 0x424E4720UL ) )
    #define bFM3_ADC2_SCTSL_SCTSL1               *( ( volatile unsigned int * ) ( 0x424E4724UL ) )
    #define bFM3_ADC2_SCTSL_SCTSL2               *( ( volatile unsigned int * ) ( 0x424E4728UL ) )
    #define bFM3_ADC2_SCTSL_SCTSL3               *( ( volatile unsigned int * ) ( 0x424E472CUL ) )
    #define bFM3_ADC2_ADCEN_ENBL                 *( ( volatile unsigned int * ) ( 0x424E4780UL ) )
    #define bFM3_ADC2_ADCEN_READY                *( ( volatile unsigned int * ) ( 0x424E4784UL ) )

/* CR trimming registers */
    #define bFM3_CRTRIM_MCR_PSR_CSR0             *( ( volatile unsigned int * ) ( 0x425C0000UL ) )
    #define bFM3_CRTRIM_MCR_PSR_CSR1             *( ( volatile unsigned int * ) ( 0x425C0004UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD0            *( ( volatile unsigned int * ) ( 0x425C0080UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD1            *( ( volatile unsigned int * ) ( 0x425C0084UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD2            *( ( volatile unsigned int * ) ( 0x425C0088UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD3            *( ( volatile unsigned int * ) ( 0x425C008CUL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD4            *( ( volatile unsigned int * ) ( 0x425C0090UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD5            *( ( volatile unsigned int * ) ( 0x425C0094UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD6            *( ( volatile unsigned int * ) ( 0x425C0098UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD7            *( ( volatile unsigned int * ) ( 0x425C009CUL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD8            *( ( volatile unsigned int * ) ( 0x425C00A0UL ) )
    #define bFM3_CRTRIM_MCR_FTRM_TRD9            *( ( volatile unsigned int * ) ( 0x425C00A4UL ) )

/* External interrupt registers */
    #define bFM3_EXTI_ENIR_EN0                   *( ( volatile unsigned int * ) ( 0x42600000UL ) )
    #define bFM3_EXTI_ENIR_EN1                   *( ( volatile unsigned int * ) ( 0x42600004UL ) )
    #define bFM3_EXTI_ENIR_EN2                   *( ( volatile unsigned int * ) ( 0x42600008UL ) )
    #define bFM3_EXTI_ENIR_EN3                   *( ( volatile unsigned int * ) ( 0x4260000CUL ) )
    #define bFM3_EXTI_ENIR_EN4                   *( ( volatile unsigned int * ) ( 0x42600010UL ) )
    #define bFM3_EXTI_ENIR_EN5                   *( ( volatile unsigned int * ) ( 0x42600014UL ) )
    #define bFM3_EXTI_ENIR_EN6                   *( ( volatile unsigned int * ) ( 0x42600018UL ) )
    #define bFM3_EXTI_ENIR_EN7                   *( ( volatile unsigned int * ) ( 0x4260001CUL ) )
    #define bFM3_EXTI_ENIR_EN8                   *( ( volatile unsigned int * ) ( 0x42600020UL ) )
    #define bFM3_EXTI_ENIR_EN9                   *( ( volatile unsigned int * ) ( 0x42600024UL ) )
    #define bFM3_EXTI_ENIR_EN10                  *( ( volatile unsigned int * ) ( 0x42600028UL ) )
    #define bFM3_EXTI_ENIR_EN11                  *( ( volatile unsigned int * ) ( 0x4260002CUL ) )
    #define bFM3_EXTI_ENIR_EN12                  *( ( volatile unsigned int * ) ( 0x42600030UL ) )
    #define bFM3_EXTI_ENIR_EN13                  *( ( volatile unsigned int * ) ( 0x42600034UL ) )
    #define bFM3_EXTI_ENIR_EN14                  *( ( volatile unsigned int * ) ( 0x42600038UL ) )
    #define bFM3_EXTI_ENIR_EN15                  *( ( volatile unsigned int * ) ( 0x4260003CUL ) )
    #define bFM3_EXTI_EIRR_ER0                   *( ( volatile unsigned int * ) ( 0x42600080UL ) )
    #define bFM3_EXTI_EIRR_ER1                   *( ( volatile unsigned int * ) ( 0x42600084UL ) )
    #define bFM3_EXTI_EIRR_ER2                   *( ( volatile unsigned int * ) ( 0x42600088UL ) )
    #define bFM3_EXTI_EIRR_ER3                   *( ( volatile unsigned int * ) ( 0x4260008CUL ) )
    #define bFM3_EXTI_EIRR_ER4                   *( ( volatile unsigned int * ) ( 0x42600090UL ) )
    #define bFM3_EXTI_EIRR_ER5                   *( ( volatile unsigned int * ) ( 0x42600094UL ) )
    #define bFM3_EXTI_EIRR_ER6                   *( ( volatile unsigned int * ) ( 0x42600098UL ) )
    #define bFM3_EXTI_EIRR_ER7                   *( ( volatile unsigned int * ) ( 0x4260009CUL ) )
    #define bFM3_EXTI_EIRR_ER8                   *( ( volatile unsigned int * ) ( 0x426000A0UL ) )
    #define bFM3_EXTI_EIRR_ER9                   *( ( volatile unsigned int * ) ( 0x426000A4UL ) )
    #define bFM3_EXTI_EIRR_ER10                  *( ( volatile unsigned int * ) ( 0x426000A8UL ) )
    #define bFM3_EXTI_EIRR_ER11                  *( ( volatile unsigned int * ) ( 0x426000ACUL ) )
    #define bFM3_EXTI_EIRR_ER12                  *( ( volatile unsigned int * ) ( 0x426000B0UL ) )
    #define bFM3_EXTI_EIRR_ER13                  *( ( volatile unsigned int * ) ( 0x426000B4UL ) )
    #define bFM3_EXTI_EIRR_ER14                  *( ( volatile unsigned int * ) ( 0x426000B8UL ) )
    #define bFM3_EXTI_EIRR_ER15                  *( ( volatile unsigned int * ) ( 0x426000BCUL ) )
    #define bFM3_EXTI_EICL_ECL0                  *( ( volatile unsigned int * ) ( 0x42600100UL ) )
    #define bFM3_EXTI_EICL_ECL1                  *( ( volatile unsigned int * ) ( 0x42600104UL ) )
    #define bFM3_EXTI_EICL_ECL2                  *( ( volatile unsigned int * ) ( 0x42600108UL ) )
    #define bFM3_EXTI_EICL_ECL3                  *( ( volatile unsigned int * ) ( 0x4260010CUL ) )
    #define bFM3_EXTI_EICL_ECL4                  *( ( volatile unsigned int * ) ( 0x42600110UL ) )
    #define bFM3_EXTI_EICL_ECL5                  *( ( volatile unsigned int * ) ( 0x42600114UL ) )
    #define bFM3_EXTI_EICL_ECL6                  *( ( volatile unsigned int * ) ( 0x42600118UL ) )
    #define bFM3_EXTI_EICL_ECL7                  *( ( volatile unsigned int * ) ( 0x4260011CUL ) )
    #define bFM3_EXTI_EICL_ECL8                  *( ( volatile unsigned int * ) ( 0x42600120UL ) )
    #define bFM3_EXTI_EICL_ECL9                  *( ( volatile unsigned int * ) ( 0x42600124UL ) )
    #define bFM3_EXTI_EICL_ECL10                 *( ( volatile unsigned int * ) ( 0x42600128UL ) )
    #define bFM3_EXTI_EICL_ECL11                 *( ( volatile unsigned int * ) ( 0x4260012CUL ) )
    #define bFM3_EXTI_EICL_ECL12                 *( ( volatile unsigned int * ) ( 0x42600130UL ) )
    #define bFM3_EXTI_EICL_ECL13                 *( ( volatile unsigned int * ) ( 0x42600134UL ) )
    #define bFM3_EXTI_EICL_ECL14                 *( ( volatile unsigned int * ) ( 0x42600138UL ) )
    #define bFM3_EXTI_EICL_ECL15                 *( ( volatile unsigned int * ) ( 0x4260013CUL ) )
    #define bFM3_EXTI_ELVR_LA0                   *( ( volatile unsigned int * ) ( 0x42600180UL ) )
    #define bFM3_EXTI_ELVR_LB0                   *( ( volatile unsigned int * ) ( 0x42600184UL ) )
    #define bFM3_EXTI_ELVR_LA1                   *( ( volatile unsigned int * ) ( 0x42600188UL ) )
    #define bFM3_EXTI_ELVR_LB1                   *( ( volatile unsigned int * ) ( 0x4260018CUL ) )
    #define bFM3_EXTI_ELVR_LA2                   *( ( volatile unsigned int * ) ( 0x42600190UL ) )
    #define bFM3_EXTI_ELVR_LB2                   *( ( volatile unsigned int * ) ( 0x42600194UL ) )
    #define bFM3_EXTI_ELVR_LA3                   *( ( volatile unsigned int * ) ( 0x42600198UL ) )
    #define bFM3_EXTI_ELVR_LB3                   *( ( volatile unsigned int * ) ( 0x4260019CUL ) )
    #define bFM3_EXTI_ELVR_LA4                   *( ( volatile unsigned int * ) ( 0x426001A0UL ) )
    #define bFM3_EXTI_ELVR_LB4                   *( ( volatile unsigned int * ) ( 0x426001A4UL ) )
    #define bFM3_EXTI_ELVR_LA5                   *( ( volatile unsigned int * ) ( 0x426001A8UL ) )
    #define bFM3_EXTI_ELVR_LB5                   *( ( volatile unsigned int * ) ( 0x426001ACUL ) )
    #define bFM3_EXTI_ELVR_LA6                   *( ( volatile unsigned int * ) ( 0x426001B0UL ) )
    #define bFM3_EXTI_ELVR_LB6                   *( ( volatile unsigned int * ) ( 0x426001B4UL ) )
    #define bFM3_EXTI_ELVR_LA7                   *( ( volatile unsigned int * ) ( 0x426001B8UL ) )
    #define bFM3_EXTI_ELVR_LB7                   *( ( volatile unsigned int * ) ( 0x426001BCUL ) )
    #define bFM3_EXTI_ELVR_LA8                   *( ( volatile unsigned int * ) ( 0x426001C0UL ) )
    #define bFM3_EXTI_ELVR_LB8                   *( ( volatile unsigned int * ) ( 0x426001C4UL ) )
    #define bFM3_EXTI_ELVR_LA9                   *( ( volatile unsigned int * ) ( 0x426001C8UL ) )
    #define bFM3_EXTI_ELVR_LB9                   *( ( volatile unsigned int * ) ( 0x426001CCUL ) )
    #define bFM3_EXTI_ELVR_LA10                  *( ( volatile unsigned int * ) ( 0x426001D0UL ) )
    #define bFM3_EXTI_ELVR_LB10                  *( ( volatile unsigned int * ) ( 0x426001D4UL ) )
    #define bFM3_EXTI_ELVR_LA11                  *( ( volatile unsigned int * ) ( 0x426001D8UL ) )
    #define bFM3_EXTI_ELVR_LB11                  *( ( volatile unsigned int * ) ( 0x426001DCUL ) )
    #define bFM3_EXTI_ELVR_LA12                  *( ( volatile unsigned int * ) ( 0x426001E0UL ) )
    #define bFM3_EXTI_ELVR_LB12                  *( ( volatile unsigned int * ) ( 0x426001E4UL ) )
    #define bFM3_EXTI_ELVR_LA13                  *( ( volatile unsigned int * ) ( 0x426001E8UL ) )
    #define bFM3_EXTI_ELVR_LB13                  *( ( volatile unsigned int * ) ( 0x426001ECUL ) )
    #define bFM3_EXTI_ELVR_LA14                  *( ( volatile unsigned int * ) ( 0x426001F0UL ) )
    #define bFM3_EXTI_ELVR_LB14                  *( ( volatile unsigned int * ) ( 0x426001F4UL ) )
    #define bFM3_EXTI_ELVR_LA15                  *( ( volatile unsigned int * ) ( 0x426001F8UL ) )
    #define bFM3_EXTI_ELVR_LB15                  *( ( volatile unsigned int * ) ( 0x426001FCUL ) )
    #define bFM3_EXTI_NMIRR_NR0                  *( ( volatile unsigned int * ) ( 0x42600280UL ) )
    #define bFM3_EXTI_NMICL_NCL0                 *( ( volatile unsigned int * ) ( 0x42600300UL ) )

