FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Interrupt request read registers */
    #define bFM3_INTREQ_DRQSEL_DRQSEL0           *( ( volatile unsigned int * ) ( 0x42620000UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL1           *( ( volatile unsigned int * ) ( 0x42620004UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL2           *( ( volatile unsigned int * ) ( 0x42620008UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL3           *( ( volatile unsigned int * ) ( 0x4262000CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL4           *( ( volatile unsigned int * ) ( 0x42620010UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL5           *( ( volatile unsigned int * ) ( 0x42620014UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL6           *( ( volatile unsigned int * ) ( 0x42620018UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL7           *( ( volatile unsigned int * ) ( 0x4262001CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL8           *( ( volatile unsigned int * ) ( 0x42620020UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL9           *( ( volatile unsigned int * ) ( 0x42620024UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL10          *( ( volatile unsigned int * ) ( 0x42620028UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL11          *( ( volatile unsigned int * ) ( 0x4262002CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL12          *( ( volatile unsigned int * ) ( 0x42620030UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL13          *( ( volatile unsigned int * ) ( 0x42620034UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL14          *( ( volatile unsigned int * ) ( 0x42620038UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL15          *( ( volatile unsigned int * ) ( 0x4262003CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL16          *( ( volatile unsigned int * ) ( 0x42620040UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL17          *( ( volatile unsigned int * ) ( 0x42620044UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL18          *( ( volatile unsigned int * ) ( 0x42620048UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL19          *( ( volatile unsigned int * ) ( 0x4262004CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL20          *( ( volatile unsigned int * ) ( 0x42620050UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL21          *( ( volatile unsigned int * ) ( 0x42620054UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL22          *( ( volatile unsigned int * ) ( 0x42620058UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL23          *( ( volatile unsigned int * ) ( 0x4262005CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL24          *( ( volatile unsigned int * ) ( 0x42620060UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL25          *( ( volatile unsigned int * ) ( 0x42620064UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL26          *( ( volatile unsigned int * ) ( 0x42620068UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL27          *( ( volatile unsigned int * ) ( 0x4262006CUL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL28          *( ( volatile unsigned int * ) ( 0x42620070UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL29          *( ( volatile unsigned int * ) ( 0x42620074UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL30          *( ( volatile unsigned int * ) ( 0x42620078UL ) )
    #define bFM3_INTREQ_DRQSEL_DRQSEL31          *( ( volatile unsigned int * ) ( 0x4262007CUL ) )
    #define bFM3_INTREQ_EXC02MON_NMI             *( ( volatile unsigned int * ) ( 0x42620200UL ) )
    #define bFM3_INTREQ_EXC02MON_HWINT           *( ( volatile unsigned int * ) ( 0x42620204UL ) )
    #define bFM3_INTREQ_IRQ00MON_FCSINT          *( ( volatile unsigned int * ) ( 0x42620280UL ) )
    #define bFM3_INTREQ_IRQ01MON_SWWDTINT        *( ( volatile unsigned int * ) ( 0x42620300UL ) )
    #define bFM3_INTREQ_IRQ02MON_LVDINT          *( ( volatile unsigned int * ) ( 0x42620380UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE0INT0       *( ( volatile unsigned int * ) ( 0x42620400UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE0INT1       *( ( volatile unsigned int * ) ( 0x42620404UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE0INT2       *( ( volatile unsigned int * ) ( 0x42620408UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE0INT3       *( ( volatile unsigned int * ) ( 0x4262040CUL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE1INT0       *( ( volatile unsigned int * ) ( 0x42620410UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE1INT1       *( ( volatile unsigned int * ) ( 0x42620414UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE1INT2       *( ( volatile unsigned int * ) ( 0x42620418UL ) )
    #define bFM3_INTREQ_IRQ03MON_WAVE1INT3       *( ( volatile unsigned int * ) ( 0x4262041CUL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT0         *( ( volatile unsigned int * ) ( 0x42620480UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT1         *( ( volatile unsigned int * ) ( 0x42620484UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT2         *( ( volatile unsigned int * ) ( 0x42620488UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT3         *( ( volatile unsigned int * ) ( 0x4262048CUL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT4         *( ( volatile unsigned int * ) ( 0x42620490UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT5         *( ( volatile unsigned int * ) ( 0x42620494UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT6         *( ( volatile unsigned int * ) ( 0x42620498UL ) )
    #define bFM3_INTREQ_IRQ04MON_EXTINT7         *( ( volatile unsigned int * ) ( 0x4262049CUL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT0         *( ( volatile unsigned int * ) ( 0x42620500UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT1         *( ( volatile unsigned int * ) ( 0x42620504UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT2         *( ( volatile unsigned int * ) ( 0x42620508UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT3         *( ( volatile unsigned int * ) ( 0x4262050CUL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT4         *( ( volatile unsigned int * ) ( 0x42620510UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT5         *( ( volatile unsigned int * ) ( 0x42620514UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT6         *( ( volatile unsigned int * ) ( 0x42620518UL ) )
    #define bFM3_INTREQ_IRQ05MON_EXTINT7         *( ( volatile unsigned int * ) ( 0x4262051CUL ) )
    #define bFM3_INTREQ_IRQ06MON_TIMINT0         *( ( volatile unsigned int * ) ( 0x42620580UL ) )
    #define bFM3_INTREQ_IRQ06MON_TIMINT1         *( ( volatile unsigned int * ) ( 0x42620584UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT0        *( ( volatile unsigned int * ) ( 0x42620588UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT1        *( ( volatile unsigned int * ) ( 0x4262058CUL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT2        *( ( volatile unsigned int * ) ( 0x42620590UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT3        *( ( volatile unsigned int * ) ( 0x42620594UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT4        *( ( volatile unsigned int * ) ( 0x42620598UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD0INT5        *( ( volatile unsigned int * ) ( 0x4262059CUL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT0        *( ( volatile unsigned int * ) ( 0x426205A0UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT1        *( ( volatile unsigned int * ) ( 0x426205A4UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT2        *( ( volatile unsigned int * ) ( 0x426205A8UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT3        *( ( volatile unsigned int * ) ( 0x426205ACUL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT4        *( ( volatile unsigned int * ) ( 0x426205B0UL ) )
    #define bFM3_INTREQ_IRQ06MON_QUD1INT5        *( ( volatile unsigned int * ) ( 0x426205B4UL ) )
    #define bFM3_INTREQ_IRQ07MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620600UL ) )
    #define bFM3_INTREQ_IRQ08MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620680UL ) )
    #define bFM3_INTREQ_IRQ08MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620684UL ) )
    #define bFM3_INTREQ_IRQ09MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620700UL ) )
    #define bFM3_INTREQ_IRQ10MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620780UL ) )
    #define bFM3_INTREQ_IRQ10MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620784UL ) )
    #define bFM3_INTREQ_IRQ11MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620800UL ) )
    #define bFM3_INTREQ_IRQ12MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620880UL ) )
    #define bFM3_INTREQ_IRQ12MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620884UL ) )
    #define bFM3_INTREQ_IRQ13MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620900UL ) )
    #define bFM3_INTREQ_IRQ14MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620980UL ) )
    #define bFM3_INTREQ_IRQ14MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620984UL ) )
    #define bFM3_INTREQ_IRQ15MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620A00UL ) )
    #define bFM3_INTREQ_IRQ16MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620A80UL ) )
    #define bFM3_INTREQ_IRQ16MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620A84UL ) )
    #define bFM3_INTREQ_IRQ17MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620B00UL ) )
    #define bFM3_INTREQ_IRQ18MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620B80UL ) )
    #define bFM3_INTREQ_IRQ18MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620B84UL ) )
    #define bFM3_INTREQ_IRQ19MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620C00UL ) )
    #define bFM3_INTREQ_IRQ20MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620C80UL ) )
    #define bFM3_INTREQ_IRQ20MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620C84UL ) )
    #define bFM3_INTREQ_IRQ21MON_FMSINT          *( ( volatile unsigned int * ) ( 0x42620D00UL ) )
    #define bFM3_INTREQ_IRQ22MON_MFSINT0         *( ( volatile unsigned int * ) ( 0x42620D80UL ) )
    #define bFM3_INTREQ_IRQ22MON_MFSINT1         *( ( volatile unsigned int * ) ( 0x42620D84UL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT0         *( ( volatile unsigned int * ) ( 0x42620E00UL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT1         *( ( volatile unsigned int * ) ( 0x42620E04UL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT2         *( ( volatile unsigned int * ) ( 0x42620E08UL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT3         *( ( volatile unsigned int * ) ( 0x42620E0CUL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT4         *( ( volatile unsigned int * ) ( 0x42620E10UL ) )
    #define bFM3_INTREQ_IRQ23MON_PPGINT5         *( ( volatile unsigned int * ) ( 0x42620E14UL ) )
    #define bFM3_INTREQ_IRQ24MON_MOSCINT         *( ( volatile unsigned int * ) ( 0x42620E80UL ) )
    #define bFM3_INTREQ_IRQ24MON_SOSCINT         *( ( volatile unsigned int * ) ( 0x42620E84UL ) )
    #define bFM3_INTREQ_IRQ24MON_MPLLINT         *( ( volatile unsigned int * ) ( 0x42620E88UL ) )
    #define bFM3_INTREQ_IRQ24MON_UPLLINT         *( ( volatile unsigned int * ) ( 0x42620E8CUL ) )
    #define bFM3_INTREQ_IRQ24MON_WCINT           *( ( volatile unsigned int * ) ( 0x42620E90UL ) )
    #define bFM3_INTREQ_IRQ25MON_ADCINT0         *( ( volatile unsigned int * ) ( 0x42620F00UL ) )
    #define bFM3_INTREQ_IRQ25MON_ADCINT1         *( ( volatile unsigned int * ) ( 0x42620F04UL ) )
    #define bFM3_INTREQ_IRQ25MON_ADCINT2         *( ( volatile unsigned int * ) ( 0x42620F08UL ) )
    #define bFM3_INTREQ_IRQ25MON_ADCINT3         *( ( volatile unsigned int * ) ( 0x42620F0CUL ) )
    #define bFM3_INTREQ_IRQ26MON_ADCINT0         *( ( volatile unsigned int * ) ( 0x42620F80UL ) )
    #define bFM3_INTREQ_IRQ26MON_ADCINT1         *( ( volatile unsigned int * ) ( 0x42620F84UL ) )
    #define bFM3_INTREQ_IRQ26MON_ADCINT2         *( ( volatile unsigned int * ) ( 0x42620F88UL ) )
    #define bFM3_INTREQ_IRQ26MON_ADCINT3         *( ( volatile unsigned int * ) ( 0x42620F8CUL ) )
    #define bFM3_INTREQ_IRQ27MON_ADCINT0         *( ( volatile unsigned int * ) ( 0x42621000UL ) )
    #define bFM3_INTREQ_IRQ27MON_ADCINT1         *( ( volatile unsigned int * ) ( 0x42621004UL ) )
    #define bFM3_INTREQ_IRQ27MON_ADCINT2         *( ( volatile unsigned int * ) ( 0x42621008UL ) )
    #define bFM3_INTREQ_IRQ27MON_ADCINT3         *( ( volatile unsigned int * ) ( 0x4262100CUL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT0        *( ( volatile unsigned int * ) ( 0x42621080UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT1        *( ( volatile unsigned int * ) ( 0x42621084UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT2        *( ( volatile unsigned int * ) ( 0x42621088UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT3        *( ( volatile unsigned int * ) ( 0x4262108CUL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT4        *( ( volatile unsigned int * ) ( 0x42621090UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT0INT5        *( ( volatile unsigned int * ) ( 0x42621094UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT0        *( ( volatile unsigned int * ) ( 0x42621098UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT1        *( ( volatile unsigned int * ) ( 0x4262109CUL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT2        *( ( volatile unsigned int * ) ( 0x426210A0UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT3        *( ( volatile unsigned int * ) ( 0x426210A4UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT4        *( ( volatile unsigned int * ) ( 0x426210A8UL ) )
    #define bFM3_INTREQ_IRQ28MON_FRT1INT5        *( ( volatile unsigned int * ) ( 0x426210ACUL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU0INT0        *( ( volatile unsigned int * ) ( 0x42621100UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU0INT1        *( ( volatile unsigned int * ) ( 0x42621104UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU0INT2        *( ( volatile unsigned int * ) ( 0x42621108UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU0INT3        *( ( volatile unsigned int * ) ( 0x4262110CUL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU1INT0        *( ( volatile unsigned int * ) ( 0x42621110UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU1INT1        *( ( volatile unsigned int * ) ( 0x42621114UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU1INT2        *( ( volatile unsigned int * ) ( 0x42621118UL ) )
    #define bFM3_INTREQ_IRQ29MON_ICU1INT3        *( ( volatile unsigned int * ) ( 0x4262111CUL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT0        *( ( volatile unsigned int * ) ( 0x42621180UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT1        *( ( volatile unsigned int * ) ( 0x42621184UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT2        *( ( volatile unsigned int * ) ( 0x42621188UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT3        *( ( volatile unsigned int * ) ( 0x4262118CUL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT4        *( ( volatile unsigned int * ) ( 0x42621190UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU0INT5        *( ( volatile unsigned int * ) ( 0x42621194UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT0        *( ( volatile unsigned int * ) ( 0x42621198UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT1        *( ( volatile unsigned int * ) ( 0x4262119CUL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT2        *( ( volatile unsigned int * ) ( 0x426211A0UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT3        *( ( volatile unsigned int * ) ( 0x426211A4UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT4        *( ( volatile unsigned int * ) ( 0x426211A8UL ) )
    #define bFM3_INTREQ_IRQ30MON_OCU1INT5        *( ( volatile unsigned int * ) ( 0x426211ACUL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT0          *( ( volatile unsigned int * ) ( 0x42621200UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT1          *( ( volatile unsigned int * ) ( 0x42621204UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT2          *( ( volatile unsigned int * ) ( 0x42621208UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT3          *( ( volatile unsigned int * ) ( 0x4262120CUL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT4          *( ( volatile unsigned int * ) ( 0x42621210UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT5          *( ( volatile unsigned int * ) ( 0x42621214UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT6          *( ( volatile unsigned int * ) ( 0x42621218UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT7          *( ( volatile unsigned int * ) ( 0x4262121CUL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT8          *( ( volatile unsigned int * ) ( 0x42621220UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT9          *( ( volatile unsigned int * ) ( 0x42621224UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT10         *( ( volatile unsigned int * ) ( 0x42621228UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT11         *( ( volatile unsigned int * ) ( 0x4262122CUL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT12         *( ( volatile unsigned int * ) ( 0x42621230UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT13         *( ( volatile unsigned int * ) ( 0x42621234UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT14         *( ( volatile unsigned int * ) ( 0x42621238UL ) )
    #define bFM3_INTREQ_IRQ31MON_BTINT15         *( ( volatile unsigned int * ) ( 0x4262123CUL ) )
    #define bFM3_INTREQ_IRQ32MON_CANINT          *( ( volatile unsigned int * ) ( 0x42621280UL ) )
    #define bFM3_INTREQ_IRQ33MON_CANINT          *( ( volatile unsigned int * ) ( 0x42621300UL ) )
    #define bFM3_INTREQ_IRQ34MON_USB0INT0        *( ( volatile unsigned int * ) ( 0x42621380UL ) )
    #define bFM3_INTREQ_IRQ34MON_USB0INT1        *( ( volatile unsigned int * ) ( 0x42621384UL ) )
    #define bFM3_INTREQ_IRQ34MON_USB0INT2        *( ( volatile unsigned int * ) ( 0x42621388UL ) )
    #define bFM3_INTREQ_IRQ34MON_USB0INT3        *( ( volatile unsigned int * ) ( 0x4262138CUL ) )
    #define bFM3_INTREQ_IRQ34MON_USB0INT4        *( ( volatile unsigned int * ) ( 0x42621390UL ) )
    #define bFM3_INTREQ_IRQ35MON_USB0INT0        *( ( volatile unsigned int * ) ( 0x42621400UL ) )
    #define bFM3_INTREQ_IRQ35MON_USB0INT1        *( ( volatile unsigned int * ) ( 0x42621404UL ) )
    #define bFM3_INTREQ_IRQ35MON_USB0INT2        *( ( volatile unsigned int * ) ( 0x42621408UL ) )
    #define bFM3_INTREQ_IRQ35MON_USB0INT3        *( ( volatile unsigned int * ) ( 0x4262140CUL ) )
    #define bFM3_INTREQ_IRQ35MON_USB0INT4        *( ( volatile unsigned int * ) ( 0x42621410UL ) )
    #define bFM3_INTREQ_IRQ38MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621580UL ) )
    #define bFM3_INTREQ_IRQ39MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621600UL ) )
    #define bFM3_INTREQ_IRQ40MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621680UL ) )
    #define bFM3_INTREQ_IRQ41MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621700UL ) )
    #define bFM3_INTREQ_IRQ42MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621780UL ) )
    #define bFM3_INTREQ_IRQ43MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621800UL ) )
    #define bFM3_INTREQ_IRQ44MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621880UL ) )
    #define bFM3_INTREQ_IRQ45MON_DMAINT          *( ( volatile unsigned int * ) ( 0x42621900UL ) )

