FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* General purpose I/O registers */
    #define bFM3_GPIO_PFR0_P0                    *( ( volatile unsigned int * ) ( 0x42660000UL ) )
    #define bFM3_GPIO_PFR0_P1                    *( ( volatile unsigned int * ) ( 0x42660004UL ) )
    #define bFM3_GPIO_PFR0_P2                    *( ( volatile unsigned int * ) ( 0x42660008UL ) )
    #define bFM3_GPIO_PFR0_P3                    *( ( volatile unsigned int * ) ( 0x4266000CUL ) )
    #define bFM3_GPIO_PFR0_P4                    *( ( volatile unsigned int * ) ( 0x42660010UL ) )
    #define bFM3_GPIO_PFR0_P5                    *( ( volatile unsigned int * ) ( 0x42660014UL ) )
    #define bFM3_GPIO_PFR0_P6                    *( ( volatile unsigned int * ) ( 0x42660018UL ) )
    #define bFM3_GPIO_PFR0_P7                    *( ( volatile unsigned int * ) ( 0x4266001CUL ) )
    #define bFM3_GPIO_PFR0_P8                    *( ( volatile unsigned int * ) ( 0x42660020UL ) )
    #define bFM3_GPIO_PFR0_P9                    *( ( volatile unsigned int * ) ( 0x42660024UL ) )
    #define bFM3_GPIO_PFR0_PA                    *( ( volatile unsigned int * ) ( 0x42660028UL ) )
    #define bFM3_GPIO_PFR0_PB                    *( ( volatile unsigned int * ) ( 0x4266002CUL ) )
    #define bFM3_GPIO_PFR0_PC                    *( ( volatile unsigned int * ) ( 0x42660030UL ) )
    #define bFM3_GPIO_PFR0_PD                    *( ( volatile unsigned int * ) ( 0x42660034UL ) )
    #define bFM3_GPIO_PFR0_PE                    *( ( volatile unsigned int * ) ( 0x42660038UL ) )
    #define bFM3_GPIO_PFR0_PF                    *( ( volatile unsigned int * ) ( 0x4266003CUL ) )
    #define bFM3_GPIO_PFR1_P0                    *( ( volatile unsigned int * ) ( 0x42660080UL ) )
    #define bFM3_GPIO_PFR1_P1                    *( ( volatile unsigned int * ) ( 0x42660084UL ) )
    #define bFM3_GPIO_PFR1_P2                    *( ( volatile unsigned int * ) ( 0x42660088UL ) )
    #define bFM3_GPIO_PFR1_P3                    *( ( volatile unsigned int * ) ( 0x4266008CUL ) )
    #define bFM3_GPIO_PFR1_P4                    *( ( volatile unsigned int * ) ( 0x42660090UL ) )
    #define bFM3_GPIO_PFR1_P5                    *( ( volatile unsigned int * ) ( 0x42660094UL ) )
    #define bFM3_GPIO_PFR1_P6                    *( ( volatile unsigned int * ) ( 0x42660098UL ) )
    #define bFM3_GPIO_PFR1_P7                    *( ( volatile unsigned int * ) ( 0x4266009CUL ) )
    #define bFM3_GPIO_PFR1_P8                    *( ( volatile unsigned int * ) ( 0x426600A0UL ) )
    #define bFM3_GPIO_PFR1_P9                    *( ( volatile unsigned int * ) ( 0x426600A4UL ) )
    #define bFM3_GPIO_PFR1_PA                    *( ( volatile unsigned int * ) ( 0x426600A8UL ) )
    #define bFM3_GPIO_PFR1_PB                    *( ( volatile unsigned int * ) ( 0x426600ACUL ) )
    #define bFM3_GPIO_PFR1_PC                    *( ( volatile unsigned int * ) ( 0x426600B0UL ) )
    #define bFM3_GPIO_PFR1_PD                    *( ( volatile unsigned int * ) ( 0x426600B4UL ) )
    #define bFM3_GPIO_PFR1_PE                    *( ( volatile unsigned int * ) ( 0x426600B8UL ) )
    #define bFM3_GPIO_PFR1_PF                    *( ( volatile unsigned int * ) ( 0x426600BCUL ) )
    #define bFM3_GPIO_PFR2_P0                    *( ( volatile unsigned int * ) ( 0x42660100UL ) )
    #define bFM3_GPIO_PFR2_P1                    *( ( volatile unsigned int * ) ( 0x42660104UL ) )
    #define bFM3_GPIO_PFR2_P2                    *( ( volatile unsigned int * ) ( 0x42660108UL ) )
    #define bFM3_GPIO_PFR2_P3                    *( ( volatile unsigned int * ) ( 0x4266010CUL ) )
    #define bFM3_GPIO_PFR3_P0                    *( ( volatile unsigned int * ) ( 0x42660180UL ) )
    #define bFM3_GPIO_PFR3_P1                    *( ( volatile unsigned int * ) ( 0x42660184UL ) )
    #define bFM3_GPIO_PFR3_P2                    *( ( volatile unsigned int * ) ( 0x42660188UL ) )
    #define bFM3_GPIO_PFR3_P3                    *( ( volatile unsigned int * ) ( 0x4266018CUL ) )
    #define bFM3_GPIO_PFR3_P4                    *( ( volatile unsigned int * ) ( 0x42660190UL ) )
    #define bFM3_GPIO_PFR3_P5                    *( ( volatile unsigned int * ) ( 0x42660194UL ) )
    #define bFM3_GPIO_PFR3_P6                    *( ( volatile unsigned int * ) ( 0x42660198UL ) )
    #define bFM3_GPIO_PFR3_P7                    *( ( volatile unsigned int * ) ( 0x4266019CUL ) )
    #define bFM3_GPIO_PFR3_P8                    *( ( volatile unsigned int * ) ( 0x426601A0UL ) )
    #define bFM3_GPIO_PFR3_P9                    *( ( volatile unsigned int * ) ( 0x426601A4UL ) )
    #define bFM3_GPIO_PFR3_PA                    *( ( volatile unsigned int * ) ( 0x426601A8UL ) )
    #define bFM3_GPIO_PFR3_PB                    *( ( volatile unsigned int * ) ( 0x426601ACUL ) )
    #define bFM3_GPIO_PFR3_PC                    *( ( volatile unsigned int * ) ( 0x426601B0UL ) )
    #define bFM3_GPIO_PFR3_PD                    *( ( volatile unsigned int * ) ( 0x426601B4UL ) )
    #define bFM3_GPIO_PFR3_PE                    *( ( volatile unsigned int * ) ( 0x426601B8UL ) )
    #define bFM3_GPIO_PFR3_PF                    *( ( volatile unsigned int * ) ( 0x426601BCUL ) )
    #define bFM3_GPIO_PFR4_P0                    *( ( volatile unsigned int * ) ( 0x42660200UL ) )
    #define bFM3_GPIO_PFR4_P1                    *( ( volatile unsigned int * ) ( 0x42660204UL ) )
    #define bFM3_GPIO_PFR4_P2                    *( ( volatile unsigned int * ) ( 0x42660208UL ) )
    #define bFM3_GPIO_PFR4_P3                    *( ( volatile unsigned int * ) ( 0x4266020CUL ) )
    #define bFM3_GPIO_PFR4_P4                    *( ( volatile unsigned int * ) ( 0x42660210UL ) )
    #define bFM3_GPIO_PFR4_P5                    *( ( volatile unsigned int * ) ( 0x42660214UL ) )
    #define bFM3_GPIO_PFR4_P6                    *( ( volatile unsigned int * ) ( 0x42660218UL ) )
    #define bFM3_GPIO_PFR4_P7                    *( ( volatile unsigned int * ) ( 0x4266021CUL ) )
    #define bFM3_GPIO_PFR4_P8                    *( ( volatile unsigned int * ) ( 0x42660220UL ) )
    #define bFM3_GPIO_PFR4_P9                    *( ( volatile unsigned int * ) ( 0x42660224UL ) )
    #define bFM3_GPIO_PFR4_PA                    *( ( volatile unsigned int * ) ( 0x42660228UL ) )
    #define bFM3_GPIO_PFR4_PB                    *( ( volatile unsigned int * ) ( 0x4266022CUL ) )
    #define bFM3_GPIO_PFR4_PC                    *( ( volatile unsigned int * ) ( 0x42660230UL ) )
    #define bFM3_GPIO_PFR4_PD                    *( ( volatile unsigned int * ) ( 0x42660234UL ) )
    #define bFM3_GPIO_PFR4_PE                    *( ( volatile unsigned int * ) ( 0x42660238UL ) )
    #define bFM3_GPIO_PFR5_P0                    *( ( volatile unsigned int * ) ( 0x42660280UL ) )
    #define bFM3_GPIO_PFR5_P1                    *( ( volatile unsigned int * ) ( 0x42660284UL ) )
    #define bFM3_GPIO_PFR5_P2                    *( ( volatile unsigned int * ) ( 0x42660288UL ) )
    #define bFM3_GPIO_PFR5_P3                    *( ( volatile unsigned int * ) ( 0x4266028CUL ) )
    #define bFM3_GPIO_PFR5_P4                    *( ( volatile unsigned int * ) ( 0x42660290UL ) )
    #define bFM3_GPIO_PFR5_P5                    *( ( volatile unsigned int * ) ( 0x42660294UL ) )
    #define bFM3_GPIO_PFR5_P6                    *( ( volatile unsigned int * ) ( 0x42660298UL ) )
    #define bFM3_GPIO_PFR6_P0                    *( ( volatile unsigned int * ) ( 0x42660300UL ) )
    #define bFM3_GPIO_PFR6_P1                    *( ( volatile unsigned int * ) ( 0x42660304UL ) )
    #define bFM3_GPIO_PFR6_P2                    *( ( volatile unsigned int * ) ( 0x42660308UL ) )
    #define bFM3_GPIO_PFR6_P3                    *( ( volatile unsigned int * ) ( 0x4266030CUL ) )
    #define bFM3_GPIO_PFR8_P0                    *( ( volatile unsigned int * ) ( 0x42660400UL ) )
    #define bFM3_GPIO_PFR8_P1                    *( ( volatile unsigned int * ) ( 0x42660404UL ) )
    #define bFM3_GPIO_PCR0_P0                    *( ( volatile unsigned int * ) ( 0x42662000UL ) )
    #define bFM3_GPIO_PCR0_P1                    *( ( volatile unsigned int * ) ( 0x42662004UL ) )
    #define bFM3_GPIO_PCR0_P2                    *( ( volatile unsigned int * ) ( 0x42662008UL ) )
    #define bFM3_GPIO_PCR0_P3                    *( ( volatile unsigned int * ) ( 0x4266200CUL ) )
    #define bFM3_GPIO_PCR0_P4                    *( ( volatile unsigned int * ) ( 0x42662010UL ) )
    #define bFM3_GPIO_PCR0_P5                    *( ( volatile unsigned int * ) ( 0x42662014UL ) )
    #define bFM3_GPIO_PCR0_P6                    *( ( volatile unsigned int * ) ( 0x42662018UL ) )
    #define bFM3_GPIO_PCR0_P7                    *( ( volatile unsigned int * ) ( 0x4266201CUL ) )
    #define bFM3_GPIO_PCR0_P8                    *( ( volatile unsigned int * ) ( 0x42662020UL ) )
    #define bFM3_GPIO_PCR0_P9                    *( ( volatile unsigned int * ) ( 0x42662024UL ) )
    #define bFM3_GPIO_PCR0_PA                    *( ( volatile unsigned int * ) ( 0x42662028UL ) )
    #define bFM3_GPIO_PCR0_PB                    *( ( volatile unsigned int * ) ( 0x4266202CUL ) )
    #define bFM3_GPIO_PCR0_PC                    *( ( volatile unsigned int * ) ( 0x42662030UL ) )
    #define bFM3_GPIO_PCR0_PD                    *( ( volatile unsigned int * ) ( 0x42662034UL ) )
    #define bFM3_GPIO_PCR0_PE                    *( ( volatile unsigned int * ) ( 0x42662038UL ) )
    #define bFM3_GPIO_PCR0_PF                    *( ( volatile unsigned int * ) ( 0x4266203CUL ) )
    #define bFM3_GPIO_PCR1_P0                    *( ( volatile unsigned int * ) ( 0x42662080UL ) )
    #define bFM3_GPIO_PCR1_P1                    *( ( volatile unsigned int * ) ( 0x42662084UL ) )
    #define bFM3_GPIO_PCR1_P2                    *( ( volatile unsigned int * ) ( 0x42662088UL ) )
    #define bFM3_GPIO_PCR1_P3                    *( ( volatile unsigned int * ) ( 0x4266208CUL ) )
    #define bFM3_GPIO_PCR1_P4                    *( ( volatile unsigned int * ) ( 0x42662090UL ) )
    #define bFM3_GPIO_PCR1_P5                    *( ( volatile unsigned int * ) ( 0x42662094UL ) )
    #define bFM3_GPIO_PCR1_P6                    *( ( volatile unsigned int * ) ( 0x42662098UL ) )
    #define bFM3_GPIO_PCR1_P7                    *( ( volatile unsigned int * ) ( 0x4266209CUL ) )
    #define bFM3_GPIO_PCR1_P8                    *( ( volatile unsigned int * ) ( 0x426620A0UL ) )
    #define bFM3_GPIO_PCR1_P9                    *( ( volatile unsigned int * ) ( 0x426620A4UL ) )
    #define bFM3_GPIO_PCR1_PA                    *( ( volatile unsigned int * ) ( 0x426620A8UL ) )
    #define bFM3_GPIO_PCR1_PB                    *( ( volatile unsigned int * ) ( 0x426620ACUL ) )
    #define bFM3_GPIO_PCR1_PC                    *( ( volatile unsigned int * ) ( 0x426620B0UL ) )
    #define bFM3_GPIO_PCR1_PD                    *( ( volatile unsigned int * ) ( 0x426620B4UL ) )
    #define bFM3_GPIO_PCR1_PE                    *( ( volatile unsigned int * ) ( 0x426620B8UL ) )
    #define bFM3_GPIO_PCR1_PF                    *( ( volatile unsigned int * ) ( 0x426620BCUL ) )
    #define bFM3_GPIO_PCR2_P0                    *( ( volatile unsigned int * ) ( 0x42662100UL ) )
    #define bFM3_GPIO_PCR2_P1                    *( ( volatile unsigned int * ) ( 0x42662104UL ) )
    #define bFM3_GPIO_PCR2_P2                    *( ( volatile unsigned int * ) ( 0x42662108UL ) )
    #define bFM3_GPIO_PCR2_P3                    *( ( volatile unsigned int * ) ( 0x4266210CUL ) )
    #define bFM3_GPIO_PCR3_P0                    *( ( volatile unsigned int * ) ( 0x42662180UL ) )
    #define bFM3_GPIO_PCR3_P1                    *( ( volatile unsigned int * ) ( 0x42662184UL ) )
    #define bFM3_GPIO_PCR3_P2                    *( ( volatile unsigned int * ) ( 0x42662188UL ) )
    #define bFM3_GPIO_PCR3_P3                    *( ( volatile unsigned int * ) ( 0x4266218CUL ) )
    #define bFM3_GPIO_PCR3_P4                    *( ( volatile unsigned int * ) ( 0x42662190UL ) )
    #define bFM3_GPIO_PCR3_P5                    *( ( volatile unsigned int * ) ( 0x42662194UL ) )
    #define bFM3_GPIO_PCR3_P6                    *( ( volatile unsigned int * ) ( 0x42662198UL ) )
    #define bFM3_GPIO_PCR3_P7                    *( ( volatile unsigned int * ) ( 0x4266219CUL ) )
    #define bFM3_GPIO_PCR3_P8                    *( ( volatile unsigned int * ) ( 0x426621A0UL ) )
    #define bFM3_GPIO_PCR3_P9                    *( ( volatile unsigned int * ) ( 0x426621A4UL ) )
    #define bFM3_GPIO_PCR3_PA                    *( ( volatile unsigned int * ) ( 0x426621A8UL ) )
    #define bFM3_GPIO_PCR3_PB                    *( ( volatile unsigned int * ) ( 0x426621ACUL ) )
    #define bFM3_GPIO_PCR3_PC                    *( ( volatile unsigned int * ) ( 0x426621B0UL ) )
    #define bFM3_GPIO_PCR3_PD                    *( ( volatile unsigned int * ) ( 0x426621B4UL ) )
    #define bFM3_GPIO_PCR3_PE                    *( ( volatile unsigned int * ) ( 0x426621B8UL ) )
    #define bFM3_GPIO_PCR3_PF                    *( ( volatile unsigned int * ) ( 0x426621BCUL ) )
    #define bFM3_GPIO_PCR4_P0                    *( ( volatile unsigned int * ) ( 0x42662200UL ) )
    #define bFM3_GPIO_PCR4_P1                    *( ( volatile unsigned int * ) ( 0x42662204UL ) )
    #define bFM3_GPIO_PCR4_P2                    *( ( volatile unsigned int * ) ( 0x42662208UL ) )
    #define bFM3_GPIO_PCR4_P3                    *( ( volatile unsigned int * ) ( 0x4266220CUL ) )
    #define bFM3_GPIO_PCR4_P4                    *( ( volatile unsigned int * ) ( 0x42662210UL ) )
    #define bFM3_GPIO_PCR4_P5                    *( ( volatile unsigned int * ) ( 0x42662214UL ) )
    #define bFM3_GPIO_PCR4_P6                    *( ( volatile unsigned int * ) ( 0x42662218UL ) )
    #define bFM3_GPIO_PCR4_P7                    *( ( volatile unsigned int * ) ( 0x4266221CUL ) )
    #define bFM3_GPIO_PCR4_P8                    *( ( volatile unsigned int * ) ( 0x42662220UL ) )
    #define bFM3_GPIO_PCR4_P9                    *( ( volatile unsigned int * ) ( 0x42662224UL ) )
    #define bFM3_GPIO_PCR4_PA                    *( ( volatile unsigned int * ) ( 0x42662228UL ) )
    #define bFM3_GPIO_PCR4_PB                    *( ( volatile unsigned int * ) ( 0x4266222CUL ) )
    #define bFM3_GPIO_PCR4_PC                    *( ( volatile unsigned int * ) ( 0x42662230UL ) )
    #define bFM3_GPIO_PCR4_PD                    *( ( volatile unsigned int * ) ( 0x42662234UL ) )
    #define bFM3_GPIO_PCR4_PE                    *( ( volatile unsigned int * ) ( 0x42662238UL ) )
    #define bFM3_GPIO_PCR5_P0                    *( ( volatile unsigned int * ) ( 0x42662280UL ) )
    #define bFM3_GPIO_PCR5_P1                    *( ( volatile unsigned int * ) ( 0x42662284UL ) )
    #define bFM3_GPIO_PCR5_P2                    *( ( volatile unsigned int * ) ( 0x42662288UL ) )
    #define bFM3_GPIO_PCR5_P3                    *( ( volatile unsigned int * ) ( 0x4266228CUL ) )
    #define bFM3_GPIO_PCR5_P4                    *( ( volatile unsigned int * ) ( 0x42662290UL ) )
    #define bFM3_GPIO_PCR5_P5                    *( ( volatile unsigned int * ) ( 0x42662294UL ) )
    #define bFM3_GPIO_PCR5_P6                    *( ( volatile unsigned int * ) ( 0x42662298UL ) )
    #define bFM3_GPIO_PCR6_P0                    *( ( volatile unsigned int * ) ( 0x42662300UL ) )
    #define bFM3_GPIO_PCR6_P1                    *( ( volatile unsigned int * ) ( 0x42662304UL ) )
    #define bFM3_GPIO_PCR6_P2                    *( ( volatile unsigned int * ) ( 0x42662308UL ) )
    #define bFM3_GPIO_PCR6_P3                    *( ( volatile unsigned int * ) ( 0x4266230CUL ) )
    #define bFM3_GPIO_DDR0_P0                    *( ( volatile unsigned int * ) ( 0x42664000UL ) )
    #define bFM3_GPIO_DDR0_P1                    *( ( volatile unsigned int * ) ( 0x42664004UL ) )
    #define bFM3_GPIO_DDR0_P2                    *( ( volatile unsigned int * ) ( 0x42664008UL ) )
    #define bFM3_GPIO_DDR0_P3                    *( ( volatile unsigned int * ) ( 0x4266400CUL ) )
    #define bFM3_GPIO_DDR0_P4                    *( ( volatile unsigned int * ) ( 0x42664010UL ) )
    #define bFM3_GPIO_DDR0_P5                    *( ( volatile unsigned int * ) ( 0x42664014UL ) )
    #define bFM3_GPIO_DDR0_P6                    *( ( volatile unsigned int * ) ( 0x42664018UL ) )
    #define bFM3_GPIO_DDR0_P7                    *( ( volatile unsigned int * ) ( 0x4266401CUL ) )
    #define bFM3_GPIO_DDR0_P8                    *( ( volatile unsigned int * ) ( 0x42664020UL ) )
    #define bFM3_GPIO_DDR0_P9                    *( ( volatile unsigned int * ) ( 0x42664024UL ) )
    #define bFM3_GPIO_DDR0_PA                    *( ( volatile unsigned int * ) ( 0x42664028UL ) )
    #define bFM3_GPIO_DDR0_PB                    *( ( volatile unsigned int * ) ( 0x4266402CUL ) )
    #define bFM3_GPIO_DDR0_PC                    *( ( volatile unsigned int * ) ( 0x42664030UL ) )
    #define bFM3_GPIO_DDR0_PD                    *( ( volatile unsigned int * ) ( 0x42664034UL ) )
    #define bFM3_GPIO_DDR0_PE                    *( ( volatile unsigned int * ) ( 0x42664038UL ) )
    #define bFM3_GPIO_DDR0_PF                    *( ( volatile unsigned int * ) ( 0x4266403CUL ) )
    #define bFM3_GPIO_DDR1_P0                    *( ( volatile unsigned int * ) ( 0x42664080UL ) )
    #define bFM3_GPIO_DDR1_P1                    *( ( volatile unsigned int * ) ( 0x42664084UL ) )
    #define bFM3_GPIO_DDR1_P2                    *( ( volatile unsigned int * ) ( 0x42664088UL ) )
    #define bFM3_GPIO_DDR1_P3                    *( ( volatile unsigned int * ) ( 0x4266408CUL ) )
    #define bFM3_GPIO_DDR1_P4                    *( ( volatile unsigned int * ) ( 0x42664090UL ) )
    #define bFM3_GPIO_DDR1_P5                    *( ( volatile unsigned int * ) ( 0x42664094UL ) )
    #define bFM3_GPIO_DDR1_P6                    *( ( volatile unsigned int * ) ( 0x42664098UL ) )
    #define bFM3_GPIO_DDR1_P7                    *( ( volatile unsigned int * ) ( 0x4266409CUL ) )
    #define bFM3_GPIO_DDR1_P8                    *( ( volatile unsigned int * ) ( 0x426640A0UL ) )
    #define bFM3_GPIO_DDR1_P9                    *( ( volatile unsigned int * ) ( 0x426640A4UL ) )
    #define bFM3_GPIO_DDR1_PA                    *( ( volatile unsigned int * ) ( 0x426640A8UL ) )
    #define bFM3_GPIO_DDR1_PB                    *( ( volatile unsigned int * ) ( 0x426640ACUL ) )
    #define bFM3_GPIO_DDR1_PC                    *( ( volatile unsigned int * ) ( 0x426640B0UL ) )
    #define bFM3_GPIO_DDR1_PD                    *( ( volatile unsigned int * ) ( 0x426640B4UL ) )
    #define bFM3_GPIO_DDR1_PE                    *( ( volatile unsigned int * ) ( 0x426640B8UL ) )
    #define bFM3_GPIO_DDR1_PF                    *( ( volatile unsigned int * ) ( 0x426640BCUL ) )
    #define bFM3_GPIO_DDR2_P0                    *( ( volatile unsigned int * ) ( 0x42664100UL ) )
    #define bFM3_GPIO_DDR2_P1                    *( ( volatile unsigned int * ) ( 0x42664104UL ) )
    #define bFM3_GPIO_DDR2_P2                    *( ( volatile unsigned int * ) ( 0x42664108UL ) )
    #define bFM3_GPIO_DDR2_P3                    *( ( volatile unsigned int * ) ( 0x4266410CUL ) )
    #define bFM3_GPIO_DDR3_P0                    *( ( volatile unsigned int * ) ( 0x42664180UL ) )
    #define bFM3_GPIO_DDR3_P1                    *( ( volatile unsigned int * ) ( 0x42664184UL ) )
    #define bFM3_GPIO_DDR3_P2                    *( ( volatile unsigned int * ) ( 0x42664188UL ) )
    #define bFM3_GPIO_DDR3_P3                    *( ( volatile unsigned int * ) ( 0x4266418CUL ) )
    #define bFM3_GPIO_DDR3_P4                    *( ( volatile unsigned int * ) ( 0x42664190UL ) )
    #define bFM3_GPIO_DDR3_P5                    *( ( volatile unsigned int * ) ( 0x42664194UL ) )
    #define bFM3_GPIO_DDR3_P6                    *( ( volatile unsigned int * ) ( 0x42664198UL ) )
    #define bFM3_GPIO_DDR3_P7                    *( ( volatile unsigned int * ) ( 0x4266419CUL ) )
    #define bFM3_GPIO_DDR3_P8                    *( ( volatile unsigned int * ) ( 0x426641A0UL ) )
    #define bFM3_GPIO_DDR3_P9                    *( ( volatile unsigned int * ) ( 0x426641A4UL ) )
    #define bFM3_GPIO_DDR3_PA                    *( ( volatile unsigned int * ) ( 0x426641A8UL ) )
    #define bFM3_GPIO_DDR3_PB                    *( ( volatile unsigned int * ) ( 0x426641ACUL ) )
    #define bFM3_GPIO_DDR3_PC                    *( ( volatile unsigned int * ) ( 0x426641B0UL ) )
    #define bFM3_GPIO_DDR3_PD                    *( ( volatile unsigned int * ) ( 0x426641B4UL ) )
    #define bFM3_GPIO_DDR3_PE                    *( ( volatile unsigned int * ) ( 0x426641B8UL ) )
    #define bFM3_GPIO_DDR3_PF                    *( ( volatile unsigned int * ) ( 0x426641BCUL ) )
    #define bFM3_GPIO_DDR4_P0                    *( ( volatile unsigned int * ) ( 0x42664200UL ) )
    #define bFM3_GPIO_DDR4_P1                    *( ( volatile unsigned int * ) ( 0x42664204UL ) )
    #define bFM3_GPIO_DDR4_P2                    *( ( volatile unsigned int * ) ( 0x42664208UL ) )
    #define bFM3_GPIO_DDR4_P3                    *( ( volatile unsigned int * ) ( 0x4266420CUL ) )
    #define bFM3_GPIO_DDR4_P4                    *( ( volatile unsigned int * ) ( 0x42664210UL ) )
    #define bFM3_GPIO_DDR4_P5                    *( ( volatile unsigned int * ) ( 0x42664214UL ) )
    #define bFM3_GPIO_DDR4_P6                    *( ( volatile unsigned int * ) ( 0x42664218UL ) )
    #define bFM3_GPIO_DDR4_P7                    *( ( volatile unsigned int * ) ( 0x4266421CUL ) )
    #define bFM3_GPIO_DDR4_P8                    *( ( volatile unsigned int * ) ( 0x42664220UL ) )
    #define bFM3_GPIO_DDR4_P9                    *( ( volatile unsigned int * ) ( 0x42664224UL ) )
    #define bFM3_GPIO_DDR4_PA                    *( ( volatile unsigned int * ) ( 0x42664228UL ) )
    #define bFM3_GPIO_DDR4_PB                    *( ( volatile unsigned int * ) ( 0x4266422CUL ) )
    #define bFM3_GPIO_DDR4_PC                    *( ( volatile unsigned int * ) ( 0x42664230UL ) )
    #define bFM3_GPIO_DDR4_PD                    *( ( volatile unsigned int * ) ( 0x42664234UL ) )
    #define bFM3_GPIO_DDR4_PE                    *( ( volatile unsigned int * ) ( 0x42664238UL ) )
    #define bFM3_GPIO_DDR5_P0                    *( ( volatile unsigned int * ) ( 0x42664280UL ) )
    #define bFM3_GPIO_DDR5_P1                    *( ( volatile unsigned int * ) ( 0x42664284UL ) )
    #define bFM3_GPIO_DDR5_P2                    *( ( volatile unsigned int * ) ( 0x42664288UL ) )
    #define bFM3_GPIO_DDR5_P3                    *( ( volatile unsigned int * ) ( 0x4266428CUL ) )
    #define bFM3_GPIO_DDR5_P4                    *( ( volatile unsigned int * ) ( 0x42664290UL ) )
    #define bFM3_GPIO_DDR5_P5                    *( ( volatile unsigned int * ) ( 0x42664294UL ) )
    #define bFM3_GPIO_DDR5_P6                    *( ( volatile unsigned int * ) ( 0x42664298UL ) )
    #define bFM3_GPIO_DDR6_P0                    *( ( volatile unsigned int * ) ( 0x42664300UL ) )
    #define bFM3_GPIO_DDR6_P1                    *( ( volatile unsigned int * ) ( 0x42664304UL ) )
    #define bFM3_GPIO_DDR6_P2                    *( ( volatile unsigned int * ) ( 0x42664308UL ) )
    #define bFM3_GPIO_DDR6_P3                    *( ( volatile unsigned int * ) ( 0x4266430CUL ) )
    #define bFM3_GPIO_DDR8_P0                    *( ( volatile unsigned int * ) ( 0x42664400UL ) )
    #define bFM3_GPIO_DDR8_P1                    *( ( volatile unsigned int * ) ( 0x42664404UL ) )
    #define bFM3_GPIO_PDIR0_P0                   *( ( volatile unsigned int * ) ( 0x42666000UL ) )
    #define bFM3_GPIO_PDIR0_P1                   *( ( volatile unsigned int * ) ( 0x42666004UL ) )
    #define bFM3_GPIO_PDIR0_P2                   *( ( volatile unsigned int * ) ( 0x42666008UL ) )
    #define bFM3_GPIO_PDIR0_P3                   *( ( volatile unsigned int * ) ( 0x4266600CUL ) )
