FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_GPIO_PDIR0_P4                   *( ( volatile unsigned int * ) ( 0x42666010UL ) )
    #define bFM3_GPIO_PDIR0_P5                   *( ( volatile unsigned int * ) ( 0x42666014UL ) )
    #define bFM3_GPIO_PDIR0_P6                   *( ( volatile unsigned int * ) ( 0x42666018UL ) )
    #define bFM3_GPIO_PDIR0_P7                   *( ( volatile unsigned int * ) ( 0x4266601CUL ) )
    #define bFM3_GPIO_PDIR0_P8                   *( ( volatile unsigned int * ) ( 0x42666020UL ) )
    #define bFM3_GPIO_PDIR0_P9                   *( ( volatile unsigned int * ) ( 0x42666024UL ) )
    #define bFM3_GPIO_PDIR0_PA                   *( ( volatile unsigned int * ) ( 0x42666028UL ) )
    #define bFM3_GPIO_PDIR0_PB                   *( ( volatile unsigned int * ) ( 0x4266602CUL ) )
    #define bFM3_GPIO_PDIR0_PC                   *( ( volatile unsigned int * ) ( 0x42666030UL ) )
    #define bFM3_GPIO_PDIR0_PD                   *( ( volatile unsigned int * ) ( 0x42666034UL ) )
    #define bFM3_GPIO_PDIR0_PE                   *( ( volatile unsigned int * ) ( 0x42666038UL ) )
    #define bFM3_GPIO_PDIR0_PF                   *( ( volatile unsigned int * ) ( 0x4266603CUL ) )
    #define bFM3_GPIO_PDIR1_P0                   *( ( volatile unsigned int * ) ( 0x42666080UL ) )
    #define bFM3_GPIO_PDIR1_P1                   *( ( volatile unsigned int * ) ( 0x42666084UL ) )
    #define bFM3_GPIO_PDIR1_P2                   *( ( volatile unsigned int * ) ( 0x42666088UL ) )
    #define bFM3_GPIO_PDIR1_P3                   *( ( volatile unsigned int * ) ( 0x4266608CUL ) )
    #define bFM3_GPIO_PDIR1_P4                   *( ( volatile unsigned int * ) ( 0x42666090UL ) )
    #define bFM3_GPIO_PDIR1_P5                   *( ( volatile unsigned int * ) ( 0x42666094UL ) )
    #define bFM3_GPIO_PDIR1_P6                   *( ( volatile unsigned int * ) ( 0x42666098UL ) )
    #define bFM3_GPIO_PDIR1_P7                   *( ( volatile unsigned int * ) ( 0x4266609CUL ) )
    #define bFM3_GPIO_PDIR1_P8                   *( ( volatile unsigned int * ) ( 0x426660A0UL ) )
    #define bFM3_GPIO_PDIR1_P9                   *( ( volatile unsigned int * ) ( 0x426660A4UL ) )
    #define bFM3_GPIO_PDIR1_PA                   *( ( volatile unsigned int * ) ( 0x426660A8UL ) )
    #define bFM3_GPIO_PDIR1_PB                   *( ( volatile unsigned int * ) ( 0x426660ACUL ) )
    #define bFM3_GPIO_PDIR1_PC                   *( ( volatile unsigned int * ) ( 0x426660B0UL ) )
    #define bFM3_GPIO_PDIR1_PD                   *( ( volatile unsigned int * ) ( 0x426660B4UL ) )
    #define bFM3_GPIO_PDIR1_PE                   *( ( volatile unsigned int * ) ( 0x426660B8UL ) )
    #define bFM3_GPIO_PDIR1_PF                   *( ( volatile unsigned int * ) ( 0x426660BCUL ) )
    #define bFM3_GPIO_PDIR2_P0                   *( ( volatile unsigned int * ) ( 0x42666100UL ) )
    #define bFM3_GPIO_PDIR2_P1                   *( ( volatile unsigned int * ) ( 0x42666104UL ) )
    #define bFM3_GPIO_PDIR2_P2                   *( ( volatile unsigned int * ) ( 0x42666108UL ) )
    #define bFM3_GPIO_PDIR2_P3                   *( ( volatile unsigned int * ) ( 0x4266610CUL ) )
    #define bFM3_GPIO_PDIR3_P0                   *( ( volatile unsigned int * ) ( 0x42666180UL ) )
    #define bFM3_GPIO_PDIR3_P1                   *( ( volatile unsigned int * ) ( 0x42666184UL ) )
    #define bFM3_GPIO_PDIR3_P2                   *( ( volatile unsigned int * ) ( 0x42666188UL ) )
    #define bFM3_GPIO_PDIR3_P3                   *( ( volatile unsigned int * ) ( 0x4266618CUL ) )
    #define bFM3_GPIO_PDIR3_P4                   *( ( volatile unsigned int * ) ( 0x42666190UL ) )
    #define bFM3_GPIO_PDIR3_P5                   *( ( volatile unsigned int * ) ( 0x42666194UL ) )
    #define bFM3_GPIO_PDIR3_P6                   *( ( volatile unsigned int * ) ( 0x42666198UL ) )
    #define bFM3_GPIO_PDIR3_P7                   *( ( volatile unsigned int * ) ( 0x4266619CUL ) )
    #define bFM3_GPIO_PDIR3_P8                   *( ( volatile unsigned int * ) ( 0x426661A0UL ) )
    #define bFM3_GPIO_PDIR3_P9                   *( ( volatile unsigned int * ) ( 0x426661A4UL ) )
    #define bFM3_GPIO_PDIR3_PA                   *( ( volatile unsigned int * ) ( 0x426661A8UL ) )
    #define bFM3_GPIO_PDIR3_PB                   *( ( volatile unsigned int * ) ( 0x426661ACUL ) )
    #define bFM3_GPIO_PDIR3_PC                   *( ( volatile unsigned int * ) ( 0x426661B0UL ) )
    #define bFM3_GPIO_PDIR3_PD                   *( ( volatile unsigned int * ) ( 0x426661B4UL ) )
    #define bFM3_GPIO_PDIR3_PE                   *( ( volatile unsigned int * ) ( 0x426661B8UL ) )
    #define bFM3_GPIO_PDIR3_PF                   *( ( volatile unsigned int * ) ( 0x426661BCUL ) )
    #define bFM3_GPIO_PDIR4_P0                   *( ( volatile unsigned int * ) ( 0x42666200UL ) )
    #define bFM3_GPIO_PDIR4_P1                   *( ( volatile unsigned int * ) ( 0x42666204UL ) )
    #define bFM3_GPIO_PDIR4_P2                   *( ( volatile unsigned int * ) ( 0x42666208UL ) )
    #define bFM3_GPIO_PDIR4_P3                   *( ( volatile unsigned int * ) ( 0x4266620CUL ) )
    #define bFM3_GPIO_PDIR4_P4                   *( ( volatile unsigned int * ) ( 0x42666210UL ) )
    #define bFM3_GPIO_PDIR4_P5                   *( ( volatile unsigned int * ) ( 0x42666214UL ) )
    #define bFM3_GPIO_PDIR4_P6                   *( ( volatile unsigned int * ) ( 0x42666218UL ) )
    #define bFM3_GPIO_PDIR4_P7                   *( ( volatile unsigned int * ) ( 0x4266621CUL ) )
    #define bFM3_GPIO_PDIR4_P8                   *( ( volatile unsigned int * ) ( 0x42666220UL ) )
    #define bFM3_GPIO_PDIR4_P9                   *( ( volatile unsigned int * ) ( 0x42666224UL ) )
    #define bFM3_GPIO_PDIR4_PA                   *( ( volatile unsigned int * ) ( 0x42666228UL ) )
    #define bFM3_GPIO_PDIR4_PB                   *( ( volatile unsigned int * ) ( 0x4266622CUL ) )
    #define bFM3_GPIO_PDIR4_PC                   *( ( volatile unsigned int * ) ( 0x42666230UL ) )
    #define bFM3_GPIO_PDIR4_PD                   *( ( volatile unsigned int * ) ( 0x42666234UL ) )
    #define bFM3_GPIO_PDIR4_PE                   *( ( volatile unsigned int * ) ( 0x42666238UL ) )
    #define bFM3_GPIO_PDIR5_P0                   *( ( volatile unsigned int * ) ( 0x42666280UL ) )
    #define bFM3_GPIO_PDIR5_P1                   *( ( volatile unsigned int * ) ( 0x42666284UL ) )
    #define bFM3_GPIO_PDIR5_P2                   *( ( volatile unsigned int * ) ( 0x42666288UL ) )
    #define bFM3_GPIO_PDIR5_P3                   *( ( volatile unsigned int * ) ( 0x4266628CUL ) )
    #define bFM3_GPIO_PDIR5_P4                   *( ( volatile unsigned int * ) ( 0x42666290UL ) )
    #define bFM3_GPIO_PDIR5_P5                   *( ( volatile unsigned int * ) ( 0x42666294UL ) )
    #define bFM3_GPIO_PDIR5_P6                   *( ( volatile unsigned int * ) ( 0x42666298UL ) )
    #define bFM3_GPIO_PDIR6_P0                   *( ( volatile unsigned int * ) ( 0x42666300UL ) )
    #define bFM3_GPIO_PDIR6_P1                   *( ( volatile unsigned int * ) ( 0x42666304UL ) )
    #define bFM3_GPIO_PDIR6_P2                   *( ( volatile unsigned int * ) ( 0x42666308UL ) )
    #define bFM3_GPIO_PDIR6_P3                   *( ( volatile unsigned int * ) ( 0x4266630CUL ) )
    #define bFM3_GPIO_PDIR8_P0                   *( ( volatile unsigned int * ) ( 0x42666400UL ) )
    #define bFM3_GPIO_PDIR8_P1                   *( ( volatile unsigned int * ) ( 0x42666404UL ) )
    #define bFM3_GPIO_PDOR0_P0                   *( ( volatile unsigned int * ) ( 0x42668000UL ) )
    #define bFM3_GPIO_PDOR0_P1                   *( ( volatile unsigned int * ) ( 0x42668004UL ) )
    #define bFM3_GPIO_PDOR0_P2                   *( ( volatile unsigned int * ) ( 0x42668008UL ) )
    #define bFM3_GPIO_PDOR0_P3                   *( ( volatile unsigned int * ) ( 0x4266800CUL ) )
    #define bFM3_GPIO_PDOR0_P4                   *( ( volatile unsigned int * ) ( 0x42668010UL ) )
    #define bFM3_GPIO_PDOR0_P5                   *( ( volatile unsigned int * ) ( 0x42668014UL ) )
    #define bFM3_GPIO_PDOR0_P6                   *( ( volatile unsigned int * ) ( 0x42668018UL ) )
    #define bFM3_GPIO_PDOR0_P7                   *( ( volatile unsigned int * ) ( 0x4266801CUL ) )
    #define bFM3_GPIO_PDOR0_P8                   *( ( volatile unsigned int * ) ( 0x42668020UL ) )
    #define bFM3_GPIO_PDOR0_P9                   *( ( volatile unsigned int * ) ( 0x42668024UL ) )
    #define bFM3_GPIO_PDOR0_PA                   *( ( volatile unsigned int * ) ( 0x42668028UL ) )
    #define bFM3_GPIO_PDOR0_PB                   *( ( volatile unsigned int * ) ( 0x4266802CUL ) )
    #define bFM3_GPIO_PDOR0_PC                   *( ( volatile unsigned int * ) ( 0x42668030UL ) )
    #define bFM3_GPIO_PDOR0_PD                   *( ( volatile unsigned int * ) ( 0x42668034UL ) )
    #define bFM3_GPIO_PDOR0_PE                   *( ( volatile unsigned int * ) ( 0x42668038UL ) )
    #define bFM3_GPIO_PDOR0_PF                   *( ( volatile unsigned int * ) ( 0x4266803CUL ) )
    #define bFM3_GPIO_PDOR1_P0                   *( ( volatile unsigned int * ) ( 0x42668080UL ) )
    #define bFM3_GPIO_PDOR1_P1                   *( ( volatile unsigned int * ) ( 0x42668084UL ) )
    #define bFM3_GPIO_PDOR1_P2                   *( ( volatile unsigned int * ) ( 0x42668088UL ) )
    #define bFM3_GPIO_PDOR1_P3                   *( ( volatile unsigned int * ) ( 0x4266808CUL ) )
    #define bFM3_GPIO_PDOR1_P4                   *( ( volatile unsigned int * ) ( 0x42668090UL ) )
    #define bFM3_GPIO_PDOR1_P5                   *( ( volatile unsigned int * ) ( 0x42668094UL ) )
    #define bFM3_GPIO_PDOR1_P6                   *( ( volatile unsigned int * ) ( 0x42668098UL ) )
    #define bFM3_GPIO_PDOR1_P7                   *( ( volatile unsigned int * ) ( 0x4266809CUL ) )
    #define bFM3_GPIO_PDOR1_P8                   *( ( volatile unsigned int * ) ( 0x426680A0UL ) )
    #define bFM3_GPIO_PDOR1_P9                   *( ( volatile unsigned int * ) ( 0x426680A4UL ) )
    #define bFM3_GPIO_PDOR1_PA                   *( ( volatile unsigned int * ) ( 0x426680A8UL ) )
    #define bFM3_GPIO_PDOR1_PB                   *( ( volatile unsigned int * ) ( 0x426680ACUL ) )
    #define bFM3_GPIO_PDOR1_PC                   *( ( volatile unsigned int * ) ( 0x426680B0UL ) )
    #define bFM3_GPIO_PDOR1_PD                   *( ( volatile unsigned int * ) ( 0x426680B4UL ) )
    #define bFM3_GPIO_PDOR1_PE                   *( ( volatile unsigned int * ) ( 0x426680B8UL ) )
    #define bFM3_GPIO_PDOR1_PF                   *( ( volatile unsigned int * ) ( 0x426680BCUL ) )
    #define bFM3_GPIO_PDOR2_P0                   *( ( volatile unsigned int * ) ( 0x42668100UL ) )
    #define bFM3_GPIO_PDOR2_P1                   *( ( volatile unsigned int * ) ( 0x42668104UL ) )
    #define bFM3_GPIO_PDOR2_P2                   *( ( volatile unsigned int * ) ( 0x42668108UL ) )
    #define bFM3_GPIO_PDOR2_P3                   *( ( volatile unsigned int * ) ( 0x4266810CUL ) )
    #define bFM3_GPIO_PDOR3_P0                   *( ( volatile unsigned int * ) ( 0x42668180UL ) )
    #define bFM3_GPIO_PDOR3_P1                   *( ( volatile unsigned int * ) ( 0x42668184UL ) )
    #define bFM3_GPIO_PDOR3_P2                   *( ( volatile unsigned int * ) ( 0x42668188UL ) )
    #define bFM3_GPIO_PDOR3_P3                   *( ( volatile unsigned int * ) ( 0x4266818CUL ) )
    #define bFM3_GPIO_PDOR3_P4                   *( ( volatile unsigned int * ) ( 0x42668190UL ) )
    #define bFM3_GPIO_PDOR3_P5                   *( ( volatile unsigned int * ) ( 0x42668194UL ) )
    #define bFM3_GPIO_PDOR3_P6                   *( ( volatile unsigned int * ) ( 0x42668198UL ) )
    #define bFM3_GPIO_PDOR3_P7                   *( ( volatile unsigned int * ) ( 0x4266819CUL ) )
    #define bFM3_GPIO_PDOR3_P8                   *( ( volatile unsigned int * ) ( 0x426681A0UL ) )
    #define bFM3_GPIO_PDOR3_P9                   *( ( volatile unsigned int * ) ( 0x426681A4UL ) )
    #define bFM3_GPIO_PDOR3_PA                   *( ( volatile unsigned int * ) ( 0x426681A8UL ) )
    #define bFM3_GPIO_PDOR3_PB                   *( ( volatile unsigned int * ) ( 0x426681ACUL ) )
    #define bFM3_GPIO_PDOR3_PC                   *( ( volatile unsigned int * ) ( 0x426681B0UL ) )
    #define bFM3_GPIO_PDOR3_PD                   *( ( volatile unsigned int * ) ( 0x426681B4UL ) )
    #define bFM3_GPIO_PDOR3_PE                   *( ( volatile unsigned int * ) ( 0x426681B8UL ) )
    #define bFM3_GPIO_PDOR3_PF                   *( ( volatile unsigned int * ) ( 0x426681BCUL ) )
    #define bFM3_GPIO_PDOR4_P0                   *( ( volatile unsigned int * ) ( 0x42668200UL ) )
    #define bFM3_GPIO_PDOR4_P1                   *( ( volatile unsigned int * ) ( 0x42668204UL ) )
    #define bFM3_GPIO_PDOR4_P2                   *( ( volatile unsigned int * ) ( 0x42668208UL ) )
    #define bFM3_GPIO_PDOR4_P3                   *( ( volatile unsigned int * ) ( 0x4266820CUL ) )
    #define bFM3_GPIO_PDOR4_P4                   *( ( volatile unsigned int * ) ( 0x42668210UL ) )
    #define bFM3_GPIO_PDOR4_P5                   *( ( volatile unsigned int * ) ( 0x42668214UL ) )
    #define bFM3_GPIO_PDOR4_P6                   *( ( volatile unsigned int * ) ( 0x42668218UL ) )
    #define bFM3_GPIO_PDOR4_P7                   *( ( volatile unsigned int * ) ( 0x4266821CUL ) )
    #define bFM3_GPIO_PDOR4_P8                   *( ( volatile unsigned int * ) ( 0x42668220UL ) )
    #define bFM3_GPIO_PDOR4_P9                   *( ( volatile unsigned int * ) ( 0x42668224UL ) )
    #define bFM3_GPIO_PDOR4_PA                   *( ( volatile unsigned int * ) ( 0x42668228UL ) )
    #define bFM3_GPIO_PDOR4_PB                   *( ( volatile unsigned int * ) ( 0x4266822CUL ) )
    #define bFM3_GPIO_PDOR4_PC                   *( ( volatile unsigned int * ) ( 0x42668230UL ) )
    #define bFM3_GPIO_PDOR4_PD                   *( ( volatile unsigned int * ) ( 0x42668234UL ) )
    #define bFM3_GPIO_PDOR4_PE                   *( ( volatile unsigned int * ) ( 0x42668238UL ) )
    #define bFM3_GPIO_PDOR5_P0                   *( ( volatile unsigned int * ) ( 0x42668280UL ) )
    #define bFM3_GPIO_PDOR5_P1                   *( ( volatile unsigned int * ) ( 0x42668284UL ) )
    #define bFM3_GPIO_PDOR5_P2                   *( ( volatile unsigned int * ) ( 0x42668288UL ) )
    #define bFM3_GPIO_PDOR5_P3                   *( ( volatile unsigned int * ) ( 0x4266828CUL ) )
    #define bFM3_GPIO_PDOR5_P4                   *( ( volatile unsigned int * ) ( 0x42668290UL ) )
    #define bFM3_GPIO_PDOR5_P5                   *( ( volatile unsigned int * ) ( 0x42668294UL ) )
    #define bFM3_GPIO_PDOR5_P6                   *( ( volatile unsigned int * ) ( 0x42668298UL ) )
    #define bFM3_GPIO_PDOR6_P0                   *( ( volatile unsigned int * ) ( 0x42668300UL ) )
    #define bFM3_GPIO_PDOR6_P1                   *( ( volatile unsigned int * ) ( 0x42668304UL ) )
    #define bFM3_GPIO_PDOR6_P2                   *( ( volatile unsigned int * ) ( 0x42668308UL ) )
    #define bFM3_GPIO_PDOR6_P3                   *( ( volatile unsigned int * ) ( 0x4266830CUL ) )
    #define bFM3_GPIO_PDOR8_P0                   *( ( volatile unsigned int * ) ( 0x42668400UL ) )
    #define bFM3_GPIO_PDOR8_P1                   *( ( volatile unsigned int * ) ( 0x42668404UL ) )
    #define bFM3_GPIO_ADE_AN0                    *( ( volatile unsigned int * ) ( 0x4266A000UL ) )
    #define bFM3_GPIO_ADE_AN1                    *( ( volatile unsigned int * ) ( 0x4266A004UL ) )
    #define bFM3_GPIO_ADE_AN2                    *( ( volatile unsigned int * ) ( 0x4266A008UL ) )
    #define bFM3_GPIO_ADE_AN3                    *( ( volatile unsigned int * ) ( 0x4266A00CUL ) )
    #define bFM3_GPIO_ADE_AN4                    *( ( volatile unsigned int * ) ( 0x4266A010UL ) )
    #define bFM3_GPIO_ADE_AN5                    *( ( volatile unsigned int * ) ( 0x4266A014UL ) )
    #define bFM3_GPIO_ADE_AN6                    *( ( volatile unsigned int * ) ( 0x4266A018UL ) )
    #define bFM3_GPIO_ADE_AN7                    *( ( volatile unsigned int * ) ( 0x4266A01CUL ) )
    #define bFM3_GPIO_ADE_AN8                    *( ( volatile unsigned int * ) ( 0x4266A020UL ) )
    #define bFM3_GPIO_ADE_AN9                    *( ( volatile unsigned int * ) ( 0x4266A024UL ) )
    #define bFM3_GPIO_ADE_ANA                    *( ( volatile unsigned int * ) ( 0x4266A028UL ) )
    #define bFM3_GPIO_ADE_ANB                    *( ( volatile unsigned int * ) ( 0x4266A02CUL ) )
    #define bFM3_GPIO_ADE_ANC                    *( ( volatile unsigned int * ) ( 0x4266A030UL ) )
    #define bFM3_GPIO_ADE_AND                    *( ( volatile unsigned int * ) ( 0x4266A034UL ) )
    #define bFM3_GPIO_ADE_ANE                    *( ( volatile unsigned int * ) ( 0x4266A038UL ) )
    #define bFM3_GPIO_ADE_ANF                    *( ( volatile unsigned int * ) ( 0x4266A03CUL ) )
    #define bFM3_GPIO_SPSR_SUBXC                 *( ( volatile unsigned int * ) ( 0x4266B000UL ) )
    #define bFM3_GPIO_SPSR_USB0C                 *( ( volatile unsigned int * ) ( 0x4266B010UL ) )
    #define bFM3_GPIO_EPFR00_NMIS                *( ( volatile unsigned int * ) ( 0x4266C000UL ) )
    #define bFM3_GPIO_EPFR00_CROUTE              *( ( volatile unsigned int * ) ( 0x4266C004UL ) )
    #define bFM3_GPIO_EPFR00_USB0PE              *( ( volatile unsigned int * ) ( 0x4266C024UL ) )
    #define bFM3_GPIO_EPFR00_JTAGEN0B            *( ( volatile unsigned int * ) ( 0x4266C040UL ) )
    #define bFM3_GPIO_EPFR00_JTAGEN1S            *( ( volatile unsigned int * ) ( 0x4266C044UL ) )
    #define bFM3_GPIO_EPFR00_TRC0E               *( ( volatile unsigned int * ) ( 0x4266C060UL ) )
    #define bFM3_GPIO_EPFR00_TRC1E               *( ( volatile unsigned int * ) ( 0x4266C064UL ) )
    #define bFM3_GPIO_EPFR01_RTO00E0             *( ( volatile unsigned int * ) ( 0x4266C080UL ) )
    #define bFM3_GPIO_EPFR01_RTO00E1             *( ( volatile unsigned int * ) ( 0x4266C084UL ) )
    #define bFM3_GPIO_EPFR01_RTO01E0             *( ( volatile unsigned int * ) ( 0x4266C088UL ) )
    #define bFM3_GPIO_EPFR01_RTO01E1             *( ( volatile unsigned int * ) ( 0x4266C08CUL ) )
    #define bFM3_GPIO_EPFR01_RTO02E0             *( ( volatile unsigned int * ) ( 0x4266C090UL ) )
    #define bFM3_GPIO_EPFR01_RTO02E1             *( ( volatile unsigned int * ) ( 0x4266C094UL ) )
    #define bFM3_GPIO_EPFR01_RTO03E0             *( ( volatile unsigned int * ) ( 0x4266C098UL ) )
    #define bFM3_GPIO_EPFR01_RTO03E1             *( ( volatile unsigned int * ) ( 0x4266C09CUL ) )
    #define bFM3_GPIO_EPFR01_RTO04E0             *( ( volatile unsigned int * ) ( 0x4266C0A0UL ) )
    #define bFM3_GPIO_EPFR01_RTO04E1             *( ( volatile unsigned int * ) ( 0x4266C0A4UL ) )
    #define bFM3_GPIO_EPFR01_RTO05E0             *( ( volatile unsigned int * ) ( 0x4266C0A8UL ) )
    #define bFM3_GPIO_EPFR01_RTO05E1             *( ( volatile unsigned int * ) ( 0x4266C0ACUL ) )
    #define bFM3_GPIO_EPFR01_DTTI0C              *( ( volatile unsigned int * ) ( 0x4266C0B0UL ) )
    #define bFM3_GPIO_EPFR01_DTTI0S0             *( ( volatile unsigned int * ) ( 0x4266C0C0UL ) )
    #define bFM3_GPIO_EPFR01_DTTI0S1             *( ( volatile unsigned int * ) ( 0x4266C0C4UL ) )
    #define bFM3_GPIO_EPFR01_FRCK0S0             *( ( volatile unsigned int * ) ( 0x4266C0C8UL ) )
    #define bFM3_GPIO_EPFR01_FRCK0S1             *( ( volatile unsigned int * ) ( 0x4266C0CCUL ) )
    #define bFM3_GPIO_EPFR01_IC00S0              *( ( volatile unsigned int * ) ( 0x4266C0D0UL ) )
    #define bFM3_GPIO_EPFR01_IC00S1              *( ( volatile unsigned int * ) ( 0x4266C0D4UL ) )
    #define bFM3_GPIO_EPFR01_IC00S2              *( ( volatile unsigned int * ) ( 0x4266C0D8UL ) )
    #define bFM3_GPIO_EPFR01_IC01S0              *( ( volatile unsigned int * ) ( 0x4266C0DCUL ) )
    #define bFM3_GPIO_EPFR01_IC01S1              *( ( volatile unsigned int * ) ( 0x4266C0E0UL ) )
    #define bFM3_GPIO_EPFR01_IC01S2              *( ( volatile unsigned int * ) ( 0x4266C0E4UL ) )
    #define bFM3_GPIO_EPFR01_IC02S0              *( ( volatile unsigned int * ) ( 0x4266C0E8UL ) )
    #define bFM3_GPIO_EPFR01_IC02S1              *( ( volatile unsigned int * ) ( 0x4266C0ECUL ) )
    #define bFM3_GPIO_EPFR01_IC02S2              *( ( volatile unsigned int * ) ( 0x4266C0F0UL ) )
    #define bFM3_GPIO_EPFR01_IC03S0              *( ( volatile unsigned int * ) ( 0x4266C0F4UL ) )
    #define bFM3_GPIO_EPFR01_IC03S1              *( ( volatile unsigned int * ) ( 0x4266C0F8UL ) )
    #define bFM3_GPIO_EPFR01_IC03S2              *( ( volatile unsigned int * ) ( 0x4266C0FCUL ) )
    #define bFM3_GPIO_EPFR02_RTO10E0             *( ( volatile unsigned int * ) ( 0x4266C100UL ) )
    #define bFM3_GPIO_EPFR02_RTO10E1             *( ( volatile unsigned int * ) ( 0x4266C104UL ) )
    #define bFM3_GPIO_EPFR02_RTO11E0             *( ( volatile unsigned int * ) ( 0x4266C108UL ) )
    #define bFM3_GPIO_EPFR02_RTO11E1             *( ( volatile unsigned int * ) ( 0x4266C10CUL ) )
    #define bFM3_GPIO_EPFR02_RTO12E0             *( ( volatile unsigned int * ) ( 0x4266C110UL ) )
    #define bFM3_GPIO_EPFR02_RTO12E1             *( ( volatile unsigned int * ) ( 0x4266C114UL ) )
    #define bFM3_GPIO_EPFR02_RTO13E0             *( ( volatile unsigned int * ) ( 0x4266C118UL ) )
    #define bFM3_GPIO_EPFR02_RTO13E1             *( ( volatile unsigned int * ) ( 0x4266C11CUL ) )
    #define bFM3_GPIO_EPFR02_RTO14E0             *( ( volatile unsigned int * ) ( 0x4266C120UL ) )
    #define bFM3_GPIO_EPFR02_RTO14E1             *( ( volatile unsigned int * ) ( 0x4266C124UL ) )
    #define bFM3_GPIO_EPFR02_RTO15E0             *( ( volatile unsigned int * ) ( 0x4266C128UL ) )
    #define bFM3_GPIO_EPFR02_RTO15E1             *( ( volatile unsigned int * ) ( 0x4266C12CUL ) )
    #define bFM3_GPIO_EPFR02_DTTI1C              *( ( volatile unsigned int * ) ( 0x4266C130UL ) )
    #define bFM3_GPIO_EPFR02_DTTI1S0             *( ( volatile unsigned int * ) ( 0x4266C140UL ) )
    #define bFM3_GPIO_EPFR02_DTTI1S1             *( ( volatile unsigned int * ) ( 0x4266C144UL ) )
    #define bFM3_GPIO_EPFR02_FRCK1S0             *( ( volatile unsigned int * ) ( 0x4266C148UL ) )
    #define bFM3_GPIO_EPFR02_FRCK1S1             *( ( volatile unsigned int * ) ( 0x4266C14CUL ) )
    #define bFM3_GPIO_EPFR02_IC10S0              *( ( volatile unsigned int * ) ( 0x4266C150UL ) )
    #define bFM3_GPIO_EPFR02_IC10S1              *( ( volatile unsigned int * ) ( 0x4266C154UL ) )
    #define bFM3_GPIO_EPFR02_IC10S2              *( ( volatile unsigned int * ) ( 0x4266C158UL ) )
    #define bFM3_GPIO_EPFR02_IC11S0              *( ( volatile unsigned int * ) ( 0x4266C15CUL ) )
    #define bFM3_GPIO_EPFR02_IC11S1              *( ( volatile unsigned int * ) ( 0x4266C160UL ) )
    #define bFM3_GPIO_EPFR02_IC11S2              *( ( volatile unsigned int * ) ( 0x4266C164UL ) )
    #define bFM3_GPIO_EPFR02_IC12S0              *( ( volatile unsigned int * ) ( 0x4266C168UL ) )
    #define bFM3_GPIO_EPFR02_IC12S1              *( ( volatile unsigned int * ) ( 0x4266C16CUL ) )
    #define bFM3_GPIO_EPFR02_IC12S2              *( ( volatile unsigned int * ) ( 0x4266C170UL ) )
    #define bFM3_GPIO_EPFR02_IC13S0              *( ( volatile unsigned int * ) ( 0x4266C174UL ) )
    #define bFM3_GPIO_EPFR02_IC13S1              *( ( volatile unsigned int * ) ( 0x4266C178UL ) )
    #define bFM3_GPIO_EPFR02_IC13S2              *( ( volatile unsigned int * ) ( 0x4266C17CUL ) )
    #define bFM3_GPIO_EPFR04_TIOA0E0             *( ( volatile unsigned int * ) ( 0x4266C208UL ) )
    #define bFM3_GPIO_EPFR04_TIOA0E1             *( ( volatile unsigned int * ) ( 0x4266C20CUL ) )
    #define bFM3_GPIO_EPFR04_TIOB0S0             *( ( volatile unsigned int * ) ( 0x4266C210UL ) )
