FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_GPIO_EPFR04_TIOB0S1             *( ( volatile unsigned int * ) ( 0x4266C214UL ) )
    #define bFM3_GPIO_EPFR04_TIOA1S0             *( ( volatile unsigned int * ) ( 0x4266C220UL ) )
    #define bFM3_GPIO_EPFR04_TIOA1S1             *( ( volatile unsigned int * ) ( 0x4266C224UL ) )
    #define bFM3_GPIO_EPFR04_TIOA1E0             *( ( volatile unsigned int * ) ( 0x4266C228UL ) )
    #define bFM3_GPIO_EPFR04_TIOA1E1             *( ( volatile unsigned int * ) ( 0x4266C22CUL ) )
    #define bFM3_GPIO_EPFR04_TIOB1S0             *( ( volatile unsigned int * ) ( 0x4266C230UL ) )
    #define bFM3_GPIO_EPFR04_TIOB1S1             *( ( volatile unsigned int * ) ( 0x4266C234UL ) )
    #define bFM3_GPIO_EPFR04_TIOA2E0             *( ( volatile unsigned int * ) ( 0x4266C248UL ) )
    #define bFM3_GPIO_EPFR04_TIOA2E1             *( ( volatile unsigned int * ) ( 0x4266C24CUL ) )
    #define bFM3_GPIO_EPFR04_TIOB2S0             *( ( volatile unsigned int * ) ( 0x4266C250UL ) )
    #define bFM3_GPIO_EPFR04_TIOB2S1             *( ( volatile unsigned int * ) ( 0x4266C254UL ) )
    #define bFM3_GPIO_EPFR04_TIOA3S0             *( ( volatile unsigned int * ) ( 0x4266C260UL ) )
    #define bFM3_GPIO_EPFR04_TIOA3S1             *( ( volatile unsigned int * ) ( 0x4266C264UL ) )
    #define bFM3_GPIO_EPFR04_TIOA3E0             *( ( volatile unsigned int * ) ( 0x4266C268UL ) )
    #define bFM3_GPIO_EPFR04_TIOA3E1             *( ( volatile unsigned int * ) ( 0x4266C26CUL ) )
    #define bFM3_GPIO_EPFR04_TIOB3S0             *( ( volatile unsigned int * ) ( 0x4266C270UL ) )
    #define bFM3_GPIO_EPFR04_TIOB3S1             *( ( volatile unsigned int * ) ( 0x4266C274UL ) )
    #define bFM3_GPIO_EPFR05_TIOA4E0             *( ( volatile unsigned int * ) ( 0x4266C288UL ) )
    #define bFM3_GPIO_EPFR05_TIOA4E1             *( ( volatile unsigned int * ) ( 0x4266C28CUL ) )
    #define bFM3_GPIO_EPFR05_TIOB4S0             *( ( volatile unsigned int * ) ( 0x4266C290UL ) )
    #define bFM3_GPIO_EPFR05_TIOB4S1             *( ( volatile unsigned int * ) ( 0x4266C294UL ) )
    #define bFM3_GPIO_EPFR05_TIOA5S0             *( ( volatile unsigned int * ) ( 0x4266C2A0UL ) )
    #define bFM3_GPIO_EPFR05_TIOA5S1             *( ( volatile unsigned int * ) ( 0x4266C2A4UL ) )
    #define bFM3_GPIO_EPFR05_TIOA5E0             *( ( volatile unsigned int * ) ( 0x4266C2A8UL ) )
    #define bFM3_GPIO_EPFR05_TIOA5E1             *( ( volatile unsigned int * ) ( 0x4266C2ACUL ) )
    #define bFM3_GPIO_EPFR05_TIOB5S0             *( ( volatile unsigned int * ) ( 0x4266C2B0UL ) )
    #define bFM3_GPIO_EPFR05_TIOB5S1             *( ( volatile unsigned int * ) ( 0x4266C2B4UL ) )
    #define bFM3_GPIO_EPFR05_TIOA6E0             *( ( volatile unsigned int * ) ( 0x4266C2C8UL ) )
    #define bFM3_GPIO_EPFR05_TIOA6E1             *( ( volatile unsigned int * ) ( 0x4266C2CCUL ) )
    #define bFM3_GPIO_EPFR05_TIOB6S0             *( ( volatile unsigned int * ) ( 0x4266C2D0UL ) )
    #define bFM3_GPIO_EPFR05_TIOB6S1             *( ( volatile unsigned int * ) ( 0x4266C2D4UL ) )
    #define bFM3_GPIO_EPFR05_TIOA7S0             *( ( volatile unsigned int * ) ( 0x4266C2E0UL ) )
    #define bFM3_GPIO_EPFR05_TIOA7S1             *( ( volatile unsigned int * ) ( 0x4266C2E4UL ) )
    #define bFM3_GPIO_EPFR05_TIOA7E0             *( ( volatile unsigned int * ) ( 0x4266C2E8UL ) )
    #define bFM3_GPIO_EPFR05_TIOA7E1             *( ( volatile unsigned int * ) ( 0x4266C2ECUL ) )
    #define bFM3_GPIO_EPFR05_TIOB7S0             *( ( volatile unsigned int * ) ( 0x4266C2F0UL ) )
    #define bFM3_GPIO_EPFR05_TIOB7S1             *( ( volatile unsigned int * ) ( 0x4266C2F4UL ) )
    #define bFM3_GPIO_EPFR06_EINT00S0            *( ( volatile unsigned int * ) ( 0x4266C300UL ) )
    #define bFM3_GPIO_EPFR06_EINT00S1            *( ( volatile unsigned int * ) ( 0x4266C304UL ) )
    #define bFM3_GPIO_EPFR06_EINT01S0            *( ( volatile unsigned int * ) ( 0x4266C308UL ) )
    #define bFM3_GPIO_EPFR06_EINT01S1            *( ( volatile unsigned int * ) ( 0x4266C30CUL ) )
    #define bFM3_GPIO_EPFR06_EINT02S0            *( ( volatile unsigned int * ) ( 0x4266C310UL ) )
    #define bFM3_GPIO_EPFR06_EINT02S1            *( ( volatile unsigned int * ) ( 0x4266C314UL ) )
    #define bFM3_GPIO_EPFR06_EINT03S0            *( ( volatile unsigned int * ) ( 0x4266C318UL ) )
    #define bFM3_GPIO_EPFR06_EINT03S1            *( ( volatile unsigned int * ) ( 0x4266C31CUL ) )
    #define bFM3_GPIO_EPFR06_EINT04S0            *( ( volatile unsigned int * ) ( 0x4266C320UL ) )
    #define bFM3_GPIO_EPFR06_EINT04S1            *( ( volatile unsigned int * ) ( 0x4266C324UL ) )
    #define bFM3_GPIO_EPFR06_EINT05S0            *( ( volatile unsigned int * ) ( 0x4266C328UL ) )
    #define bFM3_GPIO_EPFR06_EINT05S1            *( ( volatile unsigned int * ) ( 0x4266C32CUL ) )
    #define bFM3_GPIO_EPFR06_EINT06S0            *( ( volatile unsigned int * ) ( 0x4266C330UL ) )
    #define bFM3_GPIO_EPFR06_EINT06S1            *( ( volatile unsigned int * ) ( 0x4266C334UL ) )
    #define bFM3_GPIO_EPFR06_EINT07S0            *( ( volatile unsigned int * ) ( 0x4266C338UL ) )
    #define bFM3_GPIO_EPFR06_EINT07S1            *( ( volatile unsigned int * ) ( 0x4266C33CUL ) )
    #define bFM3_GPIO_EPFR06_EINT08S0            *( ( volatile unsigned int * ) ( 0x4266C340UL ) )
    #define bFM3_GPIO_EPFR06_EINT08S1            *( ( volatile unsigned int * ) ( 0x4266C344UL ) )
    #define bFM3_GPIO_EPFR06_EINT09S0            *( ( volatile unsigned int * ) ( 0x4266C348UL ) )
    #define bFM3_GPIO_EPFR06_EINT09S1            *( ( volatile unsigned int * ) ( 0x4266C34CUL ) )
    #define bFM3_GPIO_EPFR06_EINT10S0            *( ( volatile unsigned int * ) ( 0x4266C350UL ) )
    #define bFM3_GPIO_EPFR06_EINT10S1            *( ( volatile unsigned int * ) ( 0x4266C354UL ) )
    #define bFM3_GPIO_EPFR06_EINT11S0            *( ( volatile unsigned int * ) ( 0x4266C358UL ) )
    #define bFM3_GPIO_EPFR06_EINT11S1            *( ( volatile unsigned int * ) ( 0x4266C35CUL ) )
    #define bFM3_GPIO_EPFR06_EINT12S0            *( ( volatile unsigned int * ) ( 0x4266C360UL ) )
    #define bFM3_GPIO_EPFR06_EINT12S1            *( ( volatile unsigned int * ) ( 0x4266C364UL ) )
    #define bFM3_GPIO_EPFR06_EINT13S0            *( ( volatile unsigned int * ) ( 0x4266C368UL ) )
    #define bFM3_GPIO_EPFR06_EINT13S1            *( ( volatile unsigned int * ) ( 0x4266C36CUL ) )
    #define bFM3_GPIO_EPFR06_EINT14S0            *( ( volatile unsigned int * ) ( 0x4266C370UL ) )
    #define bFM3_GPIO_EPFR06_EINT14S1            *( ( volatile unsigned int * ) ( 0x4266C374UL ) )
    #define bFM3_GPIO_EPFR06_EINT15S0            *( ( volatile unsigned int * ) ( 0x4266C378UL ) )
    #define bFM3_GPIO_EPFR06_EINT15S1            *( ( volatile unsigned int * ) ( 0x4266C37CUL ) )
    #define bFM3_GPIO_EPFR07_SIN0S0              *( ( volatile unsigned int * ) ( 0x4266C390UL ) )
    #define bFM3_GPIO_EPFR07_SIN0S1              *( ( volatile unsigned int * ) ( 0x4266C394UL ) )
    #define bFM3_GPIO_EPFR07_SOT0B0              *( ( volatile unsigned int * ) ( 0x4266C398UL ) )
    #define bFM3_GPIO_EPFR07_SOT0B1              *( ( volatile unsigned int * ) ( 0x4266C39CUL ) )
    #define bFM3_GPIO_EPFR07_SCK0B0              *( ( volatile unsigned int * ) ( 0x4266C3A0UL ) )
    #define bFM3_GPIO_EPFR07_SCK0B1              *( ( volatile unsigned int * ) ( 0x4266C3A4UL ) )
    #define bFM3_GPIO_EPFR07_SIN1S0              *( ( volatile unsigned int * ) ( 0x4266C3A8UL ) )
    #define bFM3_GPIO_EPFR07_SIN1S1              *( ( volatile unsigned int * ) ( 0x4266C3ACUL ) )
    #define bFM3_GPIO_EPFR07_SOT1B0              *( ( volatile unsigned int * ) ( 0x4266C3B0UL ) )
    #define bFM3_GPIO_EPFR07_SOT1B1              *( ( volatile unsigned int * ) ( 0x4266C3B4UL ) )
    #define bFM3_GPIO_EPFR07_SCK1B0              *( ( volatile unsigned int * ) ( 0x4266C3B8UL ) )
    #define bFM3_GPIO_EPFR07_SCK1B1              *( ( volatile unsigned int * ) ( 0x4266C3BCUL ) )
    #define bFM3_GPIO_EPFR07_SIN2S0              *( ( volatile unsigned int * ) ( 0x4266C3C0UL ) )
    #define bFM3_GPIO_EPFR07_SIN2S1              *( ( volatile unsigned int * ) ( 0x4266C3C4UL ) )
    #define bFM3_GPIO_EPFR07_SOT2B0              *( ( volatile unsigned int * ) ( 0x4266C3C8UL ) )
    #define bFM3_GPIO_EPFR07_SOT2B1              *( ( volatile unsigned int * ) ( 0x4266C3CCUL ) )
    #define bFM3_GPIO_EPFR07_SCK2B0              *( ( volatile unsigned int * ) ( 0x4266C3D0UL ) )
    #define bFM3_GPIO_EPFR07_SCK2B1              *( ( volatile unsigned int * ) ( 0x4266C3D4UL ) )
    #define bFM3_GPIO_EPFR07_SIN3S0              *( ( volatile unsigned int * ) ( 0x4266C3D8UL ) )
    #define bFM3_GPIO_EPFR07_SIN3S1              *( ( volatile unsigned int * ) ( 0x4266C3DCUL ) )
    #define bFM3_GPIO_EPFR07_SOT3B0              *( ( volatile unsigned int * ) ( 0x4266C3E0UL ) )
    #define bFM3_GPIO_EPFR07_SOT3B1              *( ( volatile unsigned int * ) ( 0x4266C3E4UL ) )
    #define bFM3_GPIO_EPFR07_SCK3B0              *( ( volatile unsigned int * ) ( 0x4266C3E8UL ) )
    #define bFM3_GPIO_EPFR07_SCK3B1              *( ( volatile unsigned int * ) ( 0x4266C3ECUL ) )
    #define bFM3_GPIO_EPFR08_RTS4E0              *( ( volatile unsigned int * ) ( 0x4266C400UL ) )
    #define bFM3_GPIO_EPFR08_RTS4E1              *( ( volatile unsigned int * ) ( 0x4266C404UL ) )
    #define bFM3_GPIO_EPFR08_CTS4S0              *( ( volatile unsigned int * ) ( 0x4266C408UL ) )
    #define bFM3_GPIO_EPFR08_CTS4S1              *( ( volatile unsigned int * ) ( 0x4266C40CUL ) )
    #define bFM3_GPIO_EPFR08_SIN4S0              *( ( volatile unsigned int * ) ( 0x4266C410UL ) )
    #define bFM3_GPIO_EPFR08_SIN4S1              *( ( volatile unsigned int * ) ( 0x4266C414UL ) )
    #define bFM3_GPIO_EPFR08_SOT4B0              *( ( volatile unsigned int * ) ( 0x4266C418UL ) )
    #define bFM3_GPIO_EPFR08_SOT4B1              *( ( volatile unsigned int * ) ( 0x4266C41CUL ) )
    #define bFM3_GPIO_EPFR08_SCK4B0              *( ( volatile unsigned int * ) ( 0x4266C420UL ) )
    #define bFM3_GPIO_EPFR08_SCK4B1              *( ( volatile unsigned int * ) ( 0x4266C424UL ) )
    #define bFM3_GPIO_EPFR08_SIN5S0              *( ( volatile unsigned int * ) ( 0x4266C428UL ) )
    #define bFM3_GPIO_EPFR08_SIN5S1              *( ( volatile unsigned int * ) ( 0x4266C42CUL ) )
    #define bFM3_GPIO_EPFR08_SOT5B0              *( ( volatile unsigned int * ) ( 0x4266C430UL ) )
    #define bFM3_GPIO_EPFR08_SOT5B1              *( ( volatile unsigned int * ) ( 0x4266C434UL ) )
    #define bFM3_GPIO_EPFR08_SCK5B0              *( ( volatile unsigned int * ) ( 0x4266C438UL ) )
    #define bFM3_GPIO_EPFR08_SCK5B1              *( ( volatile unsigned int * ) ( 0x4266C43CUL ) )
    #define bFM3_GPIO_EPFR08_SIN6S0              *( ( volatile unsigned int * ) ( 0x4266C440UL ) )
    #define bFM3_GPIO_EPFR08_SIN6S1              *( ( volatile unsigned int * ) ( 0x4266C444UL ) )
    #define bFM3_GPIO_EPFR08_SOT6B0              *( ( volatile unsigned int * ) ( 0x4266C448UL ) )
    #define bFM3_GPIO_EPFR08_SOT6B1              *( ( volatile unsigned int * ) ( 0x4266C44CUL ) )
    #define bFM3_GPIO_EPFR08_SCK6B0              *( ( volatile unsigned int * ) ( 0x4266C450UL ) )
    #define bFM3_GPIO_EPFR08_SCK6B1              *( ( volatile unsigned int * ) ( 0x4266C454UL ) )
    #define bFM3_GPIO_EPFR08_SIN7S0              *( ( volatile unsigned int * ) ( 0x4266C458UL ) )
    #define bFM3_GPIO_EPFR08_SIN7S1              *( ( volatile unsigned int * ) ( 0x4266C45CUL ) )
    #define bFM3_GPIO_EPFR08_SOT7B0              *( ( volatile unsigned int * ) ( 0x4266C460UL ) )
    #define bFM3_GPIO_EPFR08_SOT7B1              *( ( volatile unsigned int * ) ( 0x4266C464UL ) )
    #define bFM3_GPIO_EPFR08_SCK7B0              *( ( volatile unsigned int * ) ( 0x4266C468UL ) )
    #define bFM3_GPIO_EPFR08_SCK7B1              *( ( volatile unsigned int * ) ( 0x4266C46CUL ) )
    #define bFM3_GPIO_EPFR09_QAIN0S0             *( ( volatile unsigned int * ) ( 0x4266C480UL ) )
    #define bFM3_GPIO_EPFR09_QAIN0S1             *( ( volatile unsigned int * ) ( 0x4266C484UL ) )
    #define bFM3_GPIO_EPFR09_QBIN0S0             *( ( volatile unsigned int * ) ( 0x4266C488UL ) )
    #define bFM3_GPIO_EPFR09_QBIN0S1             *( ( volatile unsigned int * ) ( 0x4266C48CUL ) )
    #define bFM3_GPIO_EPFR09_QZIN0S0             *( ( volatile unsigned int * ) ( 0x4266C490UL ) )
    #define bFM3_GPIO_EPFR09_QZIN0S1             *( ( volatile unsigned int * ) ( 0x4266C494UL ) )
    #define bFM3_GPIO_EPFR09_QAIN1S0             *( ( volatile unsigned int * ) ( 0x4266C498UL ) )
    #define bFM3_GPIO_EPFR09_QAIN1S1             *( ( volatile unsigned int * ) ( 0x4266C49CUL ) )
    #define bFM3_GPIO_EPFR09_QBIN1S0             *( ( volatile unsigned int * ) ( 0x4266C4A0UL ) )
    #define bFM3_GPIO_EPFR09_QBIN1S1             *( ( volatile unsigned int * ) ( 0x4266C4A4UL ) )
    #define bFM3_GPIO_EPFR09_QZIN1S0             *( ( volatile unsigned int * ) ( 0x4266C4A8UL ) )
    #define bFM3_GPIO_EPFR09_QZIN1S1             *( ( volatile unsigned int * ) ( 0x4266C4ACUL ) )
    #define bFM3_GPIO_EPFR09_ADTRG0S0            *( ( volatile unsigned int * ) ( 0x4266C4B0UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG0S1            *( ( volatile unsigned int * ) ( 0x4266C4B4UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG0S2            *( ( volatile unsigned int * ) ( 0x4266C4B8UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG0S3            *( ( volatile unsigned int * ) ( 0x4266C4BCUL ) )
    #define bFM3_GPIO_EPFR09_ADTRG1S0            *( ( volatile unsigned int * ) ( 0x4266C4C0UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG1S1            *( ( volatile unsigned int * ) ( 0x4266C4C4UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG1S2            *( ( volatile unsigned int * ) ( 0x4266C4C8UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG1S3            *( ( volatile unsigned int * ) ( 0x4266C4CCUL ) )
    #define bFM3_GPIO_EPFR09_ADTRG2S0            *( ( volatile unsigned int * ) ( 0x4266C4D0UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG2S1            *( ( volatile unsigned int * ) ( 0x4266C4D4UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG2S2            *( ( volatile unsigned int * ) ( 0x4266C4D8UL ) )
    #define bFM3_GPIO_EPFR09_ADTRG2S3            *( ( volatile unsigned int * ) ( 0x4266C4DCUL ) )
    #define bFM3_GPIO_EPFR09_CRX0S0              *( ( volatile unsigned int * ) ( 0x4266C4E0UL ) )
    #define bFM3_GPIO_EPFR09_CRX0S1              *( ( volatile unsigned int * ) ( 0x4266C4E4UL ) )
    #define bFM3_GPIO_EPFR09_CTX0E0              *( ( volatile unsigned int * ) ( 0x4266C4E8UL ) )
    #define bFM3_GPIO_EPFR09_CTX0E1              *( ( volatile unsigned int * ) ( 0x4266C4ECUL ) )
    #define bFM3_GPIO_EPFR09_CRX1S0              *( ( volatile unsigned int * ) ( 0x4266C4F0UL ) )
    #define bFM3_GPIO_EPFR09_CRX1S1              *( ( volatile unsigned int * ) ( 0x4266C4F4UL ) )
    #define bFM3_GPIO_EPFR09_CTX1E0              *( ( volatile unsigned int * ) ( 0x4266C4F8UL ) )
    #define bFM3_GPIO_EPFR09_CTX1E1              *( ( volatile unsigned int * ) ( 0x4266C4FCUL ) )
    #define bFM3_GPIO_EPFR10_UEDEFB              *( ( volatile unsigned int * ) ( 0x4266C500UL ) )
    #define bFM3_GPIO_EPFR10_UEDTHB              *( ( volatile unsigned int * ) ( 0x4266C504UL ) )
    #define bFM3_GPIO_EPFR10_TESTB               *( ( volatile unsigned int * ) ( 0x4266C508UL ) )
    #define bFM3_GPIO_EPFR10_UEWEXE              *( ( volatile unsigned int * ) ( 0x4266C50CUL ) )
    #define bFM3_GPIO_EPFR10_UEDQME              *( ( volatile unsigned int * ) ( 0x4266C510UL ) )
    #define bFM3_GPIO_EPFR10_UEOEXE              *( ( volatile unsigned int * ) ( 0x4266C514UL ) )
    #define bFM3_GPIO_EPFR10_UEFLSE              *( ( volatile unsigned int * ) ( 0x4266C518UL ) )
    #define bFM3_GPIO_EPFR10_UECS1E              *( ( volatile unsigned int * ) ( 0x4266C51CUL ) )
    #define bFM3_GPIO_EPFR10_UECS2E              *( ( volatile unsigned int * ) ( 0x4266C520UL ) )
    #define bFM3_GPIO_EPFR10_UECS3E              *( ( volatile unsigned int * ) ( 0x4266C524UL ) )
    #define bFM3_GPIO_EPFR10_UECS4E              *( ( volatile unsigned int * ) ( 0x4266C528UL ) )
    #define bFM3_GPIO_EPFR10_UECS5E              *( ( volatile unsigned int * ) ( 0x4266C52CUL ) )
    #define bFM3_GPIO_EPFR10_UECS6E              *( ( volatile unsigned int * ) ( 0x4266C530UL ) )
    #define bFM3_GPIO_EPFR10_UECS7E              *( ( volatile unsigned int * ) ( 0x4266C534UL ) )
    #define bFM3_GPIO_EPFR10_UEAOOE              *( ( volatile unsigned int * ) ( 0x4266C538UL ) )
    #define bFM3_GPIO_EPFR10_UEA08E              *( ( volatile unsigned int * ) ( 0x4266C53CUL ) )
    #define bFM3_GPIO_EPFR10_UEA09E              *( ( volatile unsigned int * ) ( 0x4266C540UL ) )
    #define bFM3_GPIO_EPFR10_UEA10E              *( ( volatile unsigned int * ) ( 0x4266C544UL ) )
    #define bFM3_GPIO_EPFR10_UEA11E              *( ( volatile unsigned int * ) ( 0x4266C548UL ) )
    #define bFM3_GPIO_EPFR10_UEA12E              *( ( volatile unsigned int * ) ( 0x4266C54CUL ) )
    #define bFM3_GPIO_EPFR10_UEA13E              *( ( volatile unsigned int * ) ( 0x4266C550UL ) )
    #define bFM3_GPIO_EPFR10_UEA14E              *( ( volatile unsigned int * ) ( 0x4266C554UL ) )
    #define bFM3_GPIO_EPFR10_UEA15E              *( ( volatile unsigned int * ) ( 0x4266C558UL ) )
    #define bFM3_GPIO_EPFR10_UEA16E              *( ( volatile unsigned int * ) ( 0x4266C55CUL ) )
    #define bFM3_GPIO_EPFR10_UEA17E              *( ( volatile unsigned int * ) ( 0x4266C560UL ) )
    #define bFM3_GPIO_EPFR10_UEA18E              *( ( volatile unsigned int * ) ( 0x4266C564UL ) )
    #define bFM3_GPIO_EPFR10_UEA19E              *( ( volatile unsigned int * ) ( 0x4266C568UL ) )
    #define bFM3_GPIO_EPFR10_UEA20E              *( ( volatile unsigned int * ) ( 0x4266C56CUL ) )
    #define bFM3_GPIO_EPFR10_UEA21E              *( ( volatile unsigned int * ) ( 0x4266C570UL ) )
    #define bFM3_GPIO_EPFR10_UEA22E              *( ( volatile unsigned int * ) ( 0x4266C574UL ) )
    #define bFM3_GPIO_EPFR10_UEA23E              *( ( volatile unsigned int * ) ( 0x4266C578UL ) )
    #define bFM3_GPIO_EPFR10_UEA24E              *( ( volatile unsigned int * ) ( 0x4266C57CUL ) )

/* Low voltage detection registers */
    #define bFM3_LVD_LVD_CTL_SVHI0               *( ( volatile unsigned int * ) ( 0x426A0008UL ) )
    #define bFM3_LVD_LVD_CTL_SVHI1               *( ( volatile unsigned int * ) ( 0x426A000CUL ) )
    #define bFM3_LVD_LVD_CTL_SVHI2               *( ( volatile unsigned int * ) ( 0x426A0010UL ) )
    #define bFM3_LVD_LVD_CTL_SVHI3               *( ( volatile unsigned int * ) ( 0x426A0014UL ) )
    #define bFM3_LVD_LVD_CTL_LVDIE               *( ( volatile unsigned int * ) ( 0x426A001CUL ) )
    #define bFM3_LVD_LVD_STR_LVDIR               *( ( volatile unsigned int * ) ( 0x426A009CUL ) )
    #define bFM3_LVD_LVD_CLR_LVDCL               *( ( volatile unsigned int * ) ( 0x426A011CUL ) )
    #define bFM3_LVD_LVD_STR2_LVDIRDY            *( ( volatile unsigned int * ) ( 0x426A021CUL ) )

/* USB clock registers */
    #define bFM3_USBCLK_UCCR_UCEN                *( ( volatile unsigned int * ) ( 0x426C0000UL ) )
    #define bFM3_USBCLK_UCCR_UCSEL               *( ( volatile unsigned int * ) ( 0x426C0004UL ) )
    #define bFM3_USBCLK_UPCR1_UPLLEN             *( ( volatile unsigned int * ) ( 0x426C0080UL ) )
    #define bFM3_USBCLK_UPCR1_UPINC              *( ( volatile unsigned int * ) ( 0x426C0084UL ) )
    #define bFM3_USBCLK_UPCR2_UPOWT0             *( ( volatile unsigned int * ) ( 0x426C0100UL ) )
    #define bFM3_USBCLK_UPCR2_UPOWT1             *( ( volatile unsigned int * ) ( 0x426C0104UL ) )
    #define bFM3_USBCLK_UPCR2_UPOWT2             *( ( volatile unsigned int * ) ( 0x426C0108UL ) )
    #define bFM3_USBCLK_UPCR3_UPLLK0             *( ( volatile unsigned int * ) ( 0x426C0180UL ) )
    #define bFM3_USBCLK_UPCR3_UPLLK1             *( ( volatile unsigned int * ) ( 0x426C0184UL ) )
    #define bFM3_USBCLK_UPCR3_UPLLK2             *( ( volatile unsigned int * ) ( 0x426C0188UL ) )
    #define bFM3_USBCLK_UPCR3_UPLLK3             *( ( volatile unsigned int * ) ( 0x426C018CUL ) )
    #define bFM3_USBCLK_UPCR3_UPLLK4             *( ( volatile unsigned int * ) ( 0x426C0190UL ) )
    #define bFM3_USBCLK_UPCR4_UPLLN0             *( ( volatile unsigned int * ) ( 0x426C0200UL ) )
    #define bFM3_USBCLK_UPCR4_UPLLN1             *( ( volatile unsigned int * ) ( 0x426C0204UL ) )
    #define bFM3_USBCLK_UPCR4_UPLLN2             *( ( volatile unsigned int * ) ( 0x426C0208UL ) )
    #define bFM3_USBCLK_UPCR4_UPLLN3             *( ( volatile unsigned int * ) ( 0x426C020CUL ) )
    #define bFM3_USBCLK_UPCR4_UPLLN4             *( ( volatile unsigned int * ) ( 0x426C0210UL ) )
    #define bFM3_USBCLK_UP_STR_UPRDY             *( ( volatile unsigned int * ) ( 0x426C0280UL ) )
    #define bFM3_USBCLK_UPINT_ENR_UPCSE          *( ( volatile unsigned int * ) ( 0x426C0300UL ) )
    #define bFM3_USBCLK_UPINT_CLR_UPCSC          *( ( volatile unsigned int * ) ( 0x426C0380UL ) )
    #define bFM3_USBCLK_UPINT_STR_UPCSI          *( ( volatile unsigned int * ) ( 0x426C0400UL ) )
    #define bFM3_USBCLK_USBEN_USBEN              *( ( volatile unsigned int * ) ( 0x426C0600UL ) )

/* CAN prescaler register */
    #define bFM3_CANPRES_CANPRE_CANPRE0          *( ( volatile unsigned int * ) ( 0x426E0000UL ) )
    #define bFM3_CANPRES_CANPRE_CANPRE1          *( ( volatile unsigned int * ) ( 0x426E0004UL ) )
    #define bFM3_CANPRES_CANPRE_CANPRE2          *( ( volatile unsigned int * ) ( 0x426E0008UL ) )
    #define bFM3_CANPRES_CANPRE_CANPRE3          *( ( volatile unsigned int * ) ( 0x426E000CUL ) )

