FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART asynchronous channel 0 registers */
    #define bFM3_MFS0_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42700000UL ) )
    #define bFM3_MFS0_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42700008UL ) )
    #define bFM3_MFS0_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270000CUL ) )
    #define bFM3_MFS0_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42700010UL ) )
    #define bFM3_MFS0_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42700014UL ) )
    #define bFM3_MFS0_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42700018UL ) )
    #define bFM3_MFS0_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270001CUL ) )
    #define bFM3_MFS0_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42700020UL ) )
    #define bFM3_MFS0_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42700024UL ) )
    #define bFM3_MFS0_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42700028UL ) )
    #define bFM3_MFS0_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270002CUL ) )
    #define bFM3_MFS0_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42700030UL ) )
    #define bFM3_MFS0_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270003CUL ) )
    #define bFM3_MFS0_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42700080UL ) )
    #define bFM3_MFS0_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42700084UL ) )
    #define bFM3_MFS0_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42700088UL ) )
    #define bFM3_MFS0_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270008CUL ) )
    #define bFM3_MFS0_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x42700090UL ) )
    #define bFM3_MFS0_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x42700094UL ) )
    #define bFM3_MFS0_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x42700098UL ) )
    #define bFM3_MFS0_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270009CUL ) )
    #define bFM3_MFS0_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427000A0UL ) )
    #define bFM3_MFS0_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427000A4UL ) )
    #define bFM3_MFS0_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427000A8UL ) )
    #define bFM3_MFS0_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427000ACUL ) )
    #define bFM3_MFS0_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x427000B0UL ) )
    #define bFM3_MFS0_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x427000B4UL ) )
    #define bFM3_MFS0_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x427000BCUL ) )
    #define bFM3_MFS0_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x42700120UL ) )
    #define bFM3_MFS0_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x42700120UL ) )
    #define bFM3_MFS0_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x427001BCUL ) )
    #define bFM3_MFS0_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x427001BCUL ) )

/* UART synchronous channel 0 registers */
    #define bFM3_MFS0_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42700000UL ) )
    #define bFM3_MFS0_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x42700004UL ) )
    #define bFM3_MFS0_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42700008UL ) )
    #define bFM3_MFS0_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270000CUL ) )
    #define bFM3_MFS0_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42700010UL ) )
    #define bFM3_MFS0_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42700014UL ) )
    #define bFM3_MFS0_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42700018UL ) )
    #define bFM3_MFS0_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270001CUL ) )
    #define bFM3_MFS0_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42700020UL ) )
    #define bFM3_MFS0_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42700024UL ) )
    #define bFM3_MFS0_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42700028UL ) )
    #define bFM3_MFS0_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270002CUL ) )
    #define bFM3_MFS0_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42700030UL ) )
    #define bFM3_MFS0_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x42700034UL ) )
    #define bFM3_MFS0_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x42700038UL ) )
    #define bFM3_MFS0_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270003CUL ) )
    #define bFM3_MFS0_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42700080UL ) )
    #define bFM3_MFS0_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42700084UL ) )
    #define bFM3_MFS0_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42700088UL ) )
    #define bFM3_MFS0_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270008CUL ) )
    #define bFM3_MFS0_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x42700090UL ) )
    #define bFM3_MFS0_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270009CUL ) )
    #define bFM3_MFS0_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427000A0UL ) )
    #define bFM3_MFS0_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427000A4UL ) )
    #define bFM3_MFS0_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427000A8UL ) )
    #define bFM3_MFS0_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427000ACUL ) )
    #define bFM3_MFS0_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x427000BCUL ) )

/* UART LIN channel 0 registers */
    #define bFM3_MFS0_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x42700000UL ) )
    #define bFM3_MFS0_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270000CUL ) )
    #define bFM3_MFS0_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42700010UL ) )
    #define bFM3_MFS0_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42700014UL ) )
    #define bFM3_MFS0_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42700018UL ) )
    #define bFM3_MFS0_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270001CUL ) )
    #define bFM3_MFS0_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x42700020UL ) )
    #define bFM3_MFS0_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x42700024UL ) )
    #define bFM3_MFS0_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x42700028UL ) )
    #define bFM3_MFS0_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270002CUL ) )
    #define bFM3_MFS0_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x42700030UL ) )
    #define bFM3_MFS0_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x42700034UL ) )
    #define bFM3_MFS0_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x42700038UL ) )
    #define bFM3_MFS0_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270003CUL ) )
    #define bFM3_MFS0_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x42700080UL ) )
    #define bFM3_MFS0_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x42700084UL ) )
    #define bFM3_MFS0_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x42700088UL ) )
    #define bFM3_MFS0_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270008CUL ) )
    #define bFM3_MFS0_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x42700090UL ) )
    #define bFM3_MFS0_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x42700098UL ) )
    #define bFM3_MFS0_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427000A0UL ) )
    #define bFM3_MFS0_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427000A4UL ) )
    #define bFM3_MFS0_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427000A8UL ) )
    #define bFM3_MFS0_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427000ACUL ) )
    #define bFM3_MFS0_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x427000B0UL ) )
    #define bFM3_MFS0_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x427000B4UL ) )
    #define bFM3_MFS0_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x427000BCUL ) )
    #define bFM3_MFS0_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x427001BCUL ) )
    #define bFM3_MFS0_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x427001BCUL ) )

