FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* I2C channel 0 registers */
    #define bFM3_MFS0_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x42700000UL ) )
    #define bFM3_MFS0_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x42700004UL ) )
    #define bFM3_MFS0_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x42700008UL ) )
    #define bFM3_MFS0_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270000CUL ) )
    #define bFM3_MFS0_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42700010UL ) )
    #define bFM3_MFS0_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42700014UL ) )
    #define bFM3_MFS0_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42700018UL ) )
    #define bFM3_MFS0_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270001CUL ) )
    #define bFM3_MFS0_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x42700020UL ) )
    #define bFM3_MFS0_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x42700024UL ) )
    #define bFM3_MFS0_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x42700028UL ) )
    #define bFM3_MFS0_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270002CUL ) )
    #define bFM3_MFS0_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x42700030UL ) )
    #define bFM3_MFS0_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x42700034UL ) )
    #define bFM3_MFS0_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x42700038UL ) )
    #define bFM3_MFS0_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x42700038UL ) )
    #define bFM3_MFS0_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270003CUL ) )
    #define bFM3_MFS0_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x42700080UL ) )
    #define bFM3_MFS0_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x42700084UL ) )
    #define bFM3_MFS0_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x42700088UL ) )
    #define bFM3_MFS0_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270008CUL ) )
    #define bFM3_MFS0_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x42700090UL ) )
    #define bFM3_MFS0_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x42700094UL ) )
    #define bFM3_MFS0_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x42700098UL ) )
    #define bFM3_MFS0_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270009CUL ) )
    #define bFM3_MFS0_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427000A0UL ) )
    #define bFM3_MFS0_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427000A4UL ) )
    #define bFM3_MFS0_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427000A8UL ) )
    #define bFM3_MFS0_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427000ACUL ) )
    #define bFM3_MFS0_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x427000B0UL ) )
    #define bFM3_MFS0_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x427000B4UL ) )
    #define bFM3_MFS0_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x427000B8UL ) )
    #define bFM3_MFS0_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x427000BCUL ) )
    #define bFM3_MFS0_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x42700200UL ) )
    #define bFM3_MFS0_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x42700204UL ) )
    #define bFM3_MFS0_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x42700208UL ) )
    #define bFM3_MFS0_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270020CUL ) )
    #define bFM3_MFS0_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x42700210UL ) )
    #define bFM3_MFS0_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x42700214UL ) )
    #define bFM3_MFS0_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x42700218UL ) )
    #define bFM3_MFS0_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270021CUL ) )
    #define bFM3_MFS0_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x42700220UL ) )
    #define bFM3_MFS0_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x42700224UL ) )
    #define bFM3_MFS0_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x42700228UL ) )
    #define bFM3_MFS0_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270022CUL ) )
    #define bFM3_MFS0_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x42700230UL ) )
    #define bFM3_MFS0_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x42700234UL ) )
    #define bFM3_MFS0_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x42700238UL ) )
    #define bFM3_MFS0_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270023CUL ) )

/* UART asynchronous channel 1 registers */
    #define bFM3_MFS1_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42702000UL ) )
    #define bFM3_MFS1_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42702008UL ) )
    #define bFM3_MFS1_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270200CUL ) )
    #define bFM3_MFS1_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42702010UL ) )
    #define bFM3_MFS1_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42702014UL ) )
    #define bFM3_MFS1_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42702018UL ) )
    #define bFM3_MFS1_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270201CUL ) )
    #define bFM3_MFS1_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42702020UL ) )
    #define bFM3_MFS1_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42702024UL ) )
    #define bFM3_MFS1_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42702028UL ) )
    #define bFM3_MFS1_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270202CUL ) )
    #define bFM3_MFS1_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42702030UL ) )
    #define bFM3_MFS1_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270203CUL ) )
    #define bFM3_MFS1_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42702080UL ) )
    #define bFM3_MFS1_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42702084UL ) )
    #define bFM3_MFS1_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42702088UL ) )
    #define bFM3_MFS1_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270208CUL ) )
    #define bFM3_MFS1_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x42702090UL ) )
    #define bFM3_MFS1_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x42702094UL ) )
    #define bFM3_MFS1_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x42702098UL ) )
    #define bFM3_MFS1_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270209CUL ) )
    #define bFM3_MFS1_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427020A0UL ) )
    #define bFM3_MFS1_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427020A4UL ) )
    #define bFM3_MFS1_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427020A8UL ) )
    #define bFM3_MFS1_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427020ACUL ) )
    #define bFM3_MFS1_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x427020B0UL ) )
    #define bFM3_MFS1_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x427020B4UL ) )
    #define bFM3_MFS1_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x427020BCUL ) )
    #define bFM3_MFS1_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x42702120UL ) )
    #define bFM3_MFS1_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x42702120UL ) )
    #define bFM3_MFS1_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x427021BCUL ) )
    #define bFM3_MFS1_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x427021BCUL ) )

/* UART synchronous channel 1 registers */
    #define bFM3_MFS1_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42702000UL ) )
    #define bFM3_MFS1_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x42702004UL ) )
    #define bFM3_MFS1_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42702008UL ) )
    #define bFM3_MFS1_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270200CUL ) )
    #define bFM3_MFS1_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42702010UL ) )
    #define bFM3_MFS1_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42702014UL ) )
    #define bFM3_MFS1_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42702018UL ) )
    #define bFM3_MFS1_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270201CUL ) )
    #define bFM3_MFS1_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42702020UL ) )
    #define bFM3_MFS1_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42702024UL ) )
    #define bFM3_MFS1_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42702028UL ) )
    #define bFM3_MFS1_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270202CUL ) )
    #define bFM3_MFS1_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42702030UL ) )
    #define bFM3_MFS1_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x42702034UL ) )
    #define bFM3_MFS1_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x42702038UL ) )
    #define bFM3_MFS1_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270203CUL ) )
    #define bFM3_MFS1_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42702080UL ) )
    #define bFM3_MFS1_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42702084UL ) )
    #define bFM3_MFS1_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42702088UL ) )
    #define bFM3_MFS1_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270208CUL ) )
    #define bFM3_MFS1_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x42702090UL ) )
    #define bFM3_MFS1_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270209CUL ) )
    #define bFM3_MFS1_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427020A0UL ) )
    #define bFM3_MFS1_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427020A4UL ) )
    #define bFM3_MFS1_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427020A8UL ) )
    #define bFM3_MFS1_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427020ACUL ) )
    #define bFM3_MFS1_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x427020BCUL ) )

/* UART LIN channel 1 registers */
    #define bFM3_MFS1_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x42702000UL ) )
    #define bFM3_MFS1_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270200CUL ) )
    #define bFM3_MFS1_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42702010UL ) )
    #define bFM3_MFS1_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42702014UL ) )
    #define bFM3_MFS1_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42702018UL ) )
    #define bFM3_MFS1_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270201CUL ) )
    #define bFM3_MFS1_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x42702020UL ) )
    #define bFM3_MFS1_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x42702024UL ) )
    #define bFM3_MFS1_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x42702028UL ) )
    #define bFM3_MFS1_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270202CUL ) )
    #define bFM3_MFS1_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x42702030UL ) )
    #define bFM3_MFS1_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x42702034UL ) )
    #define bFM3_MFS1_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x42702038UL ) )
    #define bFM3_MFS1_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270203CUL ) )
    #define bFM3_MFS1_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x42702080UL ) )
    #define bFM3_MFS1_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x42702084UL ) )
    #define bFM3_MFS1_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x42702088UL ) )
    #define bFM3_MFS1_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270208CUL ) )
    #define bFM3_MFS1_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x42702090UL ) )
    #define bFM3_MFS1_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x42702098UL ) )
    #define bFM3_MFS1_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427020A0UL ) )
    #define bFM3_MFS1_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427020A4UL ) )
    #define bFM3_MFS1_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427020A8UL ) )
    #define bFM3_MFS1_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427020ACUL ) )
    #define bFM3_MFS1_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x427020B0UL ) )
    #define bFM3_MFS1_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x427020B4UL ) )
    #define bFM3_MFS1_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x427020BCUL ) )
    #define bFM3_MFS1_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x427021BCUL ) )
    #define bFM3_MFS1_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x427021BCUL ) )

/* I2C channel 1 registers */
    #define bFM3_MFS1_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x42702000UL ) )
    #define bFM3_MFS1_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x42702004UL ) )
    #define bFM3_MFS1_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x42702008UL ) )
    #define bFM3_MFS1_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270200CUL ) )
    #define bFM3_MFS1_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42702010UL ) )
    #define bFM3_MFS1_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42702014UL ) )
    #define bFM3_MFS1_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42702018UL ) )
    #define bFM3_MFS1_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270201CUL ) )
    #define bFM3_MFS1_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x42702020UL ) )
    #define bFM3_MFS1_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x42702024UL ) )
    #define bFM3_MFS1_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x42702028UL ) )
    #define bFM3_MFS1_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270202CUL ) )
    #define bFM3_MFS1_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x42702030UL ) )
    #define bFM3_MFS1_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x42702034UL ) )
    #define bFM3_MFS1_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x42702038UL ) )
    #define bFM3_MFS1_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x42702038UL ) )
    #define bFM3_MFS1_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270203CUL ) )
    #define bFM3_MFS1_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x42702080UL ) )
    #define bFM3_MFS1_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x42702084UL ) )
    #define bFM3_MFS1_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x42702088UL ) )
    #define bFM3_MFS1_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270208CUL ) )
    #define bFM3_MFS1_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x42702090UL ) )
    #define bFM3_MFS1_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x42702094UL ) )
    #define bFM3_MFS1_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x42702098UL ) )
    #define bFM3_MFS1_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270209CUL ) )
    #define bFM3_MFS1_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427020A0UL ) )
    #define bFM3_MFS1_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427020A4UL ) )
    #define bFM3_MFS1_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427020A8UL ) )
    #define bFM3_MFS1_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427020ACUL ) )
    #define bFM3_MFS1_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x427020B0UL ) )
    #define bFM3_MFS1_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x427020B4UL ) )
    #define bFM3_MFS1_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x427020B8UL ) )
    #define bFM3_MFS1_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x427020BCUL ) )
    #define bFM3_MFS1_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x42702200UL ) )
    #define bFM3_MFS1_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x42702204UL ) )
    #define bFM3_MFS1_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x42702208UL ) )
    #define bFM3_MFS1_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270220CUL ) )
    #define bFM3_MFS1_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x42702210UL ) )
    #define bFM3_MFS1_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x42702214UL ) )
    #define bFM3_MFS1_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x42702218UL ) )
    #define bFM3_MFS1_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270221CUL ) )
    #define bFM3_MFS1_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x42702220UL ) )
    #define bFM3_MFS1_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x42702224UL ) )
    #define bFM3_MFS1_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x42702228UL ) )
    #define bFM3_MFS1_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270222CUL ) )
    #define bFM3_MFS1_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x42702230UL ) )
    #define bFM3_MFS1_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x42702234UL ) )
    #define bFM3_MFS1_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x42702238UL ) )
    #define bFM3_MFS1_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270223CUL ) )

/* UART asynchronous channel 2 registers */
    #define bFM3_MFS2_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42704000UL ) )
    #define bFM3_MFS2_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42704008UL ) )
    #define bFM3_MFS2_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270400CUL ) )
    #define bFM3_MFS2_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42704010UL ) )
    #define bFM3_MFS2_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42704014UL ) )
    #define bFM3_MFS2_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42704018UL ) )
    #define bFM3_MFS2_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270401CUL ) )
    #define bFM3_MFS2_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42704020UL ) )
    #define bFM3_MFS2_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42704024UL ) )
    #define bFM3_MFS2_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42704028UL ) )
    #define bFM3_MFS2_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270402CUL ) )
    #define bFM3_MFS2_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42704030UL ) )
    #define bFM3_MFS2_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270403CUL ) )
    #define bFM3_MFS2_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42704080UL ) )
    #define bFM3_MFS2_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42704084UL ) )
    #define bFM3_MFS2_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42704088UL ) )
    #define bFM3_MFS2_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270408CUL ) )
    #define bFM3_MFS2_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x42704090UL ) )
    #define bFM3_MFS2_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x42704094UL ) )
    #define bFM3_MFS2_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x42704098UL ) )
    #define bFM3_MFS2_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270409CUL ) )
    #define bFM3_MFS2_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427040A0UL ) )
    #define bFM3_MFS2_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427040A4UL ) )
    #define bFM3_MFS2_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427040A8UL ) )
    #define bFM3_MFS2_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427040ACUL ) )
    #define bFM3_MFS2_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x427040B0UL ) )
    #define bFM3_MFS2_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x427040B4UL ) )
    #define bFM3_MFS2_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x427040BCUL ) )
    #define bFM3_MFS2_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x42704120UL ) )
    #define bFM3_MFS2_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x42704120UL ) )
    #define bFM3_MFS2_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x427041BCUL ) )
    #define bFM3_MFS2_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x427041BCUL ) )

