FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART synchronous channel 2 registers */
    #define bFM3_MFS2_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42704000UL ) )
    #define bFM3_MFS2_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x42704004UL ) )
    #define bFM3_MFS2_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42704008UL ) )
    #define bFM3_MFS2_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270400CUL ) )
    #define bFM3_MFS2_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42704010UL ) )
    #define bFM3_MFS2_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42704014UL ) )
    #define bFM3_MFS2_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42704018UL ) )
    #define bFM3_MFS2_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270401CUL ) )
    #define bFM3_MFS2_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42704020UL ) )
    #define bFM3_MFS2_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42704024UL ) )
    #define bFM3_MFS2_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42704028UL ) )
    #define bFM3_MFS2_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270402CUL ) )
    #define bFM3_MFS2_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42704030UL ) )
    #define bFM3_MFS2_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x42704034UL ) )
    #define bFM3_MFS2_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x42704038UL ) )
    #define bFM3_MFS2_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270403CUL ) )
    #define bFM3_MFS2_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42704080UL ) )
    #define bFM3_MFS2_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42704084UL ) )
    #define bFM3_MFS2_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42704088UL ) )
    #define bFM3_MFS2_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270408CUL ) )
    #define bFM3_MFS2_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x42704090UL ) )
    #define bFM3_MFS2_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270409CUL ) )
    #define bFM3_MFS2_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427040A0UL ) )
    #define bFM3_MFS2_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427040A4UL ) )
    #define bFM3_MFS2_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427040A8UL ) )
    #define bFM3_MFS2_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427040ACUL ) )
    #define bFM3_MFS2_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x427040BCUL ) )

/* UART LIN channel 2 registers */
    #define bFM3_MFS2_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x42704000UL ) )
    #define bFM3_MFS2_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270400CUL ) )
    #define bFM3_MFS2_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42704010UL ) )
    #define bFM3_MFS2_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42704014UL ) )
    #define bFM3_MFS2_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42704018UL ) )
    #define bFM3_MFS2_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270401CUL ) )
    #define bFM3_MFS2_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x42704020UL ) )
    #define bFM3_MFS2_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x42704024UL ) )
    #define bFM3_MFS2_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x42704028UL ) )
    #define bFM3_MFS2_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270402CUL ) )
    #define bFM3_MFS2_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x42704030UL ) )
    #define bFM3_MFS2_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x42704034UL ) )
    #define bFM3_MFS2_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x42704038UL ) )
    #define bFM3_MFS2_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270403CUL ) )
    #define bFM3_MFS2_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x42704080UL ) )
    #define bFM3_MFS2_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x42704084UL ) )
    #define bFM3_MFS2_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x42704088UL ) )
    #define bFM3_MFS2_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270408CUL ) )
    #define bFM3_MFS2_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x42704090UL ) )
    #define bFM3_MFS2_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x42704098UL ) )
    #define bFM3_MFS2_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427040A0UL ) )
    #define bFM3_MFS2_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427040A4UL ) )
    #define bFM3_MFS2_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427040A8UL ) )
    #define bFM3_MFS2_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427040ACUL ) )
    #define bFM3_MFS2_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x427040B0UL ) )
    #define bFM3_MFS2_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x427040B4UL ) )
    #define bFM3_MFS2_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x427040BCUL ) )
    #define bFM3_MFS2_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x427041BCUL ) )
    #define bFM3_MFS2_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x427041BCUL ) )

/* I2C channel 2 registers */
    #define bFM3_MFS2_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x42704000UL ) )
    #define bFM3_MFS2_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x42704004UL ) )
    #define bFM3_MFS2_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x42704008UL ) )
    #define bFM3_MFS2_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270400CUL ) )
    #define bFM3_MFS2_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42704010UL ) )
    #define bFM3_MFS2_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42704014UL ) )
    #define bFM3_MFS2_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42704018UL ) )
    #define bFM3_MFS2_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270401CUL ) )
    #define bFM3_MFS2_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x42704020UL ) )
    #define bFM3_MFS2_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x42704024UL ) )
    #define bFM3_MFS2_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x42704028UL ) )
    #define bFM3_MFS2_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270402CUL ) )
    #define bFM3_MFS2_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x42704030UL ) )
    #define bFM3_MFS2_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x42704034UL ) )
    #define bFM3_MFS2_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x42704038UL ) )
    #define bFM3_MFS2_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x42704038UL ) )
    #define bFM3_MFS2_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270403CUL ) )
    #define bFM3_MFS2_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x42704080UL ) )
    #define bFM3_MFS2_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x42704084UL ) )
    #define bFM3_MFS2_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x42704088UL ) )
    #define bFM3_MFS2_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270408CUL ) )
    #define bFM3_MFS2_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x42704090UL ) )
    #define bFM3_MFS2_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x42704094UL ) )
    #define bFM3_MFS2_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x42704098UL ) )
    #define bFM3_MFS2_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270409CUL ) )
    #define bFM3_MFS2_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427040A0UL ) )
    #define bFM3_MFS2_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427040A4UL ) )
    #define bFM3_MFS2_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427040A8UL ) )
    #define bFM3_MFS2_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427040ACUL ) )
    #define bFM3_MFS2_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x427040B0UL ) )
    #define bFM3_MFS2_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x427040B4UL ) )
    #define bFM3_MFS2_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x427040B8UL ) )
    #define bFM3_MFS2_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x427040BCUL ) )
    #define bFM3_MFS2_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x42704200UL ) )
    #define bFM3_MFS2_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x42704204UL ) )
    #define bFM3_MFS2_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x42704208UL ) )
    #define bFM3_MFS2_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270420CUL ) )
    #define bFM3_MFS2_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x42704210UL ) )
    #define bFM3_MFS2_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x42704214UL ) )
    #define bFM3_MFS2_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x42704218UL ) )
    #define bFM3_MFS2_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270421CUL ) )
    #define bFM3_MFS2_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x42704220UL ) )
    #define bFM3_MFS2_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x42704224UL ) )
    #define bFM3_MFS2_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x42704228UL ) )
    #define bFM3_MFS2_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270422CUL ) )
    #define bFM3_MFS2_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x42704230UL ) )
    #define bFM3_MFS2_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x42704234UL ) )
    #define bFM3_MFS2_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x42704238UL ) )
    #define bFM3_MFS2_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270423CUL ) )

