FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART asynchronous channel 3 registers */
    #define bFM3_MFS3_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42706000UL ) )
    #define bFM3_MFS3_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42706008UL ) )
    #define bFM3_MFS3_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270600CUL ) )
    #define bFM3_MFS3_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42706010UL ) )
    #define bFM3_MFS3_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42706014UL ) )
    #define bFM3_MFS3_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42706018UL ) )
    #define bFM3_MFS3_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270601CUL ) )
    #define bFM3_MFS3_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42706020UL ) )
    #define bFM3_MFS3_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42706024UL ) )
    #define bFM3_MFS3_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42706028UL ) )
    #define bFM3_MFS3_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270602CUL ) )
    #define bFM3_MFS3_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42706030UL ) )
    #define bFM3_MFS3_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270603CUL ) )
    #define bFM3_MFS3_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42706080UL ) )
    #define bFM3_MFS3_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42706084UL ) )
    #define bFM3_MFS3_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42706088UL ) )
    #define bFM3_MFS3_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270608CUL ) )
    #define bFM3_MFS3_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x42706090UL ) )
    #define bFM3_MFS3_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x42706094UL ) )
    #define bFM3_MFS3_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x42706098UL ) )
    #define bFM3_MFS3_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270609CUL ) )
    #define bFM3_MFS3_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427060A0UL ) )
    #define bFM3_MFS3_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427060A4UL ) )
    #define bFM3_MFS3_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427060A8UL ) )
    #define bFM3_MFS3_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427060ACUL ) )
    #define bFM3_MFS3_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x427060B0UL ) )
    #define bFM3_MFS3_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x427060B4UL ) )
    #define bFM3_MFS3_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x427060BCUL ) )
    #define bFM3_MFS3_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x42706120UL ) )
    #define bFM3_MFS3_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x42706120UL ) )
    #define bFM3_MFS3_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x427061BCUL ) )
    #define bFM3_MFS3_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x427061BCUL ) )

/* UART synchronous channel 3 registers */
    #define bFM3_MFS3_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42706000UL ) )
    #define bFM3_MFS3_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x42706004UL ) )
    #define bFM3_MFS3_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42706008UL ) )
    #define bFM3_MFS3_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270600CUL ) )
    #define bFM3_MFS3_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42706010UL ) )
    #define bFM3_MFS3_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42706014UL ) )
    #define bFM3_MFS3_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42706018UL ) )
    #define bFM3_MFS3_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270601CUL ) )
    #define bFM3_MFS3_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42706020UL ) )
    #define bFM3_MFS3_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42706024UL ) )
    #define bFM3_MFS3_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42706028UL ) )
    #define bFM3_MFS3_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270602CUL ) )
    #define bFM3_MFS3_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42706030UL ) )
    #define bFM3_MFS3_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x42706034UL ) )
    #define bFM3_MFS3_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x42706038UL ) )
    #define bFM3_MFS3_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270603CUL ) )
    #define bFM3_MFS3_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42706080UL ) )
    #define bFM3_MFS3_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42706084UL ) )
    #define bFM3_MFS3_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42706088UL ) )
    #define bFM3_MFS3_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270608CUL ) )
    #define bFM3_MFS3_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x42706090UL ) )
    #define bFM3_MFS3_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270609CUL ) )
    #define bFM3_MFS3_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427060A0UL ) )
    #define bFM3_MFS3_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427060A4UL ) )
    #define bFM3_MFS3_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427060A8UL ) )
    #define bFM3_MFS3_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427060ACUL ) )
    #define bFM3_MFS3_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x427060BCUL ) )

/* UART LIN channel 3 registers */
    #define bFM3_MFS3_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x42706000UL ) )
    #define bFM3_MFS3_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270600CUL ) )
    #define bFM3_MFS3_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42706010UL ) )
    #define bFM3_MFS3_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42706014UL ) )
    #define bFM3_MFS3_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42706018UL ) )
    #define bFM3_MFS3_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270601CUL ) )
    #define bFM3_MFS3_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x42706020UL ) )
    #define bFM3_MFS3_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x42706024UL ) )
    #define bFM3_MFS3_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x42706028UL ) )
    #define bFM3_MFS3_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270602CUL ) )
    #define bFM3_MFS3_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x42706030UL ) )
    #define bFM3_MFS3_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x42706034UL ) )
    #define bFM3_MFS3_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x42706038UL ) )
    #define bFM3_MFS3_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270603CUL ) )
    #define bFM3_MFS3_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x42706080UL ) )
    #define bFM3_MFS3_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x42706084UL ) )
    #define bFM3_MFS3_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x42706088UL ) )
    #define bFM3_MFS3_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270608CUL ) )
    #define bFM3_MFS3_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x42706090UL ) )
    #define bFM3_MFS3_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x42706098UL ) )
    #define bFM3_MFS3_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427060A0UL ) )
    #define bFM3_MFS3_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427060A4UL ) )
    #define bFM3_MFS3_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427060A8UL ) )
    #define bFM3_MFS3_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427060ACUL ) )
    #define bFM3_MFS3_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x427060B0UL ) )
    #define bFM3_MFS3_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x427060B4UL ) )
    #define bFM3_MFS3_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x427060BCUL ) )
    #define bFM3_MFS3_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x427061BCUL ) )
    #define bFM3_MFS3_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x427061BCUL ) )

/* I2C channel 3 registers */
    #define bFM3_MFS3_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x42706000UL ) )
    #define bFM3_MFS3_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x42706004UL ) )
    #define bFM3_MFS3_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x42706008UL ) )
    #define bFM3_MFS3_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270600CUL ) )
    #define bFM3_MFS3_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42706010UL ) )
    #define bFM3_MFS3_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42706014UL ) )
    #define bFM3_MFS3_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42706018UL ) )
    #define bFM3_MFS3_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270601CUL ) )
    #define bFM3_MFS3_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x42706020UL ) )
    #define bFM3_MFS3_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x42706024UL ) )
    #define bFM3_MFS3_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x42706028UL ) )
    #define bFM3_MFS3_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270602CUL ) )
    #define bFM3_MFS3_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x42706030UL ) )
    #define bFM3_MFS3_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x42706034UL ) )
    #define bFM3_MFS3_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x42706038UL ) )
    #define bFM3_MFS3_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x42706038UL ) )
    #define bFM3_MFS3_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270603CUL ) )
    #define bFM3_MFS3_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x42706080UL ) )
    #define bFM3_MFS3_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x42706084UL ) )
    #define bFM3_MFS3_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x42706088UL ) )
    #define bFM3_MFS3_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270608CUL ) )
    #define bFM3_MFS3_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x42706090UL ) )
    #define bFM3_MFS3_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x42706094UL ) )
    #define bFM3_MFS3_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x42706098UL ) )
    #define bFM3_MFS3_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270609CUL ) )
    #define bFM3_MFS3_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427060A0UL ) )
    #define bFM3_MFS3_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427060A4UL ) )
    #define bFM3_MFS3_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427060A8UL ) )
    #define bFM3_MFS3_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427060ACUL ) )
    #define bFM3_MFS3_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x427060B0UL ) )
    #define bFM3_MFS3_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x427060B4UL ) )
    #define bFM3_MFS3_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x427060B8UL ) )
    #define bFM3_MFS3_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x427060BCUL ) )
    #define bFM3_MFS3_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x42706200UL ) )
    #define bFM3_MFS3_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x42706204UL ) )
    #define bFM3_MFS3_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x42706208UL ) )
    #define bFM3_MFS3_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270620CUL ) )
    #define bFM3_MFS3_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x42706210UL ) )
    #define bFM3_MFS3_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x42706214UL ) )
    #define bFM3_MFS3_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x42706218UL ) )
    #define bFM3_MFS3_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270621CUL ) )
    #define bFM3_MFS3_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x42706220UL ) )
    #define bFM3_MFS3_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x42706224UL ) )
    #define bFM3_MFS3_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x42706228UL ) )
    #define bFM3_MFS3_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270622CUL ) )
    #define bFM3_MFS3_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x42706230UL ) )
    #define bFM3_MFS3_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x42706234UL ) )
    #define bFM3_MFS3_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x42706238UL ) )
    #define bFM3_MFS3_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270623CUL ) )

