FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART asynchronous channel 4 registers */
    #define bFM3_MFS4_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42708000UL ) )
    #define bFM3_MFS4_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42708008UL ) )
    #define bFM3_MFS4_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270800CUL ) )
    #define bFM3_MFS4_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42708010UL ) )
    #define bFM3_MFS4_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42708014UL ) )
    #define bFM3_MFS4_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42708018UL ) )
    #define bFM3_MFS4_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270801CUL ) )
    #define bFM3_MFS4_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42708020UL ) )
    #define bFM3_MFS4_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42708024UL ) )
    #define bFM3_MFS4_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42708028UL ) )
    #define bFM3_MFS4_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270802CUL ) )
    #define bFM3_MFS4_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42708030UL ) )
    #define bFM3_MFS4_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270803CUL ) )
    #define bFM3_MFS4_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42708080UL ) )
    #define bFM3_MFS4_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42708084UL ) )
    #define bFM3_MFS4_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42708088UL ) )
    #define bFM3_MFS4_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270808CUL ) )
    #define bFM3_MFS4_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x42708090UL ) )
    #define bFM3_MFS4_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x42708094UL ) )
    #define bFM3_MFS4_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x42708098UL ) )
    #define bFM3_MFS4_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270809CUL ) )
    #define bFM3_MFS4_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427080A0UL ) )
    #define bFM3_MFS4_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427080A4UL ) )
    #define bFM3_MFS4_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427080A8UL ) )
    #define bFM3_MFS4_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427080ACUL ) )
    #define bFM3_MFS4_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x427080B0UL ) )
    #define bFM3_MFS4_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x427080B4UL ) )
    #define bFM3_MFS4_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x427080BCUL ) )
    #define bFM3_MFS4_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x42708120UL ) )
    #define bFM3_MFS4_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x42708120UL ) )
    #define bFM3_MFS4_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x427081BCUL ) )
    #define bFM3_MFS4_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x427081BCUL ) )
    #define bFM3_MFS4_UART_FCR_FE1               *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_UART_FCR_FE2               *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_UART_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_UART_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_UART_FCR_FSET              *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_UART_FCR_FLD               *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_UART_FCR_FLST              *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_UART_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_UART_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_UART_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_UART_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_UART_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_UART_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_UART_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_UART_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_UART_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_UART_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_UART_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_UART_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_UART_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_UART_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_UART_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_UART_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_UART_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_UART_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_UART_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_UART_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_UART_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_UART_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_UART_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_UART_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x42708320UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x42708324UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x42708328UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270832CUL ) )
    #define bFM3_MFS4_UART_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x42708330UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x42708334UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x42708338UL ) )
    #define bFM3_MFS4_UART_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270833CUL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_UART_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x42708320UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x42708324UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x42708328UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270832CUL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x42708330UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x42708334UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x42708338UL ) )
    #define bFM3_MFS4_UART_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270833CUL ) )

/* UART synchronous channel 4 registers */
    #define bFM3_MFS4_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x42708000UL ) )
    #define bFM3_MFS4_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x42708004UL ) )
    #define bFM3_MFS4_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x42708008UL ) )
    #define bFM3_MFS4_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270800CUL ) )
    #define bFM3_MFS4_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x42708010UL ) )
    #define bFM3_MFS4_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x42708014UL ) )
    #define bFM3_MFS4_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x42708018UL ) )
    #define bFM3_MFS4_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270801CUL ) )
    #define bFM3_MFS4_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x42708020UL ) )
    #define bFM3_MFS4_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x42708024UL ) )
    #define bFM3_MFS4_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x42708028UL ) )
    #define bFM3_MFS4_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270802CUL ) )
    #define bFM3_MFS4_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x42708030UL ) )
    #define bFM3_MFS4_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x42708034UL ) )
    #define bFM3_MFS4_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x42708038UL ) )
    #define bFM3_MFS4_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270803CUL ) )
    #define bFM3_MFS4_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x42708080UL ) )
    #define bFM3_MFS4_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x42708084UL ) )
    #define bFM3_MFS4_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x42708088UL ) )
    #define bFM3_MFS4_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270808CUL ) )
    #define bFM3_MFS4_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x42708090UL ) )
    #define bFM3_MFS4_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270809CUL ) )
    #define bFM3_MFS4_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x427080A0UL ) )
    #define bFM3_MFS4_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x427080A4UL ) )
    #define bFM3_MFS4_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x427080A8UL ) )
    #define bFM3_MFS4_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x427080ACUL ) )
    #define bFM3_MFS4_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x427080BCUL ) )
    #define bFM3_MFS4_CSIO_FCR_FE1               *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_CSIO_FCR_FE2               *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_CSIO_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_CSIO_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_CSIO_FCR_FSET              *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_CSIO_FCR_FLD               *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_CSIO_FCR_FLST              *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_CSIO_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_CSIO_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_CSIO_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_CSIO_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_CSIO_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_CSIO_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_CSIO_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_CSIO_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_CSIO_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_CSIO_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_CSIO_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_CSIO_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_CSIO_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_CSIO_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_CSIO_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_CSIO_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x42708320UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x42708324UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x42708328UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270832CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x42708330UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x42708334UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x42708338UL ) )
    #define bFM3_MFS4_CSIO_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270833CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_CSIO_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x42708340UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x42708344UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x42708348UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270834CUL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x42708350UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x42708354UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x42708358UL ) )
    #define bFM3_MFS4_CSIO_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270835CUL ) )

