FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART LIN channel 4 registers */
    #define bFM3_MFS4_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x42708000UL ) )
    #define bFM3_MFS4_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270800CUL ) )
    #define bFM3_MFS4_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42708010UL ) )
    #define bFM3_MFS4_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42708014UL ) )
    #define bFM3_MFS4_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42708018UL ) )
    #define bFM3_MFS4_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270801CUL ) )
    #define bFM3_MFS4_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x42708020UL ) )
    #define bFM3_MFS4_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x42708024UL ) )
    #define bFM3_MFS4_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x42708028UL ) )
    #define bFM3_MFS4_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270802CUL ) )
    #define bFM3_MFS4_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x42708030UL ) )
    #define bFM3_MFS4_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x42708034UL ) )
    #define bFM3_MFS4_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x42708038UL ) )
    #define bFM3_MFS4_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270803CUL ) )
    #define bFM3_MFS4_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x42708080UL ) )
    #define bFM3_MFS4_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x42708084UL ) )
    #define bFM3_MFS4_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x42708088UL ) )
    #define bFM3_MFS4_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270808CUL ) )
    #define bFM3_MFS4_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x42708090UL ) )
    #define bFM3_MFS4_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x42708098UL ) )
    #define bFM3_MFS4_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427080A0UL ) )
    #define bFM3_MFS4_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427080A4UL ) )
    #define bFM3_MFS4_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427080A8UL ) )
    #define bFM3_MFS4_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427080ACUL ) )
    #define bFM3_MFS4_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x427080B0UL ) )
    #define bFM3_MFS4_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x427080B4UL ) )
    #define bFM3_MFS4_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x427080BCUL ) )
    #define bFM3_MFS4_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x427081BCUL ) )
    #define bFM3_MFS4_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x427081BCUL ) )
    #define bFM3_MFS4_LIN_FCR_FE1                *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_LIN_FCR_FE2                *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_LIN_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_LIN_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_LIN_FCR_FSET               *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_LIN_FCR_FLD                *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_LIN_FCR_FLST               *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_LIN_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_LIN_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_LIN_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_LIN_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_LIN_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_LIN_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_LIN_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_LIN_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_LIN_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_LIN_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_LIN_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_LIN_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_LIN_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_LIN_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_LIN_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_LIN_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_LIN_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_LIN_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_LIN_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_LIN_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_LIN_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x42708320UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x42708324UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x42708328UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270832CUL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x42708330UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x42708334UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x42708338UL ) )
    #define bFM3_MFS4_LIN_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270833CUL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_LIN_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x42708340UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x42708344UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x42708348UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270834CUL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x42708350UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x42708354UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x42708358UL ) )
    #define bFM3_MFS4_LIN_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270835CUL ) )

/* I2C channel 4 registers */
    #define bFM3_MFS4_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x42708000UL ) )
    #define bFM3_MFS4_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x42708004UL ) )
    #define bFM3_MFS4_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x42708008UL ) )
    #define bFM3_MFS4_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270800CUL ) )
    #define bFM3_MFS4_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x42708010UL ) )
    #define bFM3_MFS4_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x42708014UL ) )
    #define bFM3_MFS4_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x42708018UL ) )
    #define bFM3_MFS4_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270801CUL ) )
    #define bFM3_MFS4_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x42708020UL ) )
    #define bFM3_MFS4_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x42708024UL ) )
    #define bFM3_MFS4_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x42708028UL ) )
    #define bFM3_MFS4_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270802CUL ) )
    #define bFM3_MFS4_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x42708030UL ) )
    #define bFM3_MFS4_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x42708034UL ) )
    #define bFM3_MFS4_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x42708038UL ) )
    #define bFM3_MFS4_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x42708038UL ) )
    #define bFM3_MFS4_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270803CUL ) )
    #define bFM3_MFS4_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x42708080UL ) )
    #define bFM3_MFS4_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x42708084UL ) )
    #define bFM3_MFS4_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x42708088UL ) )
    #define bFM3_MFS4_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270808CUL ) )
    #define bFM3_MFS4_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x42708090UL ) )
    #define bFM3_MFS4_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x42708094UL ) )
    #define bFM3_MFS4_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x42708098UL ) )
    #define bFM3_MFS4_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270809CUL ) )
    #define bFM3_MFS4_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x427080A0UL ) )
    #define bFM3_MFS4_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x427080A4UL ) )
    #define bFM3_MFS4_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x427080A8UL ) )
    #define bFM3_MFS4_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x427080ACUL ) )
    #define bFM3_MFS4_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x427080B0UL ) )
    #define bFM3_MFS4_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x427080B4UL ) )
    #define bFM3_MFS4_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x427080B8UL ) )
    #define bFM3_MFS4_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x427080BCUL ) )
    #define bFM3_MFS4_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x42708200UL ) )
    #define bFM3_MFS4_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x42708204UL ) )
    #define bFM3_MFS4_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x42708208UL ) )
    #define bFM3_MFS4_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270820CUL ) )
    #define bFM3_MFS4_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x42708210UL ) )
    #define bFM3_MFS4_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x42708214UL ) )
    #define bFM3_MFS4_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x42708218UL ) )
    #define bFM3_MFS4_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270821CUL ) )
    #define bFM3_MFS4_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x42708220UL ) )
    #define bFM3_MFS4_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x42708224UL ) )
    #define bFM3_MFS4_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x42708228UL ) )
    #define bFM3_MFS4_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270822CUL ) )
    #define bFM3_MFS4_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x42708230UL ) )
    #define bFM3_MFS4_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x42708234UL ) )
    #define bFM3_MFS4_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x42708238UL ) )
    #define bFM3_MFS4_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270823CUL ) )
    #define bFM3_MFS4_I2C_FCR_FE1                *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_I2C_FCR_FE2                *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_I2C_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_I2C_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_I2C_FCR_FSET               *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_I2C_FCR_FLD                *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_I2C_FCR_FLST               *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_I2C_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_I2C_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_I2C_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_I2C_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_I2C_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_I2C_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_I2C_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_I2C_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x42708280UL ) )
    #define bFM3_MFS4_I2C_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x42708284UL ) )
    #define bFM3_MFS4_I2C_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x42708288UL ) )
    #define bFM3_MFS4_I2C_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270828CUL ) )
    #define bFM3_MFS4_I2C_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x42708290UL ) )
    #define bFM3_MFS4_I2C_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x42708294UL ) )
    #define bFM3_MFS4_I2C_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x42708298UL ) )
    #define bFM3_MFS4_I2C_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x427082A0UL ) )
    #define bFM3_MFS4_I2C_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x427082A4UL ) )
    #define bFM3_MFS4_I2C_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x427082A8UL ) )
    #define bFM3_MFS4_I2C_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x427082ACUL ) )
    #define bFM3_MFS4_I2C_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x427082B0UL ) )
    #define bFM3_MFS4_I2C_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x427082B8UL ) )
    #define bFM3_MFS4_I2C_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x427082BCUL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x42708320UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x42708324UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x42708328UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270832CUL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x42708330UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x42708334UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x42708338UL ) )
    #define bFM3_MFS4_I2C_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270833CUL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x42708300UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x42708304UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x42708308UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270830CUL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x42708310UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x42708314UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x42708318UL ) )
    #define bFM3_MFS4_I2C_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270831CUL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x42708340UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x42708344UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x42708348UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270834CUL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x42708350UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x42708354UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x42708358UL ) )
    #define bFM3_MFS4_I2C_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270835CUL ) )

