FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART asynchronous channel 5 registers */
    #define bFM3_MFS5_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x4270A000UL ) )
    #define bFM3_MFS5_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x4270A008UL ) )
    #define bFM3_MFS5_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270A00CUL ) )
    #define bFM3_MFS5_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x4270A010UL ) )
    #define bFM3_MFS5_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x4270A014UL ) )
    #define bFM3_MFS5_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x4270A018UL ) )
    #define bFM3_MFS5_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270A01CUL ) )
    #define bFM3_MFS5_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x4270A020UL ) )
    #define bFM3_MFS5_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x4270A024UL ) )
    #define bFM3_MFS5_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x4270A028UL ) )
    #define bFM3_MFS5_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270A02CUL ) )
    #define bFM3_MFS5_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x4270A030UL ) )
    #define bFM3_MFS5_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270A03CUL ) )
    #define bFM3_MFS5_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x4270A080UL ) )
    #define bFM3_MFS5_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x4270A084UL ) )
    #define bFM3_MFS5_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x4270A088UL ) )
    #define bFM3_MFS5_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270A08CUL ) )
    #define bFM3_MFS5_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x4270A090UL ) )
    #define bFM3_MFS5_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x4270A094UL ) )
    #define bFM3_MFS5_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x4270A098UL ) )
    #define bFM3_MFS5_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270A09CUL ) )
    #define bFM3_MFS5_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x4270A0A0UL ) )
    #define bFM3_MFS5_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x4270A0A4UL ) )
    #define bFM3_MFS5_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x4270A0A8UL ) )
    #define bFM3_MFS5_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x4270A0ACUL ) )
    #define bFM3_MFS5_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x4270A0B0UL ) )
    #define bFM3_MFS5_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x4270A0B4UL ) )
    #define bFM3_MFS5_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x4270A0BCUL ) )
    #define bFM3_MFS5_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x4270A120UL ) )
    #define bFM3_MFS5_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x4270A120UL ) )
    #define bFM3_MFS5_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x4270A1BCUL ) )
    #define bFM3_MFS5_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x4270A1BCUL ) )
    #define bFM3_MFS5_UART_FCR_FE1               *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_UART_FCR_FE2               *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_UART_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_UART_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_UART_FCR_FSET              *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_UART_FCR_FLD               *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_UART_FCR_FLST              *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_UART_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_UART_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_UART_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_UART_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_UART_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_UART_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_UART_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_UART_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_UART_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_UART_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_UART_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_UART_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_UART_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_UART_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_UART_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_UART_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_UART_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_UART_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_UART_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_UART_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_UART_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_UART_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_UART_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_UART_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x4270A320UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x4270A324UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x4270A328UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270A32CUL ) )
    #define bFM3_MFS5_UART_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x4270A330UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x4270A334UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x4270A338UL ) )
    #define bFM3_MFS5_UART_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270A33CUL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_UART_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x4270A320UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x4270A324UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x4270A328UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270A32CUL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x4270A330UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x4270A334UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x4270A338UL ) )
    #define bFM3_MFS5_UART_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270A33CUL ) )

/* UART synchronous channel 5 registers */
    #define bFM3_MFS5_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x4270A000UL ) )
    #define bFM3_MFS5_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x4270A004UL ) )
    #define bFM3_MFS5_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x4270A008UL ) )
    #define bFM3_MFS5_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270A00CUL ) )
    #define bFM3_MFS5_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x4270A010UL ) )
    #define bFM3_MFS5_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x4270A014UL ) )
    #define bFM3_MFS5_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x4270A018UL ) )
    #define bFM3_MFS5_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270A01CUL ) )
    #define bFM3_MFS5_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x4270A020UL ) )
    #define bFM3_MFS5_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x4270A024UL ) )
    #define bFM3_MFS5_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x4270A028UL ) )
    #define bFM3_MFS5_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270A02CUL ) )
    #define bFM3_MFS5_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x4270A030UL ) )
    #define bFM3_MFS5_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x4270A034UL ) )
    #define bFM3_MFS5_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x4270A038UL ) )
    #define bFM3_MFS5_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270A03CUL ) )
    #define bFM3_MFS5_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x4270A080UL ) )
    #define bFM3_MFS5_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x4270A084UL ) )
    #define bFM3_MFS5_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x4270A088UL ) )
    #define bFM3_MFS5_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270A08CUL ) )
    #define bFM3_MFS5_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x4270A090UL ) )
    #define bFM3_MFS5_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270A09CUL ) )
    #define bFM3_MFS5_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x4270A0A0UL ) )
    #define bFM3_MFS5_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x4270A0A4UL ) )
    #define bFM3_MFS5_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x4270A0A8UL ) )
    #define bFM3_MFS5_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x4270A0ACUL ) )
    #define bFM3_MFS5_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x4270A0BCUL ) )
    #define bFM3_MFS5_CSIO_FCR_FE1               *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_CSIO_FCR_FE2               *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_CSIO_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_CSIO_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_CSIO_FCR_FSET              *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_CSIO_FCR_FLD               *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_CSIO_FCR_FLST              *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_CSIO_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_CSIO_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_CSIO_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_CSIO_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_CSIO_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_CSIO_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_CSIO_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_CSIO_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_CSIO_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_CSIO_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_CSIO_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_CSIO_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_CSIO_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_CSIO_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_CSIO_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_CSIO_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x4270A320UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x4270A324UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x4270A328UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270A32CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x4270A330UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x4270A334UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x4270A338UL ) )
    #define bFM3_MFS5_CSIO_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270A33CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_CSIO_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x4270A340UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x4270A344UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x4270A348UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270A34CUL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x4270A350UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x4270A354UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x4270A358UL ) )
    #define bFM3_MFS5_CSIO_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270A35CUL ) )

