FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART LIN channel 5 registers */
    #define bFM3_MFS5_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x4270A000UL ) )
    #define bFM3_MFS5_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270A00CUL ) )
    #define bFM3_MFS5_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x4270A010UL ) )
    #define bFM3_MFS5_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x4270A014UL ) )
    #define bFM3_MFS5_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x4270A018UL ) )
    #define bFM3_MFS5_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270A01CUL ) )
    #define bFM3_MFS5_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x4270A020UL ) )
    #define bFM3_MFS5_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x4270A024UL ) )
    #define bFM3_MFS5_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x4270A028UL ) )
    #define bFM3_MFS5_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270A02CUL ) )
    #define bFM3_MFS5_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x4270A030UL ) )
    #define bFM3_MFS5_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x4270A034UL ) )
    #define bFM3_MFS5_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x4270A038UL ) )
    #define bFM3_MFS5_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270A03CUL ) )
    #define bFM3_MFS5_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x4270A080UL ) )
    #define bFM3_MFS5_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x4270A084UL ) )
    #define bFM3_MFS5_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x4270A088UL ) )
    #define bFM3_MFS5_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270A08CUL ) )
    #define bFM3_MFS5_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x4270A090UL ) )
    #define bFM3_MFS5_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x4270A098UL ) )
    #define bFM3_MFS5_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x4270A0A0UL ) )
    #define bFM3_MFS5_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x4270A0A4UL ) )
    #define bFM3_MFS5_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x4270A0A8UL ) )
    #define bFM3_MFS5_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x4270A0ACUL ) )
    #define bFM3_MFS5_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x4270A0B0UL ) )
    #define bFM3_MFS5_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x4270A0B4UL ) )
    #define bFM3_MFS5_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x4270A0BCUL ) )
    #define bFM3_MFS5_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x4270A1BCUL ) )
    #define bFM3_MFS5_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x4270A1BCUL ) )
    #define bFM3_MFS5_LIN_FCR_FE1                *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_LIN_FCR_FE2                *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_LIN_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_LIN_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_LIN_FCR_FSET               *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_LIN_FCR_FLD                *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_LIN_FCR_FLST               *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_LIN_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_LIN_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_LIN_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_LIN_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_LIN_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_LIN_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_LIN_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_LIN_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_LIN_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_LIN_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_LIN_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_LIN_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_LIN_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_LIN_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_LIN_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_LIN_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_LIN_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_LIN_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_LIN_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_LIN_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_LIN_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x4270A320UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x4270A324UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x4270A328UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270A32CUL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x4270A330UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x4270A334UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x4270A338UL ) )
    #define bFM3_MFS5_LIN_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270A33CUL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_LIN_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x4270A340UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x4270A344UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x4270A348UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270A34CUL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x4270A350UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x4270A354UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x4270A358UL ) )
    #define bFM3_MFS5_LIN_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270A35CUL ) )

/* I2C channel 5 registers */
    #define bFM3_MFS5_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x4270A000UL ) )
    #define bFM3_MFS5_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x4270A004UL ) )
    #define bFM3_MFS5_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x4270A008UL ) )
    #define bFM3_MFS5_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270A00CUL ) )
    #define bFM3_MFS5_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x4270A010UL ) )
    #define bFM3_MFS5_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x4270A014UL ) )
    #define bFM3_MFS5_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x4270A018UL ) )
    #define bFM3_MFS5_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270A01CUL ) )
    #define bFM3_MFS5_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x4270A020UL ) )
    #define bFM3_MFS5_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x4270A024UL ) )
    #define bFM3_MFS5_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x4270A028UL ) )
    #define bFM3_MFS5_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270A02CUL ) )
    #define bFM3_MFS5_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x4270A030UL ) )
    #define bFM3_MFS5_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x4270A034UL ) )
    #define bFM3_MFS5_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x4270A038UL ) )
    #define bFM3_MFS5_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x4270A038UL ) )
    #define bFM3_MFS5_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270A03CUL ) )
    #define bFM3_MFS5_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x4270A080UL ) )
    #define bFM3_MFS5_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x4270A084UL ) )
    #define bFM3_MFS5_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x4270A088UL ) )
    #define bFM3_MFS5_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270A08CUL ) )
    #define bFM3_MFS5_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x4270A090UL ) )
    #define bFM3_MFS5_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x4270A094UL ) )
    #define bFM3_MFS5_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x4270A098UL ) )
    #define bFM3_MFS5_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270A09CUL ) )
    #define bFM3_MFS5_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x4270A0A0UL ) )
    #define bFM3_MFS5_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x4270A0A4UL ) )
    #define bFM3_MFS5_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x4270A0A8UL ) )
    #define bFM3_MFS5_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x4270A0ACUL ) )
    #define bFM3_MFS5_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x4270A0B0UL ) )
    #define bFM3_MFS5_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x4270A0B4UL ) )
    #define bFM3_MFS5_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x4270A0B8UL ) )
    #define bFM3_MFS5_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x4270A0BCUL ) )
    #define bFM3_MFS5_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x4270A200UL ) )
    #define bFM3_MFS5_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x4270A204UL ) )
    #define bFM3_MFS5_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x4270A208UL ) )
    #define bFM3_MFS5_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270A20CUL ) )
    #define bFM3_MFS5_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x4270A210UL ) )
    #define bFM3_MFS5_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x4270A214UL ) )
    #define bFM3_MFS5_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x4270A218UL ) )
    #define bFM3_MFS5_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270A21CUL ) )
    #define bFM3_MFS5_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x4270A220UL ) )
    #define bFM3_MFS5_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x4270A224UL ) )
    #define bFM3_MFS5_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x4270A228UL ) )
    #define bFM3_MFS5_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270A22CUL ) )
    #define bFM3_MFS5_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x4270A230UL ) )
    #define bFM3_MFS5_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x4270A234UL ) )
    #define bFM3_MFS5_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x4270A238UL ) )
    #define bFM3_MFS5_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270A23CUL ) )
    #define bFM3_MFS5_I2C_FCR_FE1                *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_I2C_FCR_FE2                *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_I2C_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_I2C_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_I2C_FCR_FSET               *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_I2C_FCR_FLD                *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_I2C_FCR_FLST               *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_I2C_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_I2C_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_I2C_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_I2C_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_I2C_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_I2C_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_I2C_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_I2C_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x4270A280UL ) )
    #define bFM3_MFS5_I2C_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x4270A284UL ) )
    #define bFM3_MFS5_I2C_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x4270A288UL ) )
    #define bFM3_MFS5_I2C_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270A28CUL ) )
    #define bFM3_MFS5_I2C_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x4270A290UL ) )
    #define bFM3_MFS5_I2C_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x4270A294UL ) )
    #define bFM3_MFS5_I2C_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x4270A298UL ) )
    #define bFM3_MFS5_I2C_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x4270A2A0UL ) )
    #define bFM3_MFS5_I2C_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x4270A2A4UL ) )
    #define bFM3_MFS5_I2C_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x4270A2A8UL ) )
    #define bFM3_MFS5_I2C_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x4270A2ACUL ) )
    #define bFM3_MFS5_I2C_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x4270A2B0UL ) )
    #define bFM3_MFS5_I2C_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x4270A2B8UL ) )
    #define bFM3_MFS5_I2C_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x4270A2BCUL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x4270A320UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x4270A324UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x4270A328UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270A32CUL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x4270A330UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x4270A334UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x4270A338UL ) )
    #define bFM3_MFS5_I2C_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270A33CUL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x4270A300UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x4270A304UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x4270A308UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270A30CUL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x4270A310UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x4270A314UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x4270A318UL ) )
    #define bFM3_MFS5_I2C_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270A31CUL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x4270A340UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x4270A344UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x4270A348UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270A34CUL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x4270A350UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x4270A354UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x4270A358UL ) )
    #define bFM3_MFS5_I2C_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270A35CUL ) )

