FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART asynchronous channel 7 registers */
    #define bFM3_MFS7_UART_SMR_SOE               *( ( volatile unsigned int * ) ( 0x4270E000UL ) )
    #define bFM3_MFS7_UART_SMR_BDS               *( ( volatile unsigned int * ) ( 0x4270E008UL ) )
    #define bFM3_MFS7_UART_SMR_SBL               *( ( volatile unsigned int * ) ( 0x4270E00CUL ) )
    #define bFM3_MFS7_UART_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x4270E010UL ) )
    #define bFM3_MFS7_UART_SMR_MD0               *( ( volatile unsigned int * ) ( 0x4270E014UL ) )
    #define bFM3_MFS7_UART_SMR_MD1               *( ( volatile unsigned int * ) ( 0x4270E018UL ) )
    #define bFM3_MFS7_UART_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270E01CUL ) )
    #define bFM3_MFS7_UART_SCR_TXE               *( ( volatile unsigned int * ) ( 0x4270E020UL ) )
    #define bFM3_MFS7_UART_SCR_RXE               *( ( volatile unsigned int * ) ( 0x4270E024UL ) )
    #define bFM3_MFS7_UART_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x4270E028UL ) )
    #define bFM3_MFS7_UART_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270E02CUL ) )
    #define bFM3_MFS7_UART_SCR_RIE               *( ( volatile unsigned int * ) ( 0x4270E030UL ) )
    #define bFM3_MFS7_UART_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270E03CUL ) )
    #define bFM3_MFS7_UART_ESCR_L0               *( ( volatile unsigned int * ) ( 0x4270E080UL ) )
    #define bFM3_MFS7_UART_ESCR_L1               *( ( volatile unsigned int * ) ( 0x4270E084UL ) )
    #define bFM3_MFS7_UART_ESCR_L2               *( ( volatile unsigned int * ) ( 0x4270E088UL ) )
    #define bFM3_MFS7_UART_ESCR_P                *( ( volatile unsigned int * ) ( 0x4270E08CUL ) )
    #define bFM3_MFS7_UART_ESCR_PEN              *( ( volatile unsigned int * ) ( 0x4270E090UL ) )
    #define bFM3_MFS7_UART_ESCR_INV              *( ( volatile unsigned int * ) ( 0x4270E094UL ) )
    #define bFM3_MFS7_UART_ESCR_ESBL             *( ( volatile unsigned int * ) ( 0x4270E098UL ) )
    #define bFM3_MFS7_UART_ESCR_FLWEN            *( ( volatile unsigned int * ) ( 0x4270E09CUL ) )
    #define bFM3_MFS7_UART_SSR_TBI               *( ( volatile unsigned int * ) ( 0x4270E0A0UL ) )
    #define bFM3_MFS7_UART_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x4270E0A4UL ) )
    #define bFM3_MFS7_UART_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x4270E0A8UL ) )
    #define bFM3_MFS7_UART_SSR_ORE               *( ( volatile unsigned int * ) ( 0x4270E0ACUL ) )
    #define bFM3_MFS7_UART_SSR_FRE               *( ( volatile unsigned int * ) ( 0x4270E0B0UL ) )
    #define bFM3_MFS7_UART_SSR_PE                *( ( volatile unsigned int * ) ( 0x4270E0B4UL ) )
    #define bFM3_MFS7_UART_SSR_REC               *( ( volatile unsigned int * ) ( 0x4270E0BCUL ) )
    #define bFM3_MFS7_UART_RDR_AD                *( ( volatile unsigned int * ) ( 0x4270E120UL ) )
    #define bFM3_MFS7_UART_TDR_AD                *( ( volatile unsigned int * ) ( 0x4270E120UL ) )
    #define bFM3_MFS7_UART_BGR_EXT               *( ( volatile unsigned int * ) ( 0x4270E1BCUL ) )
    #define bFM3_MFS7_UART_BGR1_EXT              *( ( volatile unsigned int * ) ( 0x4270E1BCUL ) )
    #define bFM3_MFS7_UART_FCR_FE1               *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_UART_FCR_FE2               *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_UART_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_UART_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_UART_FCR_FSET              *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_UART_FCR_FLD               *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_UART_FCR_FLST              *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_UART_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_UART_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_UART_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_UART_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_UART_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_UART_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_UART_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_UART_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_UART_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_UART_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_UART_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_UART_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_UART_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_UART_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_UART_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_UART_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_UART_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_UART_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_UART_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_UART_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_UART_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_UART_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_UART_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_UART_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x4270E320UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x4270E324UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x4270E328UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270E32CUL ) )
    #define bFM3_MFS7_UART_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x4270E330UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x4270E334UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x4270E338UL ) )
    #define bFM3_MFS7_UART_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270E33CUL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_UART_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x4270E320UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x4270E324UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x4270E328UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270E32CUL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x4270E330UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x4270E334UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x4270E338UL ) )
    #define bFM3_MFS7_UART_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270E33CUL ) )

