FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* UART synchronous channel 7 registers */
    #define bFM3_MFS7_CSIO_SMR_SOE               *( ( volatile unsigned int * ) ( 0x4270E000UL ) )
    #define bFM3_MFS7_CSIO_SMR_SCKE              *( ( volatile unsigned int * ) ( 0x4270E004UL ) )
    #define bFM3_MFS7_CSIO_SMR_BDS               *( ( volatile unsigned int * ) ( 0x4270E008UL ) )
    #define bFM3_MFS7_CSIO_SMR_SCINV             *( ( volatile unsigned int * ) ( 0x4270E00CUL ) )
    #define bFM3_MFS7_CSIO_SMR_WUCR              *( ( volatile unsigned int * ) ( 0x4270E010UL ) )
    #define bFM3_MFS7_CSIO_SMR_MD0               *( ( volatile unsigned int * ) ( 0x4270E014UL ) )
    #define bFM3_MFS7_CSIO_SMR_MD1               *( ( volatile unsigned int * ) ( 0x4270E018UL ) )
    #define bFM3_MFS7_CSIO_SMR_MD2               *( ( volatile unsigned int * ) ( 0x4270E01CUL ) )
    #define bFM3_MFS7_CSIO_SCR_TXE               *( ( volatile unsigned int * ) ( 0x4270E020UL ) )
    #define bFM3_MFS7_CSIO_SCR_RXE               *( ( volatile unsigned int * ) ( 0x4270E024UL ) )
    #define bFM3_MFS7_CSIO_SCR_TBIE              *( ( volatile unsigned int * ) ( 0x4270E028UL ) )
    #define bFM3_MFS7_CSIO_SCR_TIE               *( ( volatile unsigned int * ) ( 0x4270E02CUL ) )
    #define bFM3_MFS7_CSIO_SCR_RIE               *( ( volatile unsigned int * ) ( 0x4270E030UL ) )
    #define bFM3_MFS7_CSIO_SCR_SPI               *( ( volatile unsigned int * ) ( 0x4270E034UL ) )
    #define bFM3_MFS7_CSIO_SCR_MS                *( ( volatile unsigned int * ) ( 0x4270E038UL ) )
    #define bFM3_MFS7_CSIO_SCR_UPCL              *( ( volatile unsigned int * ) ( 0x4270E03CUL ) )
    #define bFM3_MFS7_CSIO_ESCR_L0               *( ( volatile unsigned int * ) ( 0x4270E080UL ) )
    #define bFM3_MFS7_CSIO_ESCR_L1               *( ( volatile unsigned int * ) ( 0x4270E084UL ) )
    #define bFM3_MFS7_CSIO_ESCR_L2               *( ( volatile unsigned int * ) ( 0x4270E088UL ) )
    #define bFM3_MFS7_CSIO_ESCR_WT0              *( ( volatile unsigned int * ) ( 0x4270E08CUL ) )
    #define bFM3_MFS7_CSIO_ESCR_WT1              *( ( volatile unsigned int * ) ( 0x4270E090UL ) )
    #define bFM3_MFS7_CSIO_ESCR_SOP              *( ( volatile unsigned int * ) ( 0x4270E09CUL ) )
    #define bFM3_MFS7_CSIO_SSR_TBI               *( ( volatile unsigned int * ) ( 0x4270E0A0UL ) )
    #define bFM3_MFS7_CSIO_SSR_TDRE              *( ( volatile unsigned int * ) ( 0x4270E0A4UL ) )
    #define bFM3_MFS7_CSIO_SSR_RDRF              *( ( volatile unsigned int * ) ( 0x4270E0A8UL ) )
    #define bFM3_MFS7_CSIO_SSR_ORE               *( ( volatile unsigned int * ) ( 0x4270E0ACUL ) )
    #define bFM3_MFS7_CSIO_SSR_REC               *( ( volatile unsigned int * ) ( 0x4270E0BCUL ) )
    #define bFM3_MFS7_CSIO_FCR_FE1               *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_CSIO_FCR_FE2               *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_CSIO_FCR_FCL1              *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_CSIO_FCR_FCL2              *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_CSIO_FCR_FSET              *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_CSIO_FCR_FLD               *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_CSIO_FCR_FLST              *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_CSIO_FCR_FSEL              *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_CSIO_FCR_FTIE              *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_CSIO_FCR_FDRQ              *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_CSIO_FCR_FRIE              *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_CSIO_FCR_FLSTE             *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_CSIO_FCR_FTST0             *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_CSIO_FCR_FTST1             *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_CSIO_FCR0_FE1              *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_CSIO_FCR0_FE2              *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_CSIO_FCR0_FCL1             *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_CSIO_FCR0_FCL2             *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_CSIO_FCR0_FSET             *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_CSIO_FCR0_FLD              *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_CSIO_FCR0_FLST             *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FSEL             *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FTIE             *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FDRQ             *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FRIE             *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_CSIO_FCR1_FLSTE            *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FTST0            *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_CSIO_FCR1_FTST1            *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD0             *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD1             *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD2             *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD3             *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD4             *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD5             *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD6             *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD7             *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD8             *( ( volatile unsigned int * ) ( 0x4270E320UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD9             *( ( volatile unsigned int * ) ( 0x4270E324UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD10            *( ( volatile unsigned int * ) ( 0x4270E328UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD11            *( ( volatile unsigned int * ) ( 0x4270E32CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD12            *( ( volatile unsigned int * ) ( 0x4270E330UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD13            *( ( volatile unsigned int * ) ( 0x4270E334UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD14            *( ( volatile unsigned int * ) ( 0x4270E338UL ) )
    #define bFM3_MFS7_CSIO_FBYTE_FD15            *( ( volatile unsigned int * ) ( 0x4270E33CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD0            *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD1            *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD2            *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD3            *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD4            *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD5            *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD6            *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_CSIO_FBYTE1_FD7            *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD8            *( ( volatile unsigned int * ) ( 0x4270E340UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD9            *( ( volatile unsigned int * ) ( 0x4270E344UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD10           *( ( volatile unsigned int * ) ( 0x4270E348UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD11           *( ( volatile unsigned int * ) ( 0x4270E34CUL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD12           *( ( volatile unsigned int * ) ( 0x4270E350UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD13           *( ( volatile unsigned int * ) ( 0x4270E354UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD14           *( ( volatile unsigned int * ) ( 0x4270E358UL ) )
    #define bFM3_MFS7_CSIO_FBYTE2_FD15           *( ( volatile unsigned int * ) ( 0x4270E35CUL ) )

/* UART LIN channel 7 registers */
    #define bFM3_MFS7_LIN_SMR_SOE                *( ( volatile unsigned int * ) ( 0x4270E000UL ) )
    #define bFM3_MFS7_LIN_SMR_SBL                *( ( volatile unsigned int * ) ( 0x4270E00CUL ) )
    #define bFM3_MFS7_LIN_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x4270E010UL ) )
    #define bFM3_MFS7_LIN_SMR_MD0                *( ( volatile unsigned int * ) ( 0x4270E014UL ) )
    #define bFM3_MFS7_LIN_SMR_MD1                *( ( volatile unsigned int * ) ( 0x4270E018UL ) )
    #define bFM3_MFS7_LIN_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270E01CUL ) )
    #define bFM3_MFS7_LIN_SCR_TXE                *( ( volatile unsigned int * ) ( 0x4270E020UL ) )
    #define bFM3_MFS7_LIN_SCR_RXE                *( ( volatile unsigned int * ) ( 0x4270E024UL ) )
    #define bFM3_MFS7_LIN_SCR_TBIE               *( ( volatile unsigned int * ) ( 0x4270E028UL ) )
    #define bFM3_MFS7_LIN_SCR_TIE                *( ( volatile unsigned int * ) ( 0x4270E02CUL ) )
    #define bFM3_MFS7_LIN_SCR_RIE                *( ( volatile unsigned int * ) ( 0x4270E030UL ) )
    #define bFM3_MFS7_LIN_SCR_LBR                *( ( volatile unsigned int * ) ( 0x4270E034UL ) )
    #define bFM3_MFS7_LIN_SCR_MS                 *( ( volatile unsigned int * ) ( 0x4270E038UL ) )
    #define bFM3_MFS7_LIN_SCR_UPCL               *( ( volatile unsigned int * ) ( 0x4270E03CUL ) )
    #define bFM3_MFS7_LIN_ESCR_DEL0              *( ( volatile unsigned int * ) ( 0x4270E080UL ) )
    #define bFM3_MFS7_LIN_ESCR_DEL1              *( ( volatile unsigned int * ) ( 0x4270E084UL ) )
    #define bFM3_MFS7_LIN_ESCR_LBL0              *( ( volatile unsigned int * ) ( 0x4270E088UL ) )
    #define bFM3_MFS7_LIN_ESCR_LBL1              *( ( volatile unsigned int * ) ( 0x4270E08CUL ) )
    #define bFM3_MFS7_LIN_ESCR_LBIE              *( ( volatile unsigned int * ) ( 0x4270E090UL ) )
    #define bFM3_MFS7_LIN_ESCR_ESBL              *( ( volatile unsigned int * ) ( 0x4270E098UL ) )
    #define bFM3_MFS7_LIN_SSR_TBI                *( ( volatile unsigned int * ) ( 0x4270E0A0UL ) )
    #define bFM3_MFS7_LIN_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x4270E0A4UL ) )
    #define bFM3_MFS7_LIN_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x4270E0A8UL ) )
    #define bFM3_MFS7_LIN_SSR_ORE                *( ( volatile unsigned int * ) ( 0x4270E0ACUL ) )
    #define bFM3_MFS7_LIN_SSR_FRE                *( ( volatile unsigned int * ) ( 0x4270E0B0UL ) )
    #define bFM3_MFS7_LIN_SSR_LBD                *( ( volatile unsigned int * ) ( 0x4270E0B4UL ) )
    #define bFM3_MFS7_LIN_SSR_REC                *( ( volatile unsigned int * ) ( 0x4270E0BCUL ) )
    #define bFM3_MFS7_LIN_BGR_EXT                *( ( volatile unsigned int * ) ( 0x4270E1BCUL ) )
    #define bFM3_MFS7_LIN_BGR1_EXT               *( ( volatile unsigned int * ) ( 0x4270E1BCUL ) )
    #define bFM3_MFS7_LIN_FCR_FE1                *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_LIN_FCR_FE2                *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_LIN_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_LIN_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_LIN_FCR_FSET               *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_LIN_FCR_FLD                *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_LIN_FCR_FLST               *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_LIN_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_LIN_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_LIN_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_LIN_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_LIN_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_LIN_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_LIN_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_LIN_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_LIN_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_LIN_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_LIN_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_LIN_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_LIN_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_LIN_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_LIN_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_LIN_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_LIN_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_LIN_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_LIN_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_LIN_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_LIN_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x4270E320UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x4270E324UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x4270E328UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270E32CUL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x4270E330UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x4270E334UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x4270E338UL ) )
    #define bFM3_MFS7_LIN_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270E33CUL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_LIN_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x4270E340UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x4270E344UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x4270E348UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270E34CUL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x4270E350UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x4270E354UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x4270E358UL ) )
    #define bFM3_MFS7_LIN_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270E35CUL ) )

