FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* I2C channel 7 registers */
    #define bFM3_MFS7_I2C_SMR_ITST0              *( ( volatile unsigned int * ) ( 0x4270E000UL ) )
    #define bFM3_MFS7_I2C_SMR_ITST1              *( ( volatile unsigned int * ) ( 0x4270E004UL ) )
    #define bFM3_MFS7_I2C_SMR_TIE                *( ( volatile unsigned int * ) ( 0x4270E008UL ) )
    #define bFM3_MFS7_I2C_SMR_RIE                *( ( volatile unsigned int * ) ( 0x4270E00CUL ) )
    #define bFM3_MFS7_I2C_SMR_WUCR               *( ( volatile unsigned int * ) ( 0x4270E010UL ) )
    #define bFM3_MFS7_I2C_SMR_MD0                *( ( volatile unsigned int * ) ( 0x4270E014UL ) )
    #define bFM3_MFS7_I2C_SMR_MD1                *( ( volatile unsigned int * ) ( 0x4270E018UL ) )
    #define bFM3_MFS7_I2C_SMR_MD2                *( ( volatile unsigned int * ) ( 0x4270E01CUL ) )
    #define bFM3_MFS7_I2C_IBCR_INT               *( ( volatile unsigned int * ) ( 0x4270E020UL ) )
    #define bFM3_MFS7_I2C_IBCR_BER               *( ( volatile unsigned int * ) ( 0x4270E024UL ) )
    #define bFM3_MFS7_I2C_IBCR_INTE              *( ( volatile unsigned int * ) ( 0x4270E028UL ) )
    #define bFM3_MFS7_I2C_IBCR_CNDE              *( ( volatile unsigned int * ) ( 0x4270E02CUL ) )
    #define bFM3_MFS7_I2C_IBCR_WSEL              *( ( volatile unsigned int * ) ( 0x4270E030UL ) )
    #define bFM3_MFS7_I2C_IBCR_ACKE              *( ( volatile unsigned int * ) ( 0x4270E034UL ) )
    #define bFM3_MFS7_I2C_IBCR_ACT               *( ( volatile unsigned int * ) ( 0x4270E038UL ) )
    #define bFM3_MFS7_I2C_IBCR_SCC               *( ( volatile unsigned int * ) ( 0x4270E038UL ) )
    #define bFM3_MFS7_I2C_IBCR_MSS               *( ( volatile unsigned int * ) ( 0x4270E03CUL ) )
    #define bFM3_MFS7_I2C_IBSR_BB                *( ( volatile unsigned int * ) ( 0x4270E080UL ) )
    #define bFM3_MFS7_I2C_IBSR_SPC               *( ( volatile unsigned int * ) ( 0x4270E084UL ) )
    #define bFM3_MFS7_I2C_IBSR_RSC               *( ( volatile unsigned int * ) ( 0x4270E088UL ) )
    #define bFM3_MFS7_I2C_IBSR_AL                *( ( volatile unsigned int * ) ( 0x4270E08CUL ) )
    #define bFM3_MFS7_I2C_IBSR_TRX               *( ( volatile unsigned int * ) ( 0x4270E090UL ) )
    #define bFM3_MFS7_I2C_IBSR_RSA               *( ( volatile unsigned int * ) ( 0x4270E094UL ) )
    #define bFM3_MFS7_I2C_IBSR_RACK              *( ( volatile unsigned int * ) ( 0x4270E098UL ) )
    #define bFM3_MFS7_I2C_IBSR_FBT               *( ( volatile unsigned int * ) ( 0x4270E09CUL ) )
    #define bFM3_MFS7_I2C_SSR_TBI                *( ( volatile unsigned int * ) ( 0x4270E0A0UL ) )
    #define bFM3_MFS7_I2C_SSR_TDRE               *( ( volatile unsigned int * ) ( 0x4270E0A4UL ) )
    #define bFM3_MFS7_I2C_SSR_RDRF               *( ( volatile unsigned int * ) ( 0x4270E0A8UL ) )
    #define bFM3_MFS7_I2C_SSR_ORE                *( ( volatile unsigned int * ) ( 0x4270E0ACUL ) )
    #define bFM3_MFS7_I2C_SSR_TBIE               *( ( volatile unsigned int * ) ( 0x4270E0B0UL ) )
    #define bFM3_MFS7_I2C_SSR_DMA                *( ( volatile unsigned int * ) ( 0x4270E0B4UL ) )
    #define bFM3_MFS7_I2C_SSR_TSET               *( ( volatile unsigned int * ) ( 0x4270E0B8UL ) )
    #define bFM3_MFS7_I2C_SSR_REC                *( ( volatile unsigned int * ) ( 0x4270E0BCUL ) )
    #define bFM3_MFS7_I2C_ISBA_SA0               *( ( volatile unsigned int * ) ( 0x4270E200UL ) )
    #define bFM3_MFS7_I2C_ISBA_SA1               *( ( volatile unsigned int * ) ( 0x4270E204UL ) )
    #define bFM3_MFS7_I2C_ISBA_SA2               *( ( volatile unsigned int * ) ( 0x4270E208UL ) )
    #define bFM3_MFS7_I2C_ISBA_SA3               *( ( volatile unsigned int * ) ( 0x4270E20CUL ) )
    #define bFM3_MFS7_I2C_ISBA_SA4               *( ( volatile unsigned int * ) ( 0x4270E210UL ) )
    #define bFM3_MFS7_I2C_ISBA_SA5               *( ( volatile unsigned int * ) ( 0x4270E214UL ) )
    #define bFM3_MFS7_I2C_ISBA_SA6               *( ( volatile unsigned int * ) ( 0x4270E218UL ) )
    #define bFM3_MFS7_I2C_ISBA_SAEN              *( ( volatile unsigned int * ) ( 0x4270E21CUL ) )
    #define bFM3_MFS7_I2C_ISMK_SM0               *( ( volatile unsigned int * ) ( 0x4270E220UL ) )
    #define bFM3_MFS7_I2C_ISMK_SM1               *( ( volatile unsigned int * ) ( 0x4270E224UL ) )
    #define bFM3_MFS7_I2C_ISMK_SM2               *( ( volatile unsigned int * ) ( 0x4270E228UL ) )
    #define bFM3_MFS7_I2C_ISMK_SM3               *( ( volatile unsigned int * ) ( 0x4270E22CUL ) )
    #define bFM3_MFS7_I2C_ISMK_SM4               *( ( volatile unsigned int * ) ( 0x4270E230UL ) )
    #define bFM3_MFS7_I2C_ISMK_SM5               *( ( volatile unsigned int * ) ( 0x4270E234UL ) )
    #define bFM3_MFS7_I2C_ISMK_SM6               *( ( volatile unsigned int * ) ( 0x4270E238UL ) )
    #define bFM3_MFS7_I2C_ISMK_EN                *( ( volatile unsigned int * ) ( 0x4270E23CUL ) )
    #define bFM3_MFS7_I2C_FCR_FE1                *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_I2C_FCR_FE2                *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_I2C_FCR_FCL1               *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_I2C_FCR_FCL2               *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_I2C_FCR_FSET               *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_I2C_FCR_FLD                *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_I2C_FCR_FLST               *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_I2C_FCR_FSEL               *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_I2C_FCR_FTIE               *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_I2C_FCR_FDRQ               *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_I2C_FCR_FRIE               *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_I2C_FCR_FLSTE              *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_I2C_FCR_FTST0              *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_I2C_FCR_FTST1              *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_I2C_FCR0_FE1               *( ( volatile unsigned int * ) ( 0x4270E280UL ) )
    #define bFM3_MFS7_I2C_FCR0_FE2               *( ( volatile unsigned int * ) ( 0x4270E284UL ) )
    #define bFM3_MFS7_I2C_FCR0_FCL1              *( ( volatile unsigned int * ) ( 0x4270E288UL ) )
    #define bFM3_MFS7_I2C_FCR0_FCL2              *( ( volatile unsigned int * ) ( 0x4270E28CUL ) )
    #define bFM3_MFS7_I2C_FCR0_FSET              *( ( volatile unsigned int * ) ( 0x4270E290UL ) )
    #define bFM3_MFS7_I2C_FCR0_FLD               *( ( volatile unsigned int * ) ( 0x4270E294UL ) )
    #define bFM3_MFS7_I2C_FCR0_FLST              *( ( volatile unsigned int * ) ( 0x4270E298UL ) )
    #define bFM3_MFS7_I2C_FCR1_FSEL              *( ( volatile unsigned int * ) ( 0x4270E2A0UL ) )
    #define bFM3_MFS7_I2C_FCR1_FTIE              *( ( volatile unsigned int * ) ( 0x4270E2A4UL ) )
    #define bFM3_MFS7_I2C_FCR1_FDRQ              *( ( volatile unsigned int * ) ( 0x4270E2A8UL ) )
    #define bFM3_MFS7_I2C_FCR1_FRIE              *( ( volatile unsigned int * ) ( 0x4270E2ACUL ) )
    #define bFM3_MFS7_I2C_FCR1_FLSTE             *( ( volatile unsigned int * ) ( 0x4270E2B0UL ) )
    #define bFM3_MFS7_I2C_FCR1_FTST0             *( ( volatile unsigned int * ) ( 0x4270E2B8UL ) )
    #define bFM3_MFS7_I2C_FCR1_FTST1             *( ( volatile unsigned int * ) ( 0x4270E2BCUL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD0              *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD1              *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD2              *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD3              *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD4              *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD5              *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD6              *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD7              *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD8              *( ( volatile unsigned int * ) ( 0x4270E320UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD9              *( ( volatile unsigned int * ) ( 0x4270E324UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD10             *( ( volatile unsigned int * ) ( 0x4270E328UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD11             *( ( volatile unsigned int * ) ( 0x4270E32CUL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD12             *( ( volatile unsigned int * ) ( 0x4270E330UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD13             *( ( volatile unsigned int * ) ( 0x4270E334UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD14             *( ( volatile unsigned int * ) ( 0x4270E338UL ) )
    #define bFM3_MFS7_I2C_FBYTE_FD15             *( ( volatile unsigned int * ) ( 0x4270E33CUL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD0             *( ( volatile unsigned int * ) ( 0x4270E300UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD1             *( ( volatile unsigned int * ) ( 0x4270E304UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD2             *( ( volatile unsigned int * ) ( 0x4270E308UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD3             *( ( volatile unsigned int * ) ( 0x4270E30CUL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD4             *( ( volatile unsigned int * ) ( 0x4270E310UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD5             *( ( volatile unsigned int * ) ( 0x4270E314UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD6             *( ( volatile unsigned int * ) ( 0x4270E318UL ) )
    #define bFM3_MFS7_I2C_FBYTE1_FD7             *( ( volatile unsigned int * ) ( 0x4270E31CUL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD8             *( ( volatile unsigned int * ) ( 0x4270E340UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD9             *( ( volatile unsigned int * ) ( 0x4270E344UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD10            *( ( volatile unsigned int * ) ( 0x4270E348UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD11            *( ( volatile unsigned int * ) ( 0x4270E34CUL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD12            *( ( volatile unsigned int * ) ( 0x4270E350UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD13            *( ( volatile unsigned int * ) ( 0x4270E354UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD14            *( ( volatile unsigned int * ) ( 0x4270E358UL ) )
    #define bFM3_MFS7_I2C_FBYTE2_FD15            *( ( volatile unsigned int * ) ( 0x4270E35CUL ) )

/* CRC registers */
    #define bFM3_CRC_CRCCR_INIT                  *( ( volatile unsigned int * ) ( 0x42720000UL ) )
    #define bFM3_CRC_CRCCR_CRC32                 *( ( volatile unsigned int * ) ( 0x42720004UL ) )
    #define bFM3_CRC_CRCCR_LTLEND                *( ( volatile unsigned int * ) ( 0x42720008UL ) )
    #define bFM3_CRC_CRCCR_LSBFST                *( ( volatile unsigned int * ) ( 0x4272000CUL ) )
    #define bFM3_CRC_CRCCR_CRCLTE                *( ( volatile unsigned int * ) ( 0x42720010UL ) )
    #define bFM3_CRC_CRCCR_CRCLSF                *( ( volatile unsigned int * ) ( 0x42720014UL ) )
    #define bFM3_CRC_CRCCR_FXOR                  *( ( volatile unsigned int * ) ( 0x42720018UL ) )

