FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* Watch counter registers */
    #define bFM3_WC_WCRD_CTR0                    *( ( volatile unsigned int * ) ( 0x42740000UL ) )
    #define bFM3_WC_WCRD_CTR1                    *( ( volatile unsigned int * ) ( 0x42740004UL ) )
    #define bFM3_WC_WCRD_CTR2                    *( ( volatile unsigned int * ) ( 0x42740008UL ) )
    #define bFM3_WC_WCRD_CTR3                    *( ( volatile unsigned int * ) ( 0x4274000CUL ) )
    #define bFM3_WC_WCRD_CTR4                    *( ( volatile unsigned int * ) ( 0x42740010UL ) )
    #define bFM3_WC_WCRD_CTR5                    *( ( volatile unsigned int * ) ( 0x42740014UL ) )
    #define bFM3_WC_WCRL_RLC0                    *( ( volatile unsigned int * ) ( 0x42740020UL ) )
    #define bFM3_WC_WCRL_RLC1                    *( ( volatile unsigned int * ) ( 0x42740024UL ) )
    #define bFM3_WC_WCRL_RLC2                    *( ( volatile unsigned int * ) ( 0x42740028UL ) )
    #define bFM3_WC_WCRL_RLC3                    *( ( volatile unsigned int * ) ( 0x4274002CUL ) )
    #define bFM3_WC_WCRL_RLC4                    *( ( volatile unsigned int * ) ( 0x42740030UL ) )
    #define bFM3_WC_WCRL_RLC5                    *( ( volatile unsigned int * ) ( 0x42740034UL ) )
    #define bFM3_WC_WCCR_WCIF                    *( ( volatile unsigned int * ) ( 0x42740040UL ) )
    #define bFM3_WC_WCCR_WCIE                    *( ( volatile unsigned int * ) ( 0x42740044UL ) )
    #define bFM3_WC_WCCR_CS0                     *( ( volatile unsigned int * ) ( 0x42740048UL ) )
    #define bFM3_WC_WCCR_CS1                     *( ( volatile unsigned int * ) ( 0x4274004CUL ) )
    #define bFM3_WC_WCCR_WCOP                    *( ( volatile unsigned int * ) ( 0x42740058UL ) )
    #define bFM3_WC_WCCR_WCEN                    *( ( volatile unsigned int * ) ( 0x4274005CUL ) )
    #define bFM3_WC_CLK_SEL_SEL_IN               *( ( volatile unsigned int * ) ( 0x42740200UL ) )
    #define bFM3_WC_CLK_SEL_SEL_OUT              *( ( volatile unsigned int * ) ( 0x42740220UL ) )
    #define bFM3_WC_CLK_EN_CLK_EN                *( ( volatile unsigned int * ) ( 0x42740280UL ) )
    #define bFM3_WC_CLK_EN_CLK_EN_R              *( ( volatile unsigned int * ) ( 0x42740284UL ) )

/* External bus interface registers */
    #define bFM3_EXBUS_MODE0_WDTH0               *( ( volatile unsigned int * ) ( 0x427E0000UL ) )
    #define bFM3_EXBUS_MODE0_WDTH1               *( ( volatile unsigned int * ) ( 0x427E0004UL ) )
    #define bFM3_EXBUS_MODE0_RBMON               *( ( volatile unsigned int * ) ( 0x427E0008UL ) )
    #define bFM3_EXBUS_MODE0_WEOFF               *( ( volatile unsigned int * ) ( 0x427E000CUL ) )
    #define bFM3_EXBUS_MODE0_PAGE                *( ( volatile unsigned int * ) ( 0x427E0014UL ) )
    #define bFM3_EXBUS_MODE0_TEST                *( ( volatile unsigned int * ) ( 0x427E0018UL ) )
    #define bFM3_EXBUS_MODE1_WDTH0               *( ( volatile unsigned int * ) ( 0x427E0080UL ) )
    #define bFM3_EXBUS_MODE1_WDTH1               *( ( volatile unsigned int * ) ( 0x427E0084UL ) )
    #define bFM3_EXBUS_MODE1_RBMON               *( ( volatile unsigned int * ) ( 0x427E0088UL ) )
    #define bFM3_EXBUS_MODE1_WEOFF               *( ( volatile unsigned int * ) ( 0x427E008CUL ) )
    #define bFM3_EXBUS_MODE1_PAGE                *( ( volatile unsigned int * ) ( 0x427E0094UL ) )
    #define bFM3_EXBUS_MODE1_TEST                *( ( volatile unsigned int * ) ( 0x427E0098UL ) )
    #define bFM3_EXBUS_MODE2_WDTH0               *( ( volatile unsigned int * ) ( 0x427E0100UL ) )
    #define bFM3_EXBUS_MODE2_WDTH1               *( ( volatile unsigned int * ) ( 0x427E0104UL ) )
    #define bFM3_EXBUS_MODE2_RBMON               *( ( volatile unsigned int * ) ( 0x427E0108UL ) )
    #define bFM3_EXBUS_MODE2_WEOFF               *( ( volatile unsigned int * ) ( 0x427E010CUL ) )
    #define bFM3_EXBUS_MODE2_PAGE                *( ( volatile unsigned int * ) ( 0x427E0114UL ) )
    #define bFM3_EXBUS_MODE2_TEST                *( ( volatile unsigned int * ) ( 0x427E0118UL ) )
    #define bFM3_EXBUS_MODE3_WDTH0               *( ( volatile unsigned int * ) ( 0x427E0180UL ) )
    #define bFM3_EXBUS_MODE3_WDTH1               *( ( volatile unsigned int * ) ( 0x427E0184UL ) )
    #define bFM3_EXBUS_MODE3_RBMON               *( ( volatile unsigned int * ) ( 0x427E0188UL ) )
    #define bFM3_EXBUS_MODE3_WEOFF               *( ( volatile unsigned int * ) ( 0x427E018CUL ) )
    #define bFM3_EXBUS_MODE3_PAGE                *( ( volatile unsigned int * ) ( 0x427E0194UL ) )
    #define bFM3_EXBUS_MODE3_TEST                *( ( volatile unsigned int * ) ( 0x427E0198UL ) )
    #define bFM3_EXBUS_MODE7_WDTH0               *( ( volatile unsigned int * ) ( 0x427E0380UL ) )
    #define bFM3_EXBUS_MODE7_WDTH1               *( ( volatile unsigned int * ) ( 0x427E0384UL ) )
    #define bFM3_EXBUS_MODE7_RBMON               *( ( volatile unsigned int * ) ( 0x427E0388UL ) )
    #define bFM3_EXBUS_MODE7_WEOFF               *( ( volatile unsigned int * ) ( 0x427E038CUL ) )
    #define bFM3_EXBUS_MODE7_PAGE                *( ( volatile unsigned int * ) ( 0x427E0394UL ) )
    #define bFM3_EXBUS_MODE7_TEST                *( ( volatile unsigned int * ) ( 0x427E0398UL ) )
    #define bFM3_EXBUS_TIM0_RACC0                *( ( volatile unsigned int * ) ( 0x427E0400UL ) )
    #define bFM3_EXBUS_TIM0_RACC1                *( ( volatile unsigned int * ) ( 0x427E0404UL ) )
    #define bFM3_EXBUS_TIM0_RACC2                *( ( volatile unsigned int * ) ( 0x427E0408UL ) )
    #define bFM3_EXBUS_TIM0_RACC3                *( ( volatile unsigned int * ) ( 0x427E040CUL ) )
    #define bFM3_EXBUS_TIM0_RADC0                *( ( volatile unsigned int * ) ( 0x427E0410UL ) )
    #define bFM3_EXBUS_TIM0_RADC1                *( ( volatile unsigned int * ) ( 0x427E0414UL ) )
    #define bFM3_EXBUS_TIM0_RADC2                *( ( volatile unsigned int * ) ( 0x427E0418UL ) )
    #define bFM3_EXBUS_TIM0_RADC3                *( ( volatile unsigned int * ) ( 0x427E041CUL ) )
    #define bFM3_EXBUS_TIM0_FRADC0               *( ( volatile unsigned int * ) ( 0x427E0420UL ) )
    #define bFM3_EXBUS_TIM0_FRADC1               *( ( volatile unsigned int * ) ( 0x427E0424UL ) )
    #define bFM3_EXBUS_TIM0_FRADC2               *( ( volatile unsigned int * ) ( 0x427E0428UL ) )
    #define bFM3_EXBUS_TIM0_FRADC3               *( ( volatile unsigned int * ) ( 0x427E042CUL ) )
    #define bFM3_EXBUS_TIM0_RIDLC0               *( ( volatile unsigned int * ) ( 0x427E0430UL ) )
    #define bFM3_EXBUS_TIM0_RIDLC1               *( ( volatile unsigned int * ) ( 0x427E0434UL ) )
    #define bFM3_EXBUS_TIM0_RIDLC2               *( ( volatile unsigned int * ) ( 0x427E0438UL ) )
    #define bFM3_EXBUS_TIM0_RIDLC3               *( ( volatile unsigned int * ) ( 0x427E043CUL ) )
    #define bFM3_EXBUS_TIM0_WACC0                *( ( volatile unsigned int * ) ( 0x427E0440UL ) )
    #define bFM3_EXBUS_TIM0_WACC1                *( ( volatile unsigned int * ) ( 0x427E0444UL ) )
    #define bFM3_EXBUS_TIM0_WACC2                *( ( volatile unsigned int * ) ( 0x427E0448UL ) )
    #define bFM3_EXBUS_TIM0_WACC3                *( ( volatile unsigned int * ) ( 0x427E044CUL ) )
    #define bFM3_EXBUS_TIM0_WADC0                *( ( volatile unsigned int * ) ( 0x427E0450UL ) )
    #define bFM3_EXBUS_TIM0_WADC1                *( ( volatile unsigned int * ) ( 0x427E0454UL ) )
    #define bFM3_EXBUS_TIM0_WADC2                *( ( volatile unsigned int * ) ( 0x427E0458UL ) )
    #define bFM3_EXBUS_TIM0_WADC3                *( ( volatile unsigned int * ) ( 0x427E045CUL ) )
    #define bFM3_EXBUS_TIM0_WWEC0                *( ( volatile unsigned int * ) ( 0x427E0460UL ) )
    #define bFM3_EXBUS_TIM0_WWEC1                *( ( volatile unsigned int * ) ( 0x427E0464UL ) )
    #define bFM3_EXBUS_TIM0_WWEC2                *( ( volatile unsigned int * ) ( 0x427E0468UL ) )
    #define bFM3_EXBUS_TIM0_WWEC3                *( ( volatile unsigned int * ) ( 0x427E046CUL ) )
    #define bFM3_EXBUS_TIM0_WIDLC0               *( ( volatile unsigned int * ) ( 0x427E0470UL ) )
    #define bFM3_EXBUS_TIM0_WIDLC1               *( ( volatile unsigned int * ) ( 0x427E0474UL ) )
    #define bFM3_EXBUS_TIM0_WIDLC2               *( ( volatile unsigned int * ) ( 0x427E0478UL ) )
    #define bFM3_EXBUS_TIM0_WIDLC3               *( ( volatile unsigned int * ) ( 0x427E047CUL ) )
    #define bFM3_EXBUS_TIM1_RACC0                *( ( volatile unsigned int * ) ( 0x427E0480UL ) )
    #define bFM3_EXBUS_TIM1_RACC1                *( ( volatile unsigned int * ) ( 0x427E0484UL ) )
    #define bFM3_EXBUS_TIM1_RACC2                *( ( volatile unsigned int * ) ( 0x427E0488UL ) )
    #define bFM3_EXBUS_TIM1_RACC3                *( ( volatile unsigned int * ) ( 0x427E048CUL ) )
    #define bFM3_EXBUS_TIM1_RADC0                *( ( volatile unsigned int * ) ( 0x427E0490UL ) )
    #define bFM3_EXBUS_TIM1_RADC1                *( ( volatile unsigned int * ) ( 0x427E0494UL ) )
    #define bFM3_EXBUS_TIM1_RADC2                *( ( volatile unsigned int * ) ( 0x427E0498UL ) )
    #define bFM3_EXBUS_TIM1_RADC3                *( ( volatile unsigned int * ) ( 0x427E049CUL ) )
    #define bFM3_EXBUS_TIM1_FRADC0               *( ( volatile unsigned int * ) ( 0x427E04A0UL ) )
    #define bFM3_EXBUS_TIM1_FRADC1               *( ( volatile unsigned int * ) ( 0x427E04A4UL ) )
    #define bFM3_EXBUS_TIM1_FRADC2               *( ( volatile unsigned int * ) ( 0x427E04A8UL ) )
    #define bFM3_EXBUS_TIM1_FRADC3               *( ( volatile unsigned int * ) ( 0x427E04ACUL ) )
    #define bFM3_EXBUS_TIM1_RIDLC0               *( ( volatile unsigned int * ) ( 0x427E04B0UL ) )
    #define bFM3_EXBUS_TIM1_RIDLC1               *( ( volatile unsigned int * ) ( 0x427E04B4UL ) )
    #define bFM3_EXBUS_TIM1_RIDLC2               *( ( volatile unsigned int * ) ( 0x427E04B8UL ) )
    #define bFM3_EXBUS_TIM1_RIDLC3               *( ( volatile unsigned int * ) ( 0x427E04BCUL ) )
    #define bFM3_EXBUS_TIM1_WACC0                *( ( volatile unsigned int * ) ( 0x427E04C0UL ) )
    #define bFM3_EXBUS_TIM1_WACC1                *( ( volatile unsigned int * ) ( 0x427E04C4UL ) )
    #define bFM3_EXBUS_TIM1_WACC2                *( ( volatile unsigned int * ) ( 0x427E04C8UL ) )
    #define bFM3_EXBUS_TIM1_WACC3                *( ( volatile unsigned int * ) ( 0x427E04CCUL ) )
    #define bFM3_EXBUS_TIM1_WADC0                *( ( volatile unsigned int * ) ( 0x427E04D0UL ) )
    #define bFM3_EXBUS_TIM1_WADC1                *( ( volatile unsigned int * ) ( 0x427E04D4UL ) )
    #define bFM3_EXBUS_TIM1_WADC2                *( ( volatile unsigned int * ) ( 0x427E04D8UL ) )
    #define bFM3_EXBUS_TIM1_WADC3                *( ( volatile unsigned int * ) ( 0x427E04DCUL ) )
    #define bFM3_EXBUS_TIM1_WWEC0                *( ( volatile unsigned int * ) ( 0x427E04E0UL ) )
    #define bFM3_EXBUS_TIM1_WWEC1                *( ( volatile unsigned int * ) ( 0x427E04E4UL ) )
    #define bFM3_EXBUS_TIM1_WWEC2                *( ( volatile unsigned int * ) ( 0x427E04E8UL ) )
    #define bFM3_EXBUS_TIM1_WWEC3                *( ( volatile unsigned int * ) ( 0x427E04ECUL ) )
    #define bFM3_EXBUS_TIM1_WIDLC0               *( ( volatile unsigned int * ) ( 0x427E04F0UL ) )
    #define bFM3_EXBUS_TIM1_WIDLC1               *( ( volatile unsigned int * ) ( 0x427E04F4UL ) )
    #define bFM3_EXBUS_TIM1_WIDLC2               *( ( volatile unsigned int * ) ( 0x427E04F8UL ) )
    #define bFM3_EXBUS_TIM1_WIDLC3               *( ( volatile unsigned int * ) ( 0x427E04FCUL ) )
    #define bFM3_EXBUS_TIM2_RACC0                *( ( volatile unsigned int * ) ( 0x427E0500UL ) )
    #define bFM3_EXBUS_TIM2_RACC1                *( ( volatile unsigned int * ) ( 0x427E0504UL ) )
    #define bFM3_EXBUS_TIM2_RACC2                *( ( volatile unsigned int * ) ( 0x427E0508UL ) )
    #define bFM3_EXBUS_TIM2_RACC3                *( ( volatile unsigned int * ) ( 0x427E050CUL ) )
    #define bFM3_EXBUS_TIM2_RADC0                *( ( volatile unsigned int * ) ( 0x427E0510UL ) )
    #define bFM3_EXBUS_TIM2_RADC1                *( ( volatile unsigned int * ) ( 0x427E0514UL ) )
    #define bFM3_EXBUS_TIM2_RADC2                *( ( volatile unsigned int * ) ( 0x427E0518UL ) )
    #define bFM3_EXBUS_TIM2_RADC3                *( ( volatile unsigned int * ) ( 0x427E051CUL ) )
    #define bFM3_EXBUS_TIM2_FRADC0               *( ( volatile unsigned int * ) ( 0x427E0520UL ) )
    #define bFM3_EXBUS_TIM2_FRADC1               *( ( volatile unsigned int * ) ( 0x427E0524UL ) )
    #define bFM3_EXBUS_TIM2_FRADC2               *( ( volatile unsigned int * ) ( 0x427E0528UL ) )
    #define bFM3_EXBUS_TIM2_FRADC3               *( ( volatile unsigned int * ) ( 0x427E052CUL ) )
    #define bFM3_EXBUS_TIM2_RIDLC0               *( ( volatile unsigned int * ) ( 0x427E0530UL ) )
    #define bFM3_EXBUS_TIM2_RIDLC1               *( ( volatile unsigned int * ) ( 0x427E0534UL ) )
    #define bFM3_EXBUS_TIM2_RIDLC2               *( ( volatile unsigned int * ) ( 0x427E0538UL ) )
    #define bFM3_EXBUS_TIM2_RIDLC3               *( ( volatile unsigned int * ) ( 0x427E053CUL ) )
    #define bFM3_EXBUS_TIM2_WACC0                *( ( volatile unsigned int * ) ( 0x427E0540UL ) )
    #define bFM3_EXBUS_TIM2_WACC1                *( ( volatile unsigned int * ) ( 0x427E0544UL ) )
    #define bFM3_EXBUS_TIM2_WACC2                *( ( volatile unsigned int * ) ( 0x427E0548UL ) )
    #define bFM3_EXBUS_TIM2_WACC3                *( ( volatile unsigned int * ) ( 0x427E054CUL ) )
    #define bFM3_EXBUS_TIM2_WADC0                *( ( volatile unsigned int * ) ( 0x427E0550UL ) )
    #define bFM3_EXBUS_TIM2_WADC1                *( ( volatile unsigned int * ) ( 0x427E0554UL ) )
    #define bFM3_EXBUS_TIM2_WADC2                *( ( volatile unsigned int * ) ( 0x427E0558UL ) )
    #define bFM3_EXBUS_TIM2_WADC3                *( ( volatile unsigned int * ) ( 0x427E055CUL ) )
    #define bFM3_EXBUS_TIM2_WWEC0                *( ( volatile unsigned int * ) ( 0x427E0560UL ) )
    #define bFM3_EXBUS_TIM2_WWEC1                *( ( volatile unsigned int * ) ( 0x427E0564UL ) )
    #define bFM3_EXBUS_TIM2_WWEC2                *( ( volatile unsigned int * ) ( 0x427E0568UL ) )
    #define bFM3_EXBUS_TIM2_WWEC3                *( ( volatile unsigned int * ) ( 0x427E056CUL ) )
    #define bFM3_EXBUS_TIM2_WIDLC0               *( ( volatile unsigned int * ) ( 0x427E0570UL ) )
    #define bFM3_EXBUS_TIM2_WIDLC1               *( ( volatile unsigned int * ) ( 0x427E0574UL ) )
    #define bFM3_EXBUS_TIM2_WIDLC2               *( ( volatile unsigned int * ) ( 0x427E0578UL ) )
    #define bFM3_EXBUS_TIM2_WIDLC3               *( ( volatile unsigned int * ) ( 0x427E057CUL ) )
    #define bFM3_EXBUS_TIM3_RACC0                *( ( volatile unsigned int * ) ( 0x427E0580UL ) )
    #define bFM3_EXBUS_TIM3_RACC1                *( ( volatile unsigned int * ) ( 0x427E0584UL ) )
    #define bFM3_EXBUS_TIM3_RACC2                *( ( volatile unsigned int * ) ( 0x427E0588UL ) )
    #define bFM3_EXBUS_TIM3_RACC3                *( ( volatile unsigned int * ) ( 0x427E058CUL ) )
    #define bFM3_EXBUS_TIM3_RADC0                *( ( volatile unsigned int * ) ( 0x427E0590UL ) )
    #define bFM3_EXBUS_TIM3_RADC1                *( ( volatile unsigned int * ) ( 0x427E0594UL ) )
    #define bFM3_EXBUS_TIM3_RADC2                *( ( volatile unsigned int * ) ( 0x427E0598UL ) )
    #define bFM3_EXBUS_TIM3_RADC3                *( ( volatile unsigned int * ) ( 0x427E059CUL ) )
    #define bFM3_EXBUS_TIM3_FRADC0               *( ( volatile unsigned int * ) ( 0x427E05A0UL ) )
    #define bFM3_EXBUS_TIM3_FRADC1               *( ( volatile unsigned int * ) ( 0x427E05A4UL ) )
    #define bFM3_EXBUS_TIM3_FRADC2               *( ( volatile unsigned int * ) ( 0x427E05A8UL ) )
    #define bFM3_EXBUS_TIM3_FRADC3               *( ( volatile unsigned int * ) ( 0x427E05ACUL ) )
    #define bFM3_EXBUS_TIM3_RIDLC0               *( ( volatile unsigned int * ) ( 0x427E05B0UL ) )
    #define bFM3_EXBUS_TIM3_RIDLC1               *( ( volatile unsigned int * ) ( 0x427E05B4UL ) )
    #define bFM3_EXBUS_TIM3_RIDLC2               *( ( volatile unsigned int * ) ( 0x427E05B8UL ) )
    #define bFM3_EXBUS_TIM3_RIDLC3               *( ( volatile unsigned int * ) ( 0x427E05BCUL ) )
    #define bFM3_EXBUS_TIM3_WACC0                *( ( volatile unsigned int * ) ( 0x427E05C0UL ) )
    #define bFM3_EXBUS_TIM3_WACC1                *( ( volatile unsigned int * ) ( 0x427E05C4UL ) )
    #define bFM3_EXBUS_TIM3_WACC2                *( ( volatile unsigned int * ) ( 0x427E05C8UL ) )
    #define bFM3_EXBUS_TIM3_WACC3                *( ( volatile unsigned int * ) ( 0x427E05CCUL ) )
    #define bFM3_EXBUS_TIM3_WADC0                *( ( volatile unsigned int * ) ( 0x427E05D0UL ) )
    #define bFM3_EXBUS_TIM3_WADC1                *( ( volatile unsigned int * ) ( 0x427E05D4UL ) )
    #define bFM3_EXBUS_TIM3_WADC2                *( ( volatile unsigned int * ) ( 0x427E05D8UL ) )
    #define bFM3_EXBUS_TIM3_WADC3                *( ( volatile unsigned int * ) ( 0x427E05DCUL ) )
    #define bFM3_EXBUS_TIM3_WWEC0                *( ( volatile unsigned int * ) ( 0x427E05E0UL ) )
    #define bFM3_EXBUS_TIM3_WWEC1                *( ( volatile unsigned int * ) ( 0x427E05E4UL ) )
    #define bFM3_EXBUS_TIM3_WWEC2                *( ( volatile unsigned int * ) ( 0x427E05E8UL ) )
    #define bFM3_EXBUS_TIM3_WWEC3                *( ( volatile unsigned int * ) ( 0x427E05ECUL ) )
    #define bFM3_EXBUS_TIM3_WIDLC0               *( ( volatile unsigned int * ) ( 0x427E05F0UL ) )
    #define bFM3_EXBUS_TIM3_WIDLC1               *( ( volatile unsigned int * ) ( 0x427E05F4UL ) )
    #define bFM3_EXBUS_TIM3_WIDLC2               *( ( volatile unsigned int * ) ( 0x427E05F8UL ) )
    #define bFM3_EXBUS_TIM3_WIDLC3               *( ( volatile unsigned int * ) ( 0x427E05FCUL ) )
    #define bFM3_EXBUS_TIM7_RACC0                *( ( volatile unsigned int * ) ( 0x427E0780UL ) )
    #define bFM3_EXBUS_TIM7_RACC1                *( ( volatile unsigned int * ) ( 0x427E0784UL ) )
    #define bFM3_EXBUS_TIM7_RACC2                *( ( volatile unsigned int * ) ( 0x427E0788UL ) )
    #define bFM3_EXBUS_TIM7_RACC3                *( ( volatile unsigned int * ) ( 0x427E078CUL ) )
    #define bFM3_EXBUS_TIM7_RADC0                *( ( volatile unsigned int * ) ( 0x427E0790UL ) )
    #define bFM3_EXBUS_TIM7_RADC1                *( ( volatile unsigned int * ) ( 0x427E0794UL ) )
    #define bFM3_EXBUS_TIM7_RADC2                *( ( volatile unsigned int * ) ( 0x427E0798UL ) )
    #define bFM3_EXBUS_TIM7_RADC3                *( ( volatile unsigned int * ) ( 0x427E079CUL ) )
    #define bFM3_EXBUS_TIM7_FRADC0               *( ( volatile unsigned int * ) ( 0x427E07A0UL ) )
    #define bFM3_EXBUS_TIM7_FRADC1               *( ( volatile unsigned int * ) ( 0x427E07A4UL ) )
    #define bFM3_EXBUS_TIM7_FRADC2               *( ( volatile unsigned int * ) ( 0x427E07A8UL ) )
    #define bFM3_EXBUS_TIM7_FRADC3               *( ( volatile unsigned int * ) ( 0x427E07ACUL ) )
    #define bFM3_EXBUS_TIM7_RIDLC0               *( ( volatile unsigned int * ) ( 0x427E07B0UL ) )
    #define bFM3_EXBUS_TIM7_RIDLC1               *( ( volatile unsigned int * ) ( 0x427E07B4UL ) )
    #define bFM3_EXBUS_TIM7_RIDLC2               *( ( volatile unsigned int * ) ( 0x427E07B8UL ) )
    #define bFM3_EXBUS_TIM7_RIDLC3               *( ( volatile unsigned int * ) ( 0x427E07BCUL ) )
    #define bFM3_EXBUS_TIM7_WACC0                *( ( volatile unsigned int * ) ( 0x427E07C0UL ) )
    #define bFM3_EXBUS_TIM7_WACC1                *( ( volatile unsigned int * ) ( 0x427E07C4UL ) )
    #define bFM3_EXBUS_TIM7_WACC2                *( ( volatile unsigned int * ) ( 0x427E07C8UL ) )
    #define bFM3_EXBUS_TIM7_WACC3                *( ( volatile unsigned int * ) ( 0x427E07CCUL ) )
    #define bFM3_EXBUS_TIM7_WADC0                *( ( volatile unsigned int * ) ( 0x427E07D0UL ) )
    #define bFM3_EXBUS_TIM7_WADC1                *( ( volatile unsigned int * ) ( 0x427E07D4UL ) )
    #define bFM3_EXBUS_TIM7_WADC2                *( ( volatile unsigned int * ) ( 0x427E07D8UL ) )
    #define bFM3_EXBUS_TIM7_WADC3                *( ( volatile unsigned int * ) ( 0x427E07DCUL ) )
    #define bFM3_EXBUS_TIM7_WWEC0                *( ( volatile unsigned int * ) ( 0x427E07E0UL ) )
    #define bFM3_EXBUS_TIM7_WWEC1                *( ( volatile unsigned int * ) ( 0x427E07E4UL ) )
    #define bFM3_EXBUS_TIM7_WWEC2                *( ( volatile unsigned int * ) ( 0x427E07E8UL ) )
    #define bFM3_EXBUS_TIM7_WWEC3                *( ( volatile unsigned int * ) ( 0x427E07ECUL ) )
    #define bFM3_EXBUS_TIM7_WIDLC0               *( ( volatile unsigned int * ) ( 0x427E07F0UL ) )
    #define bFM3_EXBUS_TIM7_WIDLC1               *( ( volatile unsigned int * ) ( 0x427E07F4UL ) )
    #define bFM3_EXBUS_TIM7_WIDLC2               *( ( volatile unsigned int * ) ( 0x427E07F8UL ) )
    #define bFM3_EXBUS_TIM7_WIDLC3               *( ( volatile unsigned int * ) ( 0x427E07FCUL ) )
    #define bFM3_EXBUS_AREA0_ADDR0               *( ( volatile unsigned int * ) ( 0x427E0800UL ) )
    #define bFM3_EXBUS_AREA0_ADDR1               *( ( volatile unsigned int * ) ( 0x427E0804UL ) )
    #define bFM3_EXBUS_AREA0_ADDR2               *( ( volatile unsigned int * ) ( 0x427E0808UL ) )
    #define bFM3_EXBUS_AREA0_ADDR3               *( ( volatile unsigned int * ) ( 0x427E080CUL ) )
    #define bFM3_EXBUS_AREA0_ADDR4               *( ( volatile unsigned int * ) ( 0x427E0810UL ) )
    #define bFM3_EXBUS_AREA0_ADDR5               *( ( volatile unsigned int * ) ( 0x427E0814UL ) )
    #define bFM3_EXBUS_AREA0_ADDR6               *( ( volatile unsigned int * ) ( 0x427E0818UL ) )
    #define bFM3_EXBUS_AREA0_ADDR7               *( ( volatile unsigned int * ) ( 0x427E081CUL ) )
    #define bFM3_EXBUS_AREA0_MASK0               *( ( volatile unsigned int * ) ( 0x427E0840UL ) )
    #define bFM3_EXBUS_AREA0_MASK1               *( ( volatile unsigned int * ) ( 0x427E0844UL ) )
    #define bFM3_EXBUS_AREA0_MASK2               *( ( volatile unsigned int * ) ( 0x427E0848UL ) )
    #define bFM3_EXBUS_AREA0_MASK3               *( ( volatile unsigned int * ) ( 0x427E084CUL ) )
    #define bFM3_EXBUS_AREA0_MASK4               *( ( volatile unsigned int * ) ( 0x427E0850UL ) )
    #define bFM3_EXBUS_AREA0_MASK5               *( ( volatile unsigned int * ) ( 0x427E0854UL ) )
    #define bFM3_EXBUS_AREA0_MASK6               *( ( volatile unsigned int * ) ( 0x427E0858UL ) )
    #define bFM3_EXBUS_AREA1_ADDR0               *( ( volatile unsigned int * ) ( 0x427E0880UL ) )
    #define bFM3_EXBUS_AREA1_ADDR1               *( ( volatile unsigned int * ) ( 0x427E0884UL ) )
    #define bFM3_EXBUS_AREA1_ADDR2               *( ( volatile unsigned int * ) ( 0x427E0888UL ) )
    #define bFM3_EXBUS_AREA1_ADDR3               *( ( volatile unsigned int * ) ( 0x427E088CUL ) )
    #define bFM3_EXBUS_AREA1_ADDR4               *( ( volatile unsigned int * ) ( 0x427E0890UL ) )
    #define bFM3_EXBUS_AREA1_ADDR5               *( ( volatile unsigned int * ) ( 0x427E0894UL ) )
    #define bFM3_EXBUS_AREA1_ADDR6               *( ( volatile unsigned int * ) ( 0x427E0898UL ) )
    #define bFM3_EXBUS_AREA1_ADDR7               *( ( volatile unsigned int * ) ( 0x427E089CUL ) )
    #define bFM3_EXBUS_AREA1_MASK0               *( ( volatile unsigned int * ) ( 0x427E08C0UL ) )
    #define bFM3_EXBUS_AREA1_MASK1               *( ( volatile unsigned int * ) ( 0x427E08C4UL ) )
    #define bFM3_EXBUS_AREA1_MASK2               *( ( volatile unsigned int * ) ( 0x427E08C8UL ) )
    #define bFM3_EXBUS_AREA1_MASK3               *( ( volatile unsigned int * ) ( 0x427E08CCUL ) )
    #define bFM3_EXBUS_AREA1_MASK4               *( ( volatile unsigned int * ) ( 0x427E08D0UL ) )
    #define bFM3_EXBUS_AREA1_MASK5               *( ( volatile unsigned int * ) ( 0x427E08D4UL ) )
