FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_EXBUS_AREA1_MASK6               *( ( volatile unsigned int * ) ( 0x427E08D8UL ) )
    #define bFM3_EXBUS_AREA2_ADDR0               *( ( volatile unsigned int * ) ( 0x427E0900UL ) )
    #define bFM3_EXBUS_AREA2_ADDR1               *( ( volatile unsigned int * ) ( 0x427E0904UL ) )
    #define bFM3_EXBUS_AREA2_ADDR2               *( ( volatile unsigned int * ) ( 0x427E0908UL ) )
    #define bFM3_EXBUS_AREA2_ADDR3               *( ( volatile unsigned int * ) ( 0x427E090CUL ) )
    #define bFM3_EXBUS_AREA2_ADDR4               *( ( volatile unsigned int * ) ( 0x427E0910UL ) )
    #define bFM3_EXBUS_AREA2_ADDR5               *( ( volatile unsigned int * ) ( 0x427E0914UL ) )
    #define bFM3_EXBUS_AREA2_ADDR6               *( ( volatile unsigned int * ) ( 0x427E0918UL ) )
    #define bFM3_EXBUS_AREA2_ADDR7               *( ( volatile unsigned int * ) ( 0x427E091CUL ) )
    #define bFM3_EXBUS_AREA2_MASK0               *( ( volatile unsigned int * ) ( 0x427E0940UL ) )
    #define bFM3_EXBUS_AREA2_MASK1               *( ( volatile unsigned int * ) ( 0x427E0944UL ) )
    #define bFM3_EXBUS_AREA2_MASK2               *( ( volatile unsigned int * ) ( 0x427E0948UL ) )
    #define bFM3_EXBUS_AREA2_MASK3               *( ( volatile unsigned int * ) ( 0x427E094CUL ) )
    #define bFM3_EXBUS_AREA2_MASK4               *( ( volatile unsigned int * ) ( 0x427E0950UL ) )
    #define bFM3_EXBUS_AREA2_MASK5               *( ( volatile unsigned int * ) ( 0x427E0954UL ) )
    #define bFM3_EXBUS_AREA2_MASK6               *( ( volatile unsigned int * ) ( 0x427E0958UL ) )
    #define bFM3_EXBUS_AREA3_ADDR0               *( ( volatile unsigned int * ) ( 0x427E0980UL ) )
    #define bFM3_EXBUS_AREA3_ADDR1               *( ( volatile unsigned int * ) ( 0x427E0984UL ) )
    #define bFM3_EXBUS_AREA3_ADDR2               *( ( volatile unsigned int * ) ( 0x427E0988UL ) )
    #define bFM3_EXBUS_AREA3_ADDR3               *( ( volatile unsigned int * ) ( 0x427E098CUL ) )
    #define bFM3_EXBUS_AREA3_ADDR4               *( ( volatile unsigned int * ) ( 0x427E0990UL ) )
    #define bFM3_EXBUS_AREA3_ADDR5               *( ( volatile unsigned int * ) ( 0x427E0994UL ) )
    #define bFM3_EXBUS_AREA3_ADDR6               *( ( volatile unsigned int * ) ( 0x427E0998UL ) )
    #define bFM3_EXBUS_AREA3_ADDR7               *( ( volatile unsigned int * ) ( 0x427E099CUL ) )
    #define bFM3_EXBUS_AREA3_MASK0               *( ( volatile unsigned int * ) ( 0x427E09C0UL ) )
    #define bFM3_EXBUS_AREA3_MASK1               *( ( volatile unsigned int * ) ( 0x427E09C4UL ) )
    #define bFM3_EXBUS_AREA3_MASK2               *( ( volatile unsigned int * ) ( 0x427E09C8UL ) )
    #define bFM3_EXBUS_AREA3_MASK3               *( ( volatile unsigned int * ) ( 0x427E09CCUL ) )
    #define bFM3_EXBUS_AREA3_MASK4               *( ( volatile unsigned int * ) ( 0x427E09D0UL ) )
    #define bFM3_EXBUS_AREA3_MASK5               *( ( volatile unsigned int * ) ( 0x427E09D4UL ) )
    #define bFM3_EXBUS_AREA3_MASK6               *( ( volatile unsigned int * ) ( 0x427E09D8UL ) )
    #define bFM3_EXBUS_AREA7_ADDR0               *( ( volatile unsigned int * ) ( 0x427E0B80UL ) )
    #define bFM3_EXBUS_AREA7_ADDR1               *( ( volatile unsigned int * ) ( 0x427E0B84UL ) )
    #define bFM3_EXBUS_AREA7_ADDR2               *( ( volatile unsigned int * ) ( 0x427E0B88UL ) )
    #define bFM3_EXBUS_AREA7_ADDR3               *( ( volatile unsigned int * ) ( 0x427E0B8CUL ) )
    #define bFM3_EXBUS_AREA7_ADDR4               *( ( volatile unsigned int * ) ( 0x427E0B90UL ) )
    #define bFM3_EXBUS_AREA7_ADDR5               *( ( volatile unsigned int * ) ( 0x427E0B94UL ) )
    #define bFM3_EXBUS_AREA7_ADDR6               *( ( volatile unsigned int * ) ( 0x427E0B98UL ) )
    #define bFM3_EXBUS_AREA7_ADDR7               *( ( volatile unsigned int * ) ( 0x427E0B9CUL ) )
    #define bFM3_EXBUS_AREA7_MASK0               *( ( volatile unsigned int * ) ( 0x427E0BC0UL ) )
    #define bFM3_EXBUS_AREA7_MASK1               *( ( volatile unsigned int * ) ( 0x427E0BC4UL ) )
    #define bFM3_EXBUS_AREA7_MASK2               *( ( volatile unsigned int * ) ( 0x427E0BC8UL ) )
    #define bFM3_EXBUS_AREA7_MASK3               *( ( volatile unsigned int * ) ( 0x427E0BCCUL ) )
    #define bFM3_EXBUS_AREA7_MASK4               *( ( volatile unsigned int * ) ( 0x427E0BD0UL ) )
    #define bFM3_EXBUS_AREA7_MASK5               *( ( volatile unsigned int * ) ( 0x427E0BD4UL ) )
    #define bFM3_EXBUS_AREA7_MASK6               *( ( volatile unsigned int * ) ( 0x427E0BD8UL ) )

/* USB channel 0 registers */
    #define bFM3_USB0_HCNT_HOST                  *( ( volatile unsigned int * ) ( 0x42842000UL ) )
    #define bFM3_USB0_HCNT_URST                  *( ( volatile unsigned int * ) ( 0x42842004UL ) )
    #define bFM3_USB0_HCNT_SOFIRE                *( ( volatile unsigned int * ) ( 0x42842008UL ) )
    #define bFM3_USB0_HCNT_DIRE                  *( ( volatile unsigned int * ) ( 0x4284200CUL ) )
    #define bFM3_USB0_HCNT_CNNIRE                *( ( volatile unsigned int * ) ( 0x42842010UL ) )
    #define bFM3_USB0_HCNT_CMPIRE                *( ( volatile unsigned int * ) ( 0x42842014UL ) )
    #define bFM3_USB0_HCNT_URIRE                 *( ( volatile unsigned int * ) ( 0x42842018UL ) )
    #define bFM3_USB0_HCNT_RWKIRE                *( ( volatile unsigned int * ) ( 0x4284201CUL ) )
    #define bFM3_USB0_HCNT_RETRY                 *( ( volatile unsigned int * ) ( 0x42842020UL ) )
    #define bFM3_USB0_HCNT_CANCEL                *( ( volatile unsigned int * ) ( 0x42842024UL ) )
    #define bFM3_USB0_HCNT_SOFSTEP               *( ( volatile unsigned int * ) ( 0x42842028UL ) )
    #define bFM3_USB0_HCNT0_HOST                 *( ( volatile unsigned int * ) ( 0x42842000UL ) )
    #define bFM3_USB0_HCNT0_URST                 *( ( volatile unsigned int * ) ( 0x42842004UL ) )
    #define bFM3_USB0_HCNT0_SOFIRE               *( ( volatile unsigned int * ) ( 0x42842008UL ) )
    #define bFM3_USB0_HCNT0_DIRE                 *( ( volatile unsigned int * ) ( 0x4284200CUL ) )
    #define bFM3_USB0_HCNT0_CNNIRE               *( ( volatile unsigned int * ) ( 0x42842010UL ) )
    #define bFM3_USB0_HCNT0_CMPIRE               *( ( volatile unsigned int * ) ( 0x42842014UL ) )
    #define bFM3_USB0_HCNT0_URIRE                *( ( volatile unsigned int * ) ( 0x42842018UL ) )
    #define bFM3_USB0_HCNT0_RWKIRE               *( ( volatile unsigned int * ) ( 0x4284201CUL ) )
    #define bFM3_USB0_HCNT1_RETRY                *( ( volatile unsigned int * ) ( 0x42842020UL ) )
    #define bFM3_USB0_HCNT1_CANCEL               *( ( volatile unsigned int * ) ( 0x42842024UL ) )
    #define bFM3_USB0_HCNT1_SOFSTEP              *( ( volatile unsigned int * ) ( 0x42842028UL ) )
    #define bFM3_USB0_HIRQ_SOFIRQ                *( ( volatile unsigned int * ) ( 0x42842080UL ) )
    #define bFM3_USB0_HIRQ_DIRQ                  *( ( volatile unsigned int * ) ( 0x42842084UL ) )
    #define bFM3_USB0_HIRQ_CNNIRQ                *( ( volatile unsigned int * ) ( 0x42842088UL ) )
    #define bFM3_USB0_HIRQ_CMPIRQ                *( ( volatile unsigned int * ) ( 0x4284208CUL ) )
    #define bFM3_USB0_HIRQ_URIRQ                 *( ( volatile unsigned int * ) ( 0x42842090UL ) )
    #define bFM3_USB0_HIRQ_RWKIRQ                *( ( volatile unsigned int * ) ( 0x42842094UL ) )
    #define bFM3_USB0_HIRQ_TCAN                  *( ( volatile unsigned int * ) ( 0x4284209CUL ) )
    #define bFM3_USB0_HERR_HS0                   *( ( volatile unsigned int * ) ( 0x428420A0UL ) )
    #define bFM3_USB0_HERR_HS1                   *( ( volatile unsigned int * ) ( 0x428420A4UL ) )
    #define bFM3_USB0_HERR_STUFF                 *( ( volatile unsigned int * ) ( 0x428420A8UL ) )
    #define bFM3_USB0_HERR_TGERR                 *( ( volatile unsigned int * ) ( 0x428420ACUL ) )
    #define bFM3_USB0_HERR_CRC                   *( ( volatile unsigned int * ) ( 0x428420B0UL ) )
    #define bFM3_USB0_HERR_TOUT                  *( ( volatile unsigned int * ) ( 0x428420B4UL ) )
    #define bFM3_USB0_HERR_RERR                  *( ( volatile unsigned int * ) ( 0x428420B8UL ) )
    #define bFM3_USB0_HERR_LSTOF                 *( ( volatile unsigned int * ) ( 0x428420BCUL ) )
    #define bFM3_USB0_HSTATE_CSTAT               *( ( volatile unsigned int * ) ( 0x42842100UL ) )
    #define bFM3_USB0_HSTATE_TMODE               *( ( volatile unsigned int * ) ( 0x42842104UL ) )
    #define bFM3_USB0_HSTATE_SUSP                *( ( volatile unsigned int * ) ( 0x42842108UL ) )
    #define bFM3_USB0_HSTATE_SOFBUSY             *( ( volatile unsigned int * ) ( 0x4284210CUL ) )
    #define bFM3_USB0_HSTATE_CLKSEL              *( ( volatile unsigned int * ) ( 0x42842110UL ) )
    #define bFM3_USB0_HSTATE_ALIVE               *( ( volatile unsigned int * ) ( 0x42842114UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP0          *( ( volatile unsigned int * ) ( 0x42842120UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP1          *( ( volatile unsigned int * ) ( 0x42842124UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP2          *( ( volatile unsigned int * ) ( 0x42842128UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP3          *( ( volatile unsigned int * ) ( 0x4284212CUL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP4          *( ( volatile unsigned int * ) ( 0x42842130UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP5          *( ( volatile unsigned int * ) ( 0x42842134UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP6          *( ( volatile unsigned int * ) ( 0x42842138UL ) )
    #define bFM3_USB0_HFCOMP_FRAMECOMP7          *( ( volatile unsigned int * ) ( 0x4284213CUL ) )
    #define bFM3_USB0_HRTIMER_RTIMER0            *( ( volatile unsigned int * ) ( 0x42842180UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER1            *( ( volatile unsigned int * ) ( 0x42842184UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER2            *( ( volatile unsigned int * ) ( 0x42842188UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER3            *( ( volatile unsigned int * ) ( 0x4284218CUL ) )
    #define bFM3_USB0_HRTIMER_RTIMER4            *( ( volatile unsigned int * ) ( 0x42842190UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER5            *( ( volatile unsigned int * ) ( 0x42842194UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER6            *( ( volatile unsigned int * ) ( 0x42842198UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER7            *( ( volatile unsigned int * ) ( 0x4284219CUL ) )
    #define bFM3_USB0_HRTIMER_RTIMER8            *( ( volatile unsigned int * ) ( 0x428421A0UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER9            *( ( volatile unsigned int * ) ( 0x428421A4UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER10           *( ( volatile unsigned int * ) ( 0x428421A8UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER11           *( ( volatile unsigned int * ) ( 0x428421ACUL ) )
    #define bFM3_USB0_HRTIMER_RTIMER12           *( ( volatile unsigned int * ) ( 0x428421B0UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER13           *( ( volatile unsigned int * ) ( 0x428421B4UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER14           *( ( volatile unsigned int * ) ( 0x428421B8UL ) )
    #define bFM3_USB0_HRTIMER_RTIMER15           *( ( volatile unsigned int * ) ( 0x428421BCUL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER00          *( ( volatile unsigned int * ) ( 0x42842180UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER01          *( ( volatile unsigned int * ) ( 0x42842184UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER02          *( ( volatile unsigned int * ) ( 0x42842188UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER03          *( ( volatile unsigned int * ) ( 0x4284218CUL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER04          *( ( volatile unsigned int * ) ( 0x42842190UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER05          *( ( volatile unsigned int * ) ( 0x42842194UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER06          *( ( volatile unsigned int * ) ( 0x42842198UL ) )
    #define bFM3_USB0_HRTIMER0_RTIMER07          *( ( volatile unsigned int * ) ( 0x4284219CUL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER10          *( ( volatile unsigned int * ) ( 0x428421A0UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER11          *( ( volatile unsigned int * ) ( 0x428421A4UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER12          *( ( volatile unsigned int * ) ( 0x428421A8UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER13          *( ( volatile unsigned int * ) ( 0x428421ACUL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER14          *( ( volatile unsigned int * ) ( 0x428421B0UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER15          *( ( volatile unsigned int * ) ( 0x428421B4UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER16          *( ( volatile unsigned int * ) ( 0x428421B8UL ) )
    #define bFM3_USB0_HRTIMER1_RTIMER17          *( ( volatile unsigned int * ) ( 0x428421BCUL ) )
    #define bFM3_USB0_HRTIMER2_RTIMER20          *( ( volatile unsigned int * ) ( 0x42842200UL ) )
    #define bFM3_USB0_HRTIMER2_RTIMER21          *( ( volatile unsigned int * ) ( 0x42842204UL ) )
    #define bFM3_USB0_HRTIMER2_RTIMER22          *( ( volatile unsigned int * ) ( 0x42842208UL ) )
    #define bFM3_USB0_HADR_ADDRESS0              *( ( volatile unsigned int * ) ( 0x42842220UL ) )
    #define bFM3_USB0_HADR_ADDRESS1              *( ( volatile unsigned int * ) ( 0x42842224UL ) )
    #define bFM3_USB0_HADR_ADDRESS2              *( ( volatile unsigned int * ) ( 0x42842228UL ) )
    #define bFM3_USB0_HADR_ADDRESS3              *( ( volatile unsigned int * ) ( 0x4284222CUL ) )
    #define bFM3_USB0_HADR_ADDRESS4              *( ( volatile unsigned int * ) ( 0x42842230UL ) )
    #define bFM3_USB0_HADR_ADDRESS5              *( ( volatile unsigned int * ) ( 0x42842234UL ) )
    #define bFM3_USB0_HADR_ADDRESS6              *( ( volatile unsigned int * ) ( 0x42842238UL ) )
    #define bFM3_USB0_HEOF_EOF0                  *( ( volatile unsigned int * ) ( 0x42842280UL ) )
    #define bFM3_USB0_HEOF_EOF1                  *( ( volatile unsigned int * ) ( 0x42842284UL ) )
    #define bFM3_USB0_HEOF_EOF2                  *( ( volatile unsigned int * ) ( 0x42842288UL ) )
    #define bFM3_USB0_HEOF_EOF3                  *( ( volatile unsigned int * ) ( 0x4284228CUL ) )
    #define bFM3_USB0_HEOF_EOF4                  *( ( volatile unsigned int * ) ( 0x42842290UL ) )
    #define bFM3_USB0_HEOF_EOF5                  *( ( volatile unsigned int * ) ( 0x42842294UL ) )
    #define bFM3_USB0_HEOF_EOF6                  *( ( volatile unsigned int * ) ( 0x42842298UL ) )
    #define bFM3_USB0_HEOF_EOF7                  *( ( volatile unsigned int * ) ( 0x4284229CUL ) )
    #define bFM3_USB0_HEOF_EOF8                  *( ( volatile unsigned int * ) ( 0x428422A0UL ) )
    #define bFM3_USB0_HEOF_EOF9                  *( ( volatile unsigned int * ) ( 0x428422A4UL ) )
    #define bFM3_USB0_HEOF_EOF10                 *( ( volatile unsigned int * ) ( 0x428422A8UL ) )
    #define bFM3_USB0_HEOF_EOF11                 *( ( volatile unsigned int * ) ( 0x428422ACUL ) )
    #define bFM3_USB0_HEOF_EOF12                 *( ( volatile unsigned int * ) ( 0x428422B0UL ) )
    #define bFM3_USB0_HEOF_EOF13                 *( ( volatile unsigned int * ) ( 0x428422B4UL ) )
    #define bFM3_USB0_HEOF_EOF14                 *( ( volatile unsigned int * ) ( 0x428422B8UL ) )
    #define bFM3_USB0_HEOF_EOF15                 *( ( volatile unsigned int * ) ( 0x428422BCUL ) )
    #define bFM3_USB0_HEOF0_EOF00                *( ( volatile unsigned int * ) ( 0x42842280UL ) )
    #define bFM3_USB0_HEOF0_EOF01                *( ( volatile unsigned int * ) ( 0x42842284UL ) )
    #define bFM3_USB0_HEOF0_EOF02                *( ( volatile unsigned int * ) ( 0x42842288UL ) )
    #define bFM3_USB0_HEOF0_EOF03                *( ( volatile unsigned int * ) ( 0x4284228CUL ) )
    #define bFM3_USB0_HEOF0_EOF04                *( ( volatile unsigned int * ) ( 0x42842290UL ) )
    #define bFM3_USB0_HEOF0_EOF05                *( ( volatile unsigned int * ) ( 0x42842294UL ) )
    #define bFM3_USB0_HEOF0_EOF06                *( ( volatile unsigned int * ) ( 0x42842298UL ) )
    #define bFM3_USB0_HEOF0_EOF07                *( ( volatile unsigned int * ) ( 0x4284229CUL ) )
    #define bFM3_USB0_HEOF1_EOF10                *( ( volatile unsigned int * ) ( 0x428422A0UL ) )
    #define bFM3_USB0_HEOF1_EOF11                *( ( volatile unsigned int * ) ( 0x428422A4UL ) )
    #define bFM3_USB0_HEOF1_EOF12                *( ( volatile unsigned int * ) ( 0x428422A8UL ) )
    #define bFM3_USB0_HEOF1_EOF13                *( ( volatile unsigned int * ) ( 0x428422ACUL ) )
    #define bFM3_USB0_HEOF1_EOF14                *( ( volatile unsigned int * ) ( 0x428422B0UL ) )
    #define bFM3_USB0_HEOF1_EOF15                *( ( volatile unsigned int * ) ( 0x428422B4UL ) )
    #define bFM3_USB0_HFRAME_FRAME0              *( ( volatile unsigned int * ) ( 0x42842300UL ) )
    #define bFM3_USB0_HFRAME_FRAME1              *( ( volatile unsigned int * ) ( 0x42842304UL ) )
    #define bFM3_USB0_HFRAME_FRAME2              *( ( volatile unsigned int * ) ( 0x42842308UL ) )
    #define bFM3_USB0_HFRAME_FRAME3              *( ( volatile unsigned int * ) ( 0x4284230CUL ) )
    #define bFM3_USB0_HFRAME_FRAME4              *( ( volatile unsigned int * ) ( 0x42842310UL ) )
    #define bFM3_USB0_HFRAME_FRAME5              *( ( volatile unsigned int * ) ( 0x42842314UL ) )
    #define bFM3_USB0_HFRAME_FRAME6              *( ( volatile unsigned int * ) ( 0x42842318UL ) )
    #define bFM3_USB0_HFRAME_FRAME7              *( ( volatile unsigned int * ) ( 0x4284231CUL ) )
    #define bFM3_USB0_HFRAME_FRAME8              *( ( volatile unsigned int * ) ( 0x42842320UL ) )
    #define bFM3_USB0_HFRAME_FRAME9              *( ( volatile unsigned int * ) ( 0x42842324UL ) )
    #define bFM3_USB0_HFRAME_FRAME10             *( ( volatile unsigned int * ) ( 0x42842328UL ) )
    #define bFM3_USB0_HFRAME0_FRAME00            *( ( volatile unsigned int * ) ( 0x42842300UL ) )
    #define bFM3_USB0_HFRAME0_FRAME01            *( ( volatile unsigned int * ) ( 0x42842304UL ) )
    #define bFM3_USB0_HFRAME0_FRAME02            *( ( volatile unsigned int * ) ( 0x42842308UL ) )
    #define bFM3_USB0_HFRAME0_FRAME03            *( ( volatile unsigned int * ) ( 0x4284230CUL ) )
    #define bFM3_USB0_HFRAME0_FRAME04            *( ( volatile unsigned int * ) ( 0x42842310UL ) )
    #define bFM3_USB0_HFRAME0_FRAME05            *( ( volatile unsigned int * ) ( 0x42842314UL ) )
    #define bFM3_USB0_HFRAME0_FRAME06            *( ( volatile unsigned int * ) ( 0x42842318UL ) )
    #define bFM3_USB0_HFRAME0_FRAME07            *( ( volatile unsigned int * ) ( 0x4284231CUL ) )
    #define bFM3_USB0_HFRAME1_FRAME10            *( ( volatile unsigned int * ) ( 0x42842320UL ) )
    #define bFM3_USB0_HFRAME1_FRAME11            *( ( volatile unsigned int * ) ( 0x42842324UL ) )
    #define bFM3_USB0_HFRAME1_FRAME12            *( ( volatile unsigned int * ) ( 0x42842328UL ) )
    #define bFM3_USB0_HFRAME1_FRAME13            *( ( volatile unsigned int * ) ( 0x4284232CUL ) )
    #define bFM3_USB0_HTOKEN_ENDPT0              *( ( volatile unsigned int * ) ( 0x42842380UL ) )
    #define bFM3_USB0_HTOKEN_ENDPT1              *( ( volatile unsigned int * ) ( 0x42842384UL ) )
    #define bFM3_USB0_HTOKEN_ENDPT2              *( ( volatile unsigned int * ) ( 0x42842388UL ) )
    #define bFM3_USB0_HTOKEN_ENDPT3              *( ( volatile unsigned int * ) ( 0x4284238CUL ) )
    #define bFM3_USB0_HTOKEN_TKNEN0              *( ( volatile unsigned int * ) ( 0x42842390UL ) )
    #define bFM3_USB0_HTOKEN_TKNEN1              *( ( volatile unsigned int * ) ( 0x42842394UL ) )
    #define bFM3_USB0_HTOKEN_TKNEN2              *( ( volatile unsigned int * ) ( 0x42842398UL ) )
    #define bFM3_USB0_HTOKEN_TGGL                *( ( volatile unsigned int * ) ( 0x4284239CUL ) )
    #define bFM3_USB0_UDCC_PWC                   *( ( volatile unsigned int * ) ( 0x42842400UL ) )
    #define bFM3_USB0_UDCC_RFBK                  *( ( volatile unsigned int * ) ( 0x42842404UL ) )
    #define bFM3_USB0_UDCC_STALCLREN             *( ( volatile unsigned int * ) ( 0x4284240CUL ) )
    #define bFM3_USB0_UDCC_USTP                  *( ( volatile unsigned int * ) ( 0x42842410UL ) )
    #define bFM3_USB0_UDCC_HCONX                 *( ( volatile unsigned int * ) ( 0x42842414UL ) )
    #define bFM3_USB0_UDCC_RESUM                 *( ( volatile unsigned int * ) ( 0x42842418UL ) )
    #define bFM3_USB0_UDCC_RST                   *( ( volatile unsigned int * ) ( 0x4284241CUL ) )
    #define bFM3_USB0_EP0C_PKS00                 *( ( volatile unsigned int * ) ( 0x42842480UL ) )
    #define bFM3_USB0_EP0C_PKS01                 *( ( volatile unsigned int * ) ( 0x42842484UL ) )
    #define bFM3_USB0_EP0C_PKS02                 *( ( volatile unsigned int * ) ( 0x42842488UL ) )
    #define bFM3_USB0_EP0C_PKS03                 *( ( volatile unsigned int * ) ( 0x4284248CUL ) )
    #define bFM3_USB0_EP0C_PKS04                 *( ( volatile unsigned int * ) ( 0x42842490UL ) )
    #define bFM3_USB0_EP0C_PKS05                 *( ( volatile unsigned int * ) ( 0x42842494UL ) )
    #define bFM3_USB0_EP0C_PKS06                 *( ( volatile unsigned int * ) ( 0x42842498UL ) )
    #define bFM3_USB0_EP0C_STAL                  *( ( volatile unsigned int * ) ( 0x428424A4UL ) )
    #define bFM3_USB0_EP1C_PKS10                 *( ( volatile unsigned int * ) ( 0x42842500UL ) )
    #define bFM3_USB0_EP1C_PKS11                 *( ( volatile unsigned int * ) ( 0x42842504UL ) )
    #define bFM3_USB0_EP1C_PKS12                 *( ( volatile unsigned int * ) ( 0x42842508UL ) )
    #define bFM3_USB0_EP1C_PKS13                 *( ( volatile unsigned int * ) ( 0x4284250CUL ) )
    #define bFM3_USB0_EP1C_PKS14                 *( ( volatile unsigned int * ) ( 0x42842510UL ) )
    #define bFM3_USB0_EP1C_PKS15                 *( ( volatile unsigned int * ) ( 0x42842514UL ) )
    #define bFM3_USB0_EP1C_PKS16                 *( ( volatile unsigned int * ) ( 0x42842518UL ) )
    #define bFM3_USB0_EP1C_PKS17                 *( ( volatile unsigned int * ) ( 0x4284251CUL ) )
    #define bFM3_USB0_EP1C_PSK18                 *( ( volatile unsigned int * ) ( 0x42842520UL ) )
    #define bFM3_USB0_EP1C_STAL                  *( ( volatile unsigned int * ) ( 0x42842524UL ) )
    #define bFM3_USB0_EP1C_NULE                  *( ( volatile unsigned int * ) ( 0x42842528UL ) )
    #define bFM3_USB0_EP1C_DMAE                  *( ( volatile unsigned int * ) ( 0x4284252CUL ) )
    #define bFM3_USB0_EP1C_DIR                   *( ( volatile unsigned int * ) ( 0x42842530UL ) )
    #define bFM3_USB0_EP1C_TYPE0                 *( ( volatile unsigned int * ) ( 0x42842534UL ) )
    #define bFM3_USB0_EP1C_TYPE1                 *( ( volatile unsigned int * ) ( 0x42842538UL ) )
    #define bFM3_USB0_EP1C_EPEN                  *( ( volatile unsigned int * ) ( 0x4284253CUL ) )
    #define bFM3_USB0_EP2C_PKS20                 *( ( volatile unsigned int * ) ( 0x42842580UL ) )
    #define bFM3_USB0_EP2C_PKS21                 *( ( volatile unsigned int * ) ( 0x42842584UL ) )
    #define bFM3_USB0_EP2C_PKS22                 *( ( volatile unsigned int * ) ( 0x42842588UL ) )
    #define bFM3_USB0_EP2C_PKS23                 *( ( volatile unsigned int * ) ( 0x4284258CUL ) )
    #define bFM3_USB0_EP2C_PKS24                 *( ( volatile unsigned int * ) ( 0x42842590UL ) )
    #define bFM3_USB0_EP2C_PKS25                 *( ( volatile unsigned int * ) ( 0x42842594UL ) )
    #define bFM3_USB0_EP2C_PKS26                 *( ( volatile unsigned int * ) ( 0x42842598UL ) )
    #define bFM3_USB0_EP2C_STAL                  *( ( volatile unsigned int * ) ( 0x428425A4UL ) )
    #define bFM3_USB0_EP2C_NULE                  *( ( volatile unsigned int * ) ( 0x428425A8UL ) )
    #define bFM3_USB0_EP2C_DMAE                  *( ( volatile unsigned int * ) ( 0x428425ACUL ) )
    #define bFM3_USB0_EP2C_DIR                   *( ( volatile unsigned int * ) ( 0x428425B0UL ) )
