FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_USB0_EP2C_TYPE0                 *( ( volatile unsigned int * ) ( 0x428425B4UL ) )
    #define bFM3_USB0_EP2C_TYPE1                 *( ( volatile unsigned int * ) ( 0x428425B8UL ) )
    #define bFM3_USB0_EP2C_EPEN                  *( ( volatile unsigned int * ) ( 0x428425BCUL ) )
    #define bFM3_USB0_EP3C_PKS30                 *( ( volatile unsigned int * ) ( 0x42842600UL ) )
    #define bFM3_USB0_EP3C_PKS31                 *( ( volatile unsigned int * ) ( 0x42842604UL ) )
    #define bFM3_USB0_EP3C_PKS32                 *( ( volatile unsigned int * ) ( 0x42842608UL ) )
    #define bFM3_USB0_EP3C_PKS33                 *( ( volatile unsigned int * ) ( 0x4284260CUL ) )
    #define bFM3_USB0_EP3C_PKS34                 *( ( volatile unsigned int * ) ( 0x42842610UL ) )
    #define bFM3_USB0_EP3C_PKS35                 *( ( volatile unsigned int * ) ( 0x42842614UL ) )
    #define bFM3_USB0_EP3C_PKS36                 *( ( volatile unsigned int * ) ( 0x42842618UL ) )
    #define bFM3_USB0_EP3C_STAL                  *( ( volatile unsigned int * ) ( 0x42842624UL ) )
    #define bFM3_USB0_EP3C_NULE                  *( ( volatile unsigned int * ) ( 0x42842628UL ) )
    #define bFM3_USB0_EP3C_DMAE                  *( ( volatile unsigned int * ) ( 0x4284262CUL ) )
    #define bFM3_USB0_EP3C_DIR                   *( ( volatile unsigned int * ) ( 0x42842630UL ) )
    #define bFM3_USB0_EP3C_TYPE0                 *( ( volatile unsigned int * ) ( 0x42842634UL ) )
    #define bFM3_USB0_EP3C_TYPE1                 *( ( volatile unsigned int * ) ( 0x42842638UL ) )
    #define bFM3_USB0_EP3C_EPEN                  *( ( volatile unsigned int * ) ( 0x4284263CUL ) )
    #define bFM3_USB0_EP4C_PKS40                 *( ( volatile unsigned int * ) ( 0x42842680UL ) )
    #define bFM3_USB0_EP4C_PKS41                 *( ( volatile unsigned int * ) ( 0x42842684UL ) )
    #define bFM3_USB0_EP4C_PKS42                 *( ( volatile unsigned int * ) ( 0x42842688UL ) )
    #define bFM3_USB0_EP4C_PKS43                 *( ( volatile unsigned int * ) ( 0x4284268CUL ) )
    #define bFM3_USB0_EP4C_PKS44                 *( ( volatile unsigned int * ) ( 0x42842690UL ) )
    #define bFM3_USB0_EP4C_PKS45                 *( ( volatile unsigned int * ) ( 0x42842694UL ) )
    #define bFM3_USB0_EP4C_PKS46                 *( ( volatile unsigned int * ) ( 0x42842698UL ) )
    #define bFM3_USB0_EP4C_STAL                  *( ( volatile unsigned int * ) ( 0x428426A4UL ) )
    #define bFM3_USB0_EP4C_NULE                  *( ( volatile unsigned int * ) ( 0x428426A8UL ) )
    #define bFM3_USB0_EP4C_DMAE                  *( ( volatile unsigned int * ) ( 0x428426ACUL ) )
    #define bFM3_USB0_EP4C_DIR                   *( ( volatile unsigned int * ) ( 0x428426B0UL ) )
    #define bFM3_USB0_EP4C_TYPE0                 *( ( volatile unsigned int * ) ( 0x428426B4UL ) )
    #define bFM3_USB0_EP4C_TYPE1                 *( ( volatile unsigned int * ) ( 0x428426B8UL ) )
    #define bFM3_USB0_EP4C_EPEN                  *( ( volatile unsigned int * ) ( 0x428426BCUL ) )
    #define bFM3_USB0_EP5C_PKS50                 *( ( volatile unsigned int * ) ( 0x42842700UL ) )
    #define bFM3_USB0_EP5C_PKS51                 *( ( volatile unsigned int * ) ( 0x42842704UL ) )
    #define bFM3_USB0_EP5C_PKS52                 *( ( volatile unsigned int * ) ( 0x42842708UL ) )
    #define bFM3_USB0_EP5C_PKS53                 *( ( volatile unsigned int * ) ( 0x4284270CUL ) )
    #define bFM3_USB0_EP5C_PKS54                 *( ( volatile unsigned int * ) ( 0x42842710UL ) )
    #define bFM3_USB0_EP5C_PKS55                 *( ( volatile unsigned int * ) ( 0x42842714UL ) )
    #define bFM3_USB0_EP5C_PKS56                 *( ( volatile unsigned int * ) ( 0x42842718UL ) )
    #define bFM3_USB0_EP5C_STAL                  *( ( volatile unsigned int * ) ( 0x42842724UL ) )
    #define bFM3_USB0_EP5C_NULE                  *( ( volatile unsigned int * ) ( 0x42842728UL ) )
    #define bFM3_USB0_EP5C_DMAE                  *( ( volatile unsigned int * ) ( 0x4284272CUL ) )
    #define bFM3_USB0_EP5C_DIR                   *( ( volatile unsigned int * ) ( 0x42842730UL ) )
    #define bFM3_USB0_EP5C_TYPE0                 *( ( volatile unsigned int * ) ( 0x42842734UL ) )
    #define bFM3_USB0_EP5C_TYPE1                 *( ( volatile unsigned int * ) ( 0x42842738UL ) )
    #define bFM3_USB0_EP5C_EPEN                  *( ( volatile unsigned int * ) ( 0x4284273CUL ) )
    #define bFM3_USB0_TMSP_TMSP0                 *( ( volatile unsigned int * ) ( 0x42842780UL ) )
    #define bFM3_USB0_TMSP_TMSP1                 *( ( volatile unsigned int * ) ( 0x42842784UL ) )
    #define bFM3_USB0_TMSP_TMSP2                 *( ( volatile unsigned int * ) ( 0x42842788UL ) )
    #define bFM3_USB0_TMSP_TMSP3                 *( ( volatile unsigned int * ) ( 0x4284278CUL ) )
    #define bFM3_USB0_TMSP_TMSP4                 *( ( volatile unsigned int * ) ( 0x42842790UL ) )
    #define bFM3_USB0_TMSP_TMSP5                 *( ( volatile unsigned int * ) ( 0x42842794UL ) )
    #define bFM3_USB0_TMSP_TMSP6                 *( ( volatile unsigned int * ) ( 0x42842798UL ) )
    #define bFM3_USB0_TMSP_TMSP7                 *( ( volatile unsigned int * ) ( 0x4284279CUL ) )
    #define bFM3_USB0_TMSP_TMSP8                 *( ( volatile unsigned int * ) ( 0x428427A0UL ) )
    #define bFM3_USB0_TMSP_TMSP9                 *( ( volatile unsigned int * ) ( 0x428427A4UL ) )
    #define bFM3_USB0_TMSP_TMSP10                *( ( volatile unsigned int * ) ( 0x428427A8UL ) )
    #define bFM3_USB0_UDCS_CONF                  *( ( volatile unsigned int * ) ( 0x42842800UL ) )
    #define bFM3_USB0_UDCS_SETP                  *( ( volatile unsigned int * ) ( 0x42842804UL ) )
    #define bFM3_USB0_UDCS_WKUP                  *( ( volatile unsigned int * ) ( 0x42842808UL ) )
    #define bFM3_USB0_UDCS_BRST                  *( ( volatile unsigned int * ) ( 0x4284280CUL ) )
    #define bFM3_USB0_UDCS_SOF                   *( ( volatile unsigned int * ) ( 0x42842810UL ) )
    #define bFM3_USB0_UDCS_SUSP                  *( ( volatile unsigned int * ) ( 0x42842814UL ) )
    #define bFM3_USB0_UDCIE_CONFIE               *( ( volatile unsigned int * ) ( 0x42842820UL ) )
    #define bFM3_USB0_UDCIE_CONFN                *( ( volatile unsigned int * ) ( 0x42842824UL ) )
    #define bFM3_USB0_UDCIE_WKUPIE               *( ( volatile unsigned int * ) ( 0x42842828UL ) )
    #define bFM3_USB0_UDCIE_BRSTIE               *( ( volatile unsigned int * ) ( 0x4284282CUL ) )
    #define bFM3_USB0_UDCIE_SOFIE                *( ( volatile unsigned int * ) ( 0x42842830UL ) )
    #define bFM3_USB0_UDCIE_SUSPIE               *( ( volatile unsigned int * ) ( 0x42842834UL ) )
    #define bFM3_USB0_EP0IS_DRQI                 *( ( volatile unsigned int * ) ( 0x428428A8UL ) )
    #define bFM3_USB0_EP0IS_DRQIIE               *( ( volatile unsigned int * ) ( 0x428428B8UL ) )
    #define bFM3_USB0_EP0IS_BFINI                *( ( volatile unsigned int * ) ( 0x428428BCUL ) )
    #define bFM3_USB0_EP0OS_SIZE0                *( ( volatile unsigned int * ) ( 0x42842900UL ) )
    #define bFM3_USB0_EP0OS_SIZE1                *( ( volatile unsigned int * ) ( 0x42842904UL ) )
    #define bFM3_USB0_EP0OS_SIZE2                *( ( volatile unsigned int * ) ( 0x42842908UL ) )
    #define bFM3_USB0_EP0OS_SIZE3                *( ( volatile unsigned int * ) ( 0x4284290CUL ) )
    #define bFM3_USB0_EP0OS_SIZE4                *( ( volatile unsigned int * ) ( 0x42842910UL ) )
    #define bFM3_USB0_EP0OS_SIZE5                *( ( volatile unsigned int * ) ( 0x42842914UL ) )
    #define bFM3_USB0_EP0OS_SIZE6                *( ( volatile unsigned int * ) ( 0x42842918UL ) )
    #define bFM3_USB0_EP0OS_SPK                  *( ( volatile unsigned int * ) ( 0x42842924UL ) )
    #define bFM3_USB0_EP0OS_DRQO                 *( ( volatile unsigned int * ) ( 0x42842928UL ) )
    #define bFM3_USB0_EP0OS_SPKIE                *( ( volatile unsigned int * ) ( 0x42842934UL ) )
    #define bFM3_USB0_EP0OS_DRQOIE               *( ( volatile unsigned int * ) ( 0x42842938UL ) )
    #define bFM3_USB0_EP0OS_BFINI                *( ( volatile unsigned int * ) ( 0x4284293CUL ) )
    #define bFM3_USB0_EP1S_SIZE10                *( ( volatile unsigned int * ) ( 0x42842980UL ) )
    #define bFM3_USB0_EP1S_SIZE11                *( ( volatile unsigned int * ) ( 0x42842984UL ) )
    #define bFM3_USB0_EP1S_SIZE12                *( ( volatile unsigned int * ) ( 0x42842988UL ) )
    #define bFM3_USB0_EP1S_SIZE13                *( ( volatile unsigned int * ) ( 0x4284298CUL ) )
    #define bFM3_USB0_EP1S_SIZE14                *( ( volatile unsigned int * ) ( 0x42842990UL ) )
    #define bFM3_USB0_EP1S_SIZE15                *( ( volatile unsigned int * ) ( 0x42842994UL ) )
    #define bFM3_USB0_EP1S_SIZE16                *( ( volatile unsigned int * ) ( 0x42842998UL ) )
    #define bFM3_USB0_EP1S_SIZE17                *( ( volatile unsigned int * ) ( 0x4284299CUL ) )
    #define bFM3_USB0_EP1S_SPK                   *( ( volatile unsigned int * ) ( 0x428429A4UL ) )
    #define bFM3_USB0_EP1S_DRQ                   *( ( volatile unsigned int * ) ( 0x428429A8UL ) )
    #define bFM3_USB0_EP1S_BUSY                  *( ( volatile unsigned int * ) ( 0x428429ACUL ) )
    #define bFM3_USB0_EP1S_SPKIE                 *( ( volatile unsigned int * ) ( 0x428429B4UL ) )
    #define bFM3_USB0_EP1S_DRQIE                 *( ( volatile unsigned int * ) ( 0x428429B8UL ) )
    #define bFM3_USB0_EP1S_BFINI                 *( ( volatile unsigned int * ) ( 0x428429BCUL ) )
    #define bFM3_USB0_EP2S_SIZE20                *( ( volatile unsigned int * ) ( 0x42842A00UL ) )
    #define bFM3_USB0_EP2S_SIZE21                *( ( volatile unsigned int * ) ( 0x42842A04UL ) )
    #define bFM3_USB0_EP2S_SIZE22                *( ( volatile unsigned int * ) ( 0x42842A08UL ) )
    #define bFM3_USB0_EP2S_SIZE23                *( ( volatile unsigned int * ) ( 0x42842A0CUL ) )
    #define bFM3_USB0_EP2S_SIZE24                *( ( volatile unsigned int * ) ( 0x42842A10UL ) )
    #define bFM3_USB0_EP2S_SIZE25                *( ( volatile unsigned int * ) ( 0x42842A14UL ) )
    #define bFM3_USB0_EP2S_SIZE26                *( ( volatile unsigned int * ) ( 0x42842A18UL ) )
    #define bFM3_USB0_EP2S_SPK                   *( ( volatile unsigned int * ) ( 0x42842A24UL ) )
    #define bFM3_USB0_EP2S_DRQ                   *( ( volatile unsigned int * ) ( 0x42842A28UL ) )
    #define bFM3_USB0_EP2S_BUSY                  *( ( volatile unsigned int * ) ( 0x42842A2CUL ) )
    #define bFM3_USB0_EP2S_SPKIE                 *( ( volatile unsigned int * ) ( 0x42842A34UL ) )
    #define bFM3_USB0_EP2S_DRQIE                 *( ( volatile unsigned int * ) ( 0x42842A38UL ) )
    #define bFM3_USB0_EP2S_BFINI                 *( ( volatile unsigned int * ) ( 0x42842A3CUL ) )
    #define bFM3_USB0_EP3S_SIZE30                *( ( volatile unsigned int * ) ( 0x42842A80UL ) )
    #define bFM3_USB0_EP3S_SIZE31                *( ( volatile unsigned int * ) ( 0x42842A84UL ) )
    #define bFM3_USB0_EP3S_SIZE32                *( ( volatile unsigned int * ) ( 0x42842A88UL ) )
    #define bFM3_USB0_EP3S_SIZE33                *( ( volatile unsigned int * ) ( 0x42842A8CUL ) )
    #define bFM3_USB0_EP3S_SIZE34                *( ( volatile unsigned int * ) ( 0x42842A90UL ) )
    #define bFM3_USB0_EP3S_SIZE35                *( ( volatile unsigned int * ) ( 0x42842A94UL ) )
    #define bFM3_USB0_EP3S_SIZE36                *( ( volatile unsigned int * ) ( 0x42842A98UL ) )
    #define bFM3_USB0_EP3S_SPK                   *( ( volatile unsigned int * ) ( 0x42842AA4UL ) )
    #define bFM3_USB0_EP3S_DRQ                   *( ( volatile unsigned int * ) ( 0x42842AA8UL ) )
    #define bFM3_USB0_EP3S_BUSY                  *( ( volatile unsigned int * ) ( 0x42842AACUL ) )
    #define bFM3_USB0_EP3S_SPKIE                 *( ( volatile unsigned int * ) ( 0x42842AB4UL ) )
    #define bFM3_USB0_EP3S_DRQIE                 *( ( volatile unsigned int * ) ( 0x42842AB8UL ) )
    #define bFM3_USB0_EP3S_BFINI                 *( ( volatile unsigned int * ) ( 0x42842ABCUL ) )
    #define bFM3_USB0_EP4S_SIZE40                *( ( volatile unsigned int * ) ( 0x42842B00UL ) )
    #define bFM3_USB0_EP4S_SIZE41                *( ( volatile unsigned int * ) ( 0x42842B04UL ) )
    #define bFM3_USB0_EP4S_SIZE42                *( ( volatile unsigned int * ) ( 0x42842B08UL ) )
    #define bFM3_USB0_EP4S_SIZE43                *( ( volatile unsigned int * ) ( 0x42842B0CUL ) )
    #define bFM3_USB0_EP4S_SIZE44                *( ( volatile unsigned int * ) ( 0x42842B10UL ) )
    #define bFM3_USB0_EP4S_SIZE45                *( ( volatile unsigned int * ) ( 0x42842B14UL ) )
    #define bFM3_USB0_EP4S_SIZE46                *( ( volatile unsigned int * ) ( 0x42842B18UL ) )
    #define bFM3_USB0_EP4S_SPK                   *( ( volatile unsigned int * ) ( 0x42842B24UL ) )
    #define bFM3_USB0_EP4S_DRQ                   *( ( volatile unsigned int * ) ( 0x42842B28UL ) )
    #define bFM3_USB0_EP4S_BUSY                  *( ( volatile unsigned int * ) ( 0x42842B2CUL ) )
    #define bFM3_USB0_EP4S_SPKIE                 *( ( volatile unsigned int * ) ( 0x42842B34UL ) )
    #define bFM3_USB0_EP4S_DRQIE                 *( ( volatile unsigned int * ) ( 0x42842B38UL ) )
    #define bFM3_USB0_EP4S_BFINI                 *( ( volatile unsigned int * ) ( 0x42842B3CUL ) )
    #define bFM3_USB0_EP5S_SIZE50                *( ( volatile unsigned int * ) ( 0x42842B80UL ) )
    #define bFM3_USB0_EP5S_SIZE51                *( ( volatile unsigned int * ) ( 0x42842B84UL ) )
    #define bFM3_USB0_EP5S_SIZE52                *( ( volatile unsigned int * ) ( 0x42842B88UL ) )
    #define bFM3_USB0_EP5S_SIZE53                *( ( volatile unsigned int * ) ( 0x42842B8CUL ) )
    #define bFM3_USB0_EP5S_SIZE54                *( ( volatile unsigned int * ) ( 0x42842B90UL ) )
    #define bFM3_USB0_EP5S_SIZE55                *( ( volatile unsigned int * ) ( 0x42842B94UL ) )
    #define bFM3_USB0_EP5S_SIZE56                *( ( volatile unsigned int * ) ( 0x42842B98UL ) )
    #define bFM3_USB0_EP5S_SPK                   *( ( volatile unsigned int * ) ( 0x42842BA4UL ) )
    #define bFM3_USB0_EP5S_DRQ                   *( ( volatile unsigned int * ) ( 0x42842BA8UL ) )
    #define bFM3_USB0_EP5S_BUSY                  *( ( volatile unsigned int * ) ( 0x42842BACUL ) )
    #define bFM3_USB0_EP5S_SPKIE                 *( ( volatile unsigned int * ) ( 0x42842BB4UL ) )
    #define bFM3_USB0_EP5S_DRQIE                 *( ( volatile unsigned int * ) ( 0x42842BB8UL ) )
    #define bFM3_USB0_EP5S_BFINI                 *( ( volatile unsigned int * ) ( 0x42842BBCUL ) )

