FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* DMA controller */
    #define bFM3_DMAC_DMACR_DH0                  *( ( volatile unsigned int * ) ( 0x42C00060UL ) )
    #define bFM3_DMAC_DMACR_DH1                  *( ( volatile unsigned int * ) ( 0x42C00064UL ) )
    #define bFM3_DMAC_DMACR_DH2                  *( ( volatile unsigned int * ) ( 0x42C00068UL ) )
    #define bFM3_DMAC_DMACR_DH3                  *( ( volatile unsigned int * ) ( 0x42C0006CUL ) )
    #define bFM3_DMAC_DMACR_PR                   *( ( volatile unsigned int * ) ( 0x42C00070UL ) )
    #define bFM3_DMAC_DMACR_DS                   *( ( volatile unsigned int * ) ( 0x42C00078UL ) )
    #define bFM3_DMAC_DMACR_DE                   *( ( volatile unsigned int * ) ( 0x42C0007CUL ) )
    #define bFM3_DMAC_DMACA0_TC0                 *( ( volatile unsigned int * ) ( 0x42C00200UL ) )
    #define bFM3_DMAC_DMACA0_TC1                 *( ( volatile unsigned int * ) ( 0x42C00204UL ) )
    #define bFM3_DMAC_DMACA0_TC2                 *( ( volatile unsigned int * ) ( 0x42C00208UL ) )
    #define bFM3_DMAC_DMACA0_TC3                 *( ( volatile unsigned int * ) ( 0x42C0020CUL ) )
    #define bFM3_DMAC_DMACA0_TC4                 *( ( volatile unsigned int * ) ( 0x42C00210UL ) )
    #define bFM3_DMAC_DMACA0_TC5                 *( ( volatile unsigned int * ) ( 0x42C00214UL ) )
    #define bFM3_DMAC_DMACA0_TC6                 *( ( volatile unsigned int * ) ( 0x42C00218UL ) )
    #define bFM3_DMAC_DMACA0_TC7                 *( ( volatile unsigned int * ) ( 0x42C0021CUL ) )
    #define bFM3_DMAC_DMACA0_TC8                 *( ( volatile unsigned int * ) ( 0x42C00220UL ) )
    #define bFM3_DMAC_DMACA0_TC9                 *( ( volatile unsigned int * ) ( 0x42C00224UL ) )
    #define bFM3_DMAC_DMACA0_TC10                *( ( volatile unsigned int * ) ( 0x42C00228UL ) )
    #define bFM3_DMAC_DMACA0_TC11                *( ( volatile unsigned int * ) ( 0x42C0022CUL ) )
    #define bFM3_DMAC_DMACA0_TC12                *( ( volatile unsigned int * ) ( 0x42C00230UL ) )
    #define bFM3_DMAC_DMACA0_TC13                *( ( volatile unsigned int * ) ( 0x42C00234UL ) )
    #define bFM3_DMAC_DMACA0_TC14                *( ( volatile unsigned int * ) ( 0x42C00238UL ) )
    #define bFM3_DMAC_DMACA0_TC15                *( ( volatile unsigned int * ) ( 0x42C0023CUL ) )
    #define bFM3_DMAC_DMACA0_BC0                 *( ( volatile unsigned int * ) ( 0x42C00240UL ) )
    #define bFM3_DMAC_DMACA0_BC1                 *( ( volatile unsigned int * ) ( 0x42C00244UL ) )
    #define bFM3_DMAC_DMACA0_BC2                 *( ( volatile unsigned int * ) ( 0x42C00248UL ) )
    #define bFM3_DMAC_DMACA0_BC3                 *( ( volatile unsigned int * ) ( 0x42C0024CUL ) )
    #define bFM3_DMAC_DMACA0_IS0                 *( ( volatile unsigned int * ) ( 0x42C0025CUL ) )
    #define bFM3_DMAC_DMACA0_IS1                 *( ( volatile unsigned int * ) ( 0x42C00260UL ) )
    #define bFM3_DMAC_DMACA0_IS2                 *( ( volatile unsigned int * ) ( 0x42C00264UL ) )
    #define bFM3_DMAC_DMACA0_IS3                 *( ( volatile unsigned int * ) ( 0x42C00268UL ) )
    #define bFM3_DMAC_DMACA0_IS4                 *( ( volatile unsigned int * ) ( 0x42C0026CUL ) )
    #define bFM3_DMAC_DMACA0_IS5                 *( ( volatile unsigned int * ) ( 0x42C00270UL ) )
    #define bFM3_DMAC_DMACA0_ST                  *( ( volatile unsigned int * ) ( 0x42C00274UL ) )
    #define bFM3_DMAC_DMACA0_PB                  *( ( volatile unsigned int * ) ( 0x42C00278UL ) )
    #define bFM3_DMAC_DMACA0_EB                  *( ( volatile unsigned int * ) ( 0x42C0027CUL ) )
    #define bFM3_DMAC_DMACB0_EM                  *( ( volatile unsigned int * ) ( 0x42C00280UL ) )
    #define bFM3_DMAC_DMACB0_SS0                 *( ( volatile unsigned int * ) ( 0x42C002C0UL ) )
    #define bFM3_DMAC_DMACB0_SS1                 *( ( volatile unsigned int * ) ( 0x42C002C4UL ) )
    #define bFM3_DMAC_DMACB0_SS2                 *( ( volatile unsigned int * ) ( 0x42C002C8UL ) )
    #define bFM3_DMAC_DMACB0_CI                  *( ( volatile unsigned int * ) ( 0x42C002CCUL ) )
    #define bFM3_DMAC_DMACB0_EI                  *( ( volatile unsigned int * ) ( 0x42C002D0UL ) )
    #define bFM3_DMAC_DMACB0_RD                  *( ( volatile unsigned int * ) ( 0x42C002D4UL ) )
    #define bFM3_DMAC_DMACB0_RS                  *( ( volatile unsigned int * ) ( 0x42C002D8UL ) )
    #define bFM3_DMAC_DMACB0_RC                  *( ( volatile unsigned int * ) ( 0x42C002DCUL ) )
    #define bFM3_DMAC_DMACB0_FD                  *( ( volatile unsigned int * ) ( 0x42C002E0UL ) )
    #define bFM3_DMAC_DMACB0_FS                  *( ( volatile unsigned int * ) ( 0x42C002E4UL ) )
    #define bFM3_DMAC_DMACB0_TW0                 *( ( volatile unsigned int * ) ( 0x42C002E8UL ) )
    #define bFM3_DMAC_DMACB0_TW1                 *( ( volatile unsigned int * ) ( 0x42C002ECUL ) )
    #define bFM3_DMAC_DMACB0_MS0                 *( ( volatile unsigned int * ) ( 0x42C002F0UL ) )
    #define bFM3_DMAC_DMACB0_MS1                 *( ( volatile unsigned int * ) ( 0x42C002F4UL ) )
    #define bFM3_DMAC_DMACA1_TC0                 *( ( volatile unsigned int * ) ( 0x42C00400UL ) )
    #define bFM3_DMAC_DMACA1_TC1                 *( ( volatile unsigned int * ) ( 0x42C00404UL ) )
    #define bFM3_DMAC_DMACA1_TC2                 *( ( volatile unsigned int * ) ( 0x42C00408UL ) )
    #define bFM3_DMAC_DMACA1_TC3                 *( ( volatile unsigned int * ) ( 0x42C0040CUL ) )
    #define bFM3_DMAC_DMACA1_TC4                 *( ( volatile unsigned int * ) ( 0x42C00410UL ) )
    #define bFM3_DMAC_DMACA1_TC5                 *( ( volatile unsigned int * ) ( 0x42C00414UL ) )
    #define bFM3_DMAC_DMACA1_TC6                 *( ( volatile unsigned int * ) ( 0x42C00418UL ) )
    #define bFM3_DMAC_DMACA1_TC7                 *( ( volatile unsigned int * ) ( 0x42C0041CUL ) )
    #define bFM3_DMAC_DMACA1_TC8                 *( ( volatile unsigned int * ) ( 0x42C00420UL ) )
    #define bFM3_DMAC_DMACA1_TC9                 *( ( volatile unsigned int * ) ( 0x42C00424UL ) )
    #define bFM3_DMAC_DMACA1_TC10                *( ( volatile unsigned int * ) ( 0x42C00428UL ) )
    #define bFM3_DMAC_DMACA1_TC11                *( ( volatile unsigned int * ) ( 0x42C0042CUL ) )
    #define bFM3_DMAC_DMACA1_TC12                *( ( volatile unsigned int * ) ( 0x42C00430UL ) )
    #define bFM3_DMAC_DMACA1_TC13                *( ( volatile unsigned int * ) ( 0x42C00434UL ) )
    #define bFM3_DMAC_DMACA1_TC14                *( ( volatile unsigned int * ) ( 0x42C00438UL ) )
    #define bFM3_DMAC_DMACA1_TC15                *( ( volatile unsigned int * ) ( 0x42C0043CUL ) )
    #define bFM3_DMAC_DMACA1_BC0                 *( ( volatile unsigned int * ) ( 0x42C00440UL ) )
    #define bFM3_DMAC_DMACA1_BC1                 *( ( volatile unsigned int * ) ( 0x42C00444UL ) )
    #define bFM3_DMAC_DMACA1_BC2                 *( ( volatile unsigned int * ) ( 0x42C00448UL ) )
    #define bFM3_DMAC_DMACA1_BC3                 *( ( volatile unsigned int * ) ( 0x42C0044CUL ) )
    #define bFM3_DMAC_DMACA1_IS0                 *( ( volatile unsigned int * ) ( 0x42C0045CUL ) )
    #define bFM3_DMAC_DMACA1_IS1                 *( ( volatile unsigned int * ) ( 0x42C00460UL ) )
    #define bFM3_DMAC_DMACA1_IS2                 *( ( volatile unsigned int * ) ( 0x42C00464UL ) )
    #define bFM3_DMAC_DMACA1_IS3                 *( ( volatile unsigned int * ) ( 0x42C00468UL ) )
    #define bFM3_DMAC_DMACA1_IS4                 *( ( volatile unsigned int * ) ( 0x42C0046CUL ) )
    #define bFM3_DMAC_DMACA1_IS5                 *( ( volatile unsigned int * ) ( 0x42C00470UL ) )
    #define bFM3_DMAC_DMACA1_ST                  *( ( volatile unsigned int * ) ( 0x42C00474UL ) )
    #define bFM3_DMAC_DMACA1_PB                  *( ( volatile unsigned int * ) ( 0x42C00478UL ) )
    #define bFM3_DMAC_DMACA1_EB                  *( ( volatile unsigned int * ) ( 0x42C0047CUL ) )
    #define bFM3_DMAC_DMACB1_EM                  *( ( volatile unsigned int * ) ( 0x42C00480UL ) )
    #define bFM3_DMAC_DMACB1_SS0                 *( ( volatile unsigned int * ) ( 0x42C004C0UL ) )
    #define bFM3_DMAC_DMACB1_SS1                 *( ( volatile unsigned int * ) ( 0x42C004C4UL ) )
    #define bFM3_DMAC_DMACB1_SS2                 *( ( volatile unsigned int * ) ( 0x42C004C8UL ) )
    #define bFM3_DMAC_DMACB1_CI                  *( ( volatile unsigned int * ) ( 0x42C004CCUL ) )
    #define bFM3_DMAC_DMACB1_EI                  *( ( volatile unsigned int * ) ( 0x42C004D0UL ) )
    #define bFM3_DMAC_DMACB1_RD                  *( ( volatile unsigned int * ) ( 0x42C004D4UL ) )
    #define bFM3_DMAC_DMACB1_RS                  *( ( volatile unsigned int * ) ( 0x42C004D8UL ) )
    #define bFM3_DMAC_DMACB1_RC                  *( ( volatile unsigned int * ) ( 0x42C004DCUL ) )
    #define bFM3_DMAC_DMACB1_FD                  *( ( volatile unsigned int * ) ( 0x42C004E0UL ) )
    #define bFM3_DMAC_DMACB1_FS                  *( ( volatile unsigned int * ) ( 0x42C004E4UL ) )
    #define bFM3_DMAC_DMACB1_TW0                 *( ( volatile unsigned int * ) ( 0x42C004E8UL ) )
    #define bFM3_DMAC_DMACB1_TW1                 *( ( volatile unsigned int * ) ( 0x42C004ECUL ) )
    #define bFM3_DMAC_DMACB1_MS0                 *( ( volatile unsigned int * ) ( 0x42C004F0UL ) )
    #define bFM3_DMAC_DMACB1_MS1                 *( ( volatile unsigned int * ) ( 0x42C004F4UL ) )
    #define bFM3_DMAC_DMACA2_TC0                 *( ( volatile unsigned int * ) ( 0x42C00600UL ) )
    #define bFM3_DMAC_DMACA2_TC1                 *( ( volatile unsigned int * ) ( 0x42C00604UL ) )
    #define bFM3_DMAC_DMACA2_TC2                 *( ( volatile unsigned int * ) ( 0x42C00608UL ) )
    #define bFM3_DMAC_DMACA2_TC3                 *( ( volatile unsigned int * ) ( 0x42C0060CUL ) )
    #define bFM3_DMAC_DMACA2_TC4                 *( ( volatile unsigned int * ) ( 0x42C00610UL ) )
    #define bFM3_DMAC_DMACA2_TC5                 *( ( volatile unsigned int * ) ( 0x42C00614UL ) )
    #define bFM3_DMAC_DMACA2_TC6                 *( ( volatile unsigned int * ) ( 0x42C00618UL ) )
    #define bFM3_DMAC_DMACA2_TC7                 *( ( volatile unsigned int * ) ( 0x42C0061CUL ) )
    #define bFM3_DMAC_DMACA2_TC8                 *( ( volatile unsigned int * ) ( 0x42C00620UL ) )
    #define bFM3_DMAC_DMACA2_TC9                 *( ( volatile unsigned int * ) ( 0x42C00624UL ) )
    #define bFM3_DMAC_DMACA2_TC10                *( ( volatile unsigned int * ) ( 0x42C00628UL ) )
    #define bFM3_DMAC_DMACA2_TC11                *( ( volatile unsigned int * ) ( 0x42C0062CUL ) )
    #define bFM3_DMAC_DMACA2_TC12                *( ( volatile unsigned int * ) ( 0x42C00630UL ) )
    #define bFM3_DMAC_DMACA2_TC13                *( ( volatile unsigned int * ) ( 0x42C00634UL ) )
    #define bFM3_DMAC_DMACA2_TC14                *( ( volatile unsigned int * ) ( 0x42C00638UL ) )
    #define bFM3_DMAC_DMACA2_TC15                *( ( volatile unsigned int * ) ( 0x42C0063CUL ) )
    #define bFM3_DMAC_DMACA2_BC0                 *( ( volatile unsigned int * ) ( 0x42C00640UL ) )
    #define bFM3_DMAC_DMACA2_BC1                 *( ( volatile unsigned int * ) ( 0x42C00644UL ) )
    #define bFM3_DMAC_DMACA2_BC2                 *( ( volatile unsigned int * ) ( 0x42C00648UL ) )
    #define bFM3_DMAC_DMACA2_BC3                 *( ( volatile unsigned int * ) ( 0x42C0064CUL ) )
    #define bFM3_DMAC_DMACA2_IS0                 *( ( volatile unsigned int * ) ( 0x42C0065CUL ) )
    #define bFM3_DMAC_DMACA2_IS1                 *( ( volatile unsigned int * ) ( 0x42C00660UL ) )
    #define bFM3_DMAC_DMACA2_IS2                 *( ( volatile unsigned int * ) ( 0x42C00664UL ) )
    #define bFM3_DMAC_DMACA2_IS3                 *( ( volatile unsigned int * ) ( 0x42C00668UL ) )
    #define bFM3_DMAC_DMACA2_IS4                 *( ( volatile unsigned int * ) ( 0x42C0066CUL ) )
    #define bFM3_DMAC_DMACA2_IS5                 *( ( volatile unsigned int * ) ( 0x42C00670UL ) )
    #define bFM3_DMAC_DMACA2_ST                  *( ( volatile unsigned int * ) ( 0x42C00674UL ) )
    #define bFM3_DMAC_DMACA2_PB                  *( ( volatile unsigned int * ) ( 0x42C00678UL ) )
    #define bFM3_DMAC_DMACA2_EB                  *( ( volatile unsigned int * ) ( 0x42C0067CUL ) )
    #define bFM3_DMAC_DMACB2_EM                  *( ( volatile unsigned int * ) ( 0x42C00680UL ) )
    #define bFM3_DMAC_DMACB2_SS0                 *( ( volatile unsigned int * ) ( 0x42C006C0UL ) )
    #define bFM3_DMAC_DMACB2_SS1                 *( ( volatile unsigned int * ) ( 0x42C006C4UL ) )
    #define bFM3_DMAC_DMACB2_SS2                 *( ( volatile unsigned int * ) ( 0x42C006C8UL ) )
    #define bFM3_DMAC_DMACB2_CI                  *( ( volatile unsigned int * ) ( 0x42C006CCUL ) )
    #define bFM3_DMAC_DMACB2_EI                  *( ( volatile unsigned int * ) ( 0x42C006D0UL ) )
    #define bFM3_DMAC_DMACB2_RD                  *( ( volatile unsigned int * ) ( 0x42C006D4UL ) )
    #define bFM3_DMAC_DMACB2_RS                  *( ( volatile unsigned int * ) ( 0x42C006D8UL ) )
    #define bFM3_DMAC_DMACB2_RC                  *( ( volatile unsigned int * ) ( 0x42C006DCUL ) )
    #define bFM3_DMAC_DMACB2_FD                  *( ( volatile unsigned int * ) ( 0x42C006E0UL ) )
    #define bFM3_DMAC_DMACB2_FS                  *( ( volatile unsigned int * ) ( 0x42C006E4UL ) )
    #define bFM3_DMAC_DMACB2_TW0                 *( ( volatile unsigned int * ) ( 0x42C006E8UL ) )
    #define bFM3_DMAC_DMACB2_TW1                 *( ( volatile unsigned int * ) ( 0x42C006ECUL ) )
    #define bFM3_DMAC_DMACB2_MS0                 *( ( volatile unsigned int * ) ( 0x42C006F0UL ) )
    #define bFM3_DMAC_DMACB2_MS1                 *( ( volatile unsigned int * ) ( 0x42C006F4UL ) )
    #define bFM3_DMAC_DMACA3_TC0                 *( ( volatile unsigned int * ) ( 0x42C00800UL ) )
    #define bFM3_DMAC_DMACA3_TC1                 *( ( volatile unsigned int * ) ( 0x42C00804UL ) )
    #define bFM3_DMAC_DMACA3_TC2                 *( ( volatile unsigned int * ) ( 0x42C00808UL ) )
    #define bFM3_DMAC_DMACA3_TC3                 *( ( volatile unsigned int * ) ( 0x42C0080CUL ) )
    #define bFM3_DMAC_DMACA3_TC4                 *( ( volatile unsigned int * ) ( 0x42C00810UL ) )
    #define bFM3_DMAC_DMACA3_TC5                 *( ( volatile unsigned int * ) ( 0x42C00814UL ) )
    #define bFM3_DMAC_DMACA3_TC6                 *( ( volatile unsigned int * ) ( 0x42C00818UL ) )
    #define bFM3_DMAC_DMACA3_TC7                 *( ( volatile unsigned int * ) ( 0x42C0081CUL ) )
    #define bFM3_DMAC_DMACA3_TC8                 *( ( volatile unsigned int * ) ( 0x42C00820UL ) )
    #define bFM3_DMAC_DMACA3_TC9                 *( ( volatile unsigned int * ) ( 0x42C00824UL ) )
    #define bFM3_DMAC_DMACA3_TC10                *( ( volatile unsigned int * ) ( 0x42C00828UL ) )
    #define bFM3_DMAC_DMACA3_TC11                *( ( volatile unsigned int * ) ( 0x42C0082CUL ) )
    #define bFM3_DMAC_DMACA3_TC12                *( ( volatile unsigned int * ) ( 0x42C00830UL ) )
    #define bFM3_DMAC_DMACA3_TC13                *( ( volatile unsigned int * ) ( 0x42C00834UL ) )
    #define bFM3_DMAC_DMACA3_TC14                *( ( volatile unsigned int * ) ( 0x42C00838UL ) )
    #define bFM3_DMAC_DMACA3_TC15                *( ( volatile unsigned int * ) ( 0x42C0083CUL ) )
    #define bFM3_DMAC_DMACA3_BC0                 *( ( volatile unsigned int * ) ( 0x42C00840UL ) )
    #define bFM3_DMAC_DMACA3_BC1                 *( ( volatile unsigned int * ) ( 0x42C00844UL ) )
    #define bFM3_DMAC_DMACA3_BC2                 *( ( volatile unsigned int * ) ( 0x42C00848UL ) )
    #define bFM3_DMAC_DMACA3_BC3                 *( ( volatile unsigned int * ) ( 0x42C0084CUL ) )
    #define bFM3_DMAC_DMACA3_IS0                 *( ( volatile unsigned int * ) ( 0x42C0085CUL ) )
    #define bFM3_DMAC_DMACA3_IS1                 *( ( volatile unsigned int * ) ( 0x42C00860UL ) )
    #define bFM3_DMAC_DMACA3_IS2                 *( ( volatile unsigned int * ) ( 0x42C00864UL ) )
    #define bFM3_DMAC_DMACA3_IS3                 *( ( volatile unsigned int * ) ( 0x42C00868UL ) )
    #define bFM3_DMAC_DMACA3_IS4                 *( ( volatile unsigned int * ) ( 0x42C0086CUL ) )
    #define bFM3_DMAC_DMACA3_IS5                 *( ( volatile unsigned int * ) ( 0x42C00870UL ) )
    #define bFM3_DMAC_DMACA3_ST                  *( ( volatile unsigned int * ) ( 0x42C00874UL ) )
    #define bFM3_DMAC_DMACA3_PB                  *( ( volatile unsigned int * ) ( 0x42C00878UL ) )
    #define bFM3_DMAC_DMACA3_EB                  *( ( volatile unsigned int * ) ( 0x42C0087CUL ) )
    #define bFM3_DMAC_DMACB3_EM                  *( ( volatile unsigned int * ) ( 0x42C00880UL ) )
    #define bFM3_DMAC_DMACB3_SS0                 *( ( volatile unsigned int * ) ( 0x42C008C0UL ) )
    #define bFM3_DMAC_DMACB3_SS1                 *( ( volatile unsigned int * ) ( 0x42C008C4UL ) )
    #define bFM3_DMAC_DMACB3_SS2                 *( ( volatile unsigned int * ) ( 0x42C008C8UL ) )
    #define bFM3_DMAC_DMACB3_CI                  *( ( volatile unsigned int * ) ( 0x42C008CCUL ) )
    #define bFM3_DMAC_DMACB3_EI                  *( ( volatile unsigned int * ) ( 0x42C008D0UL ) )
    #define bFM3_DMAC_DMACB3_RD                  *( ( volatile unsigned int * ) ( 0x42C008D4UL ) )
    #define bFM3_DMAC_DMACB3_RS                  *( ( volatile unsigned int * ) ( 0x42C008D8UL ) )
    #define bFM3_DMAC_DMACB3_RC                  *( ( volatile unsigned int * ) ( 0x42C008DCUL ) )
    #define bFM3_DMAC_DMACB3_FD                  *( ( volatile unsigned int * ) ( 0x42C008E0UL ) )
    #define bFM3_DMAC_DMACB3_FS                  *( ( volatile unsigned int * ) ( 0x42C008E4UL ) )
    #define bFM3_DMAC_DMACB3_TW0                 *( ( volatile unsigned int * ) ( 0x42C008E8UL ) )
    #define bFM3_DMAC_DMACB3_TW1                 *( ( volatile unsigned int * ) ( 0x42C008ECUL ) )
    #define bFM3_DMAC_DMACB3_MS0                 *( ( volatile unsigned int * ) ( 0x42C008F0UL ) )
    #define bFM3_DMAC_DMACB3_MS1                 *( ( volatile unsigned int * ) ( 0x42C008F4UL ) )
    #define bFM3_DMAC_DMACA4_TC0                 *( ( volatile unsigned int * ) ( 0x42C00A00UL ) )
    #define bFM3_DMAC_DMACA4_TC1                 *( ( volatile unsigned int * ) ( 0x42C00A04UL ) )
    #define bFM3_DMAC_DMACA4_TC2                 *( ( volatile unsigned int * ) ( 0x42C00A08UL ) )
    #define bFM3_DMAC_DMACA4_TC3                 *( ( volatile unsigned int * ) ( 0x42C00A0CUL ) )
    #define bFM3_DMAC_DMACA4_TC4                 *( ( volatile unsigned int * ) ( 0x42C00A10UL ) )
    #define bFM3_DMAC_DMACA4_TC5                 *( ( volatile unsigned int * ) ( 0x42C00A14UL ) )
    #define bFM3_DMAC_DMACA4_TC6                 *( ( volatile unsigned int * ) ( 0x42C00A18UL ) )
    #define bFM3_DMAC_DMACA4_TC7                 *( ( volatile unsigned int * ) ( 0x42C00A1CUL ) )
    #define bFM3_DMAC_DMACA4_TC8                 *( ( volatile unsigned int * ) ( 0x42C00A20UL ) )
    #define bFM3_DMAC_DMACA4_TC9                 *( ( volatile unsigned int * ) ( 0x42C00A24UL ) )
    #define bFM3_DMAC_DMACA4_TC10                *( ( volatile unsigned int * ) ( 0x42C00A28UL ) )
    #define bFM3_DMAC_DMACA4_TC11                *( ( volatile unsigned int * ) ( 0x42C00A2CUL ) )
    #define bFM3_DMAC_DMACA4_TC12                *( ( volatile unsigned int * ) ( 0x42C00A30UL ) )
    #define bFM3_DMAC_DMACA4_TC13                *( ( volatile unsigned int * ) ( 0x42C00A34UL ) )
    #define bFM3_DMAC_DMACA4_TC14                *( ( volatile unsigned int * ) ( 0x42C00A38UL ) )
    #define bFM3_DMAC_DMACA4_TC15                *( ( volatile unsigned int * ) ( 0x42C00A3CUL ) )
    #define bFM3_DMAC_DMACA4_BC0                 *( ( volatile unsigned int * ) ( 0x42C00A40UL ) )
    #define bFM3_DMAC_DMACA4_BC1                 *( ( volatile unsigned int * ) ( 0x42C00A44UL ) )
    #define bFM3_DMAC_DMACA4_BC2                 *( ( volatile unsigned int * ) ( 0x42C00A48UL ) )
    #define bFM3_DMAC_DMACA4_BC3                 *( ( volatile unsigned int * ) ( 0x42C00A4CUL ) )
    #define bFM3_DMAC_DMACA4_IS0                 *( ( volatile unsigned int * ) ( 0x42C00A5CUL ) )
    #define bFM3_DMAC_DMACA4_IS1                 *( ( volatile unsigned int * ) ( 0x42C00A60UL ) )
    #define bFM3_DMAC_DMACA4_IS2                 *( ( volatile unsigned int * ) ( 0x42C00A64UL ) )
    #define bFM3_DMAC_DMACA4_IS3                 *( ( volatile unsigned int * ) ( 0x42C00A68UL ) )
    #define bFM3_DMAC_DMACA4_IS4                 *( ( volatile unsigned int * ) ( 0x42C00A6CUL ) )
    #define bFM3_DMAC_DMACA4_IS5                 *( ( volatile unsigned int * ) ( 0x42C00A70UL ) )
    #define bFM3_DMAC_DMACA4_ST                  *( ( volatile unsigned int * ) ( 0x42C00A74UL ) )
    #define bFM3_DMAC_DMACA4_PB                  *( ( volatile unsigned int * ) ( 0x42C00A78UL ) )
    #define bFM3_DMAC_DMACA4_EB                  *( ( volatile unsigned int * ) ( 0x42C00A7CUL ) )
    #define bFM3_DMAC_DMACB4_EM                  *( ( volatile unsigned int * ) ( 0x42C00A80UL ) )
    #define bFM3_DMAC_DMACB4_SS0                 *( ( volatile unsigned int * ) ( 0x42C00AC0UL ) )
    #define bFM3_DMAC_DMACB4_SS1                 *( ( volatile unsigned int * ) ( 0x42C00AC4UL ) )
    #define bFM3_DMAC_DMACB4_SS2                 *( ( volatile unsigned int * ) ( 0x42C00AC8UL ) )
    #define bFM3_DMAC_DMACB4_CI                  *( ( volatile unsigned int * ) ( 0x42C00ACCUL ) )
    #define bFM3_DMAC_DMACB4_EI                  *( ( volatile unsigned int * ) ( 0x42C00AD0UL ) )
    #define bFM3_DMAC_DMACB4_RD                  *( ( volatile unsigned int * ) ( 0x42C00AD4UL ) )
    #define bFM3_DMAC_DMACB4_RS                  *( ( volatile unsigned int * ) ( 0x42C00AD8UL ) )
    #define bFM3_DMAC_DMACB4_RC                  *( ( volatile unsigned int * ) ( 0x42C00ADCUL ) )
    #define bFM3_DMAC_DMACB4_FD                  *( ( volatile unsigned int * ) ( 0x42C00AE0UL ) )
    #define bFM3_DMAC_DMACB4_FS                  *( ( volatile unsigned int * ) ( 0x42C00AE4UL ) )
    #define bFM3_DMAC_DMACB4_TW0                 *( ( volatile unsigned int * ) ( 0x42C00AE8UL ) )
    #define bFM3_DMAC_DMACB4_TW1                 *( ( volatile unsigned int * ) ( 0x42C00AECUL ) )
    #define bFM3_DMAC_DMACB4_MS0                 *( ( volatile unsigned int * ) ( 0x42C00AF0UL ) )
    #define bFM3_DMAC_DMACB4_MS1                 *( ( volatile unsigned int * ) ( 0x42C00AF4UL ) )
    #define bFM3_DMAC_DMACA5_TC0                 *( ( volatile unsigned int * ) ( 0x42C00C00UL ) )
    #define bFM3_DMAC_DMACA5_TC1                 *( ( volatile unsigned int * ) ( 0x42C00C04UL ) )
    #define bFM3_DMAC_DMACA5_TC2                 *( ( volatile unsigned int * ) ( 0x42C00C08UL ) )
    #define bFM3_DMAC_DMACA5_TC3                 *( ( volatile unsigned int * ) ( 0x42C00C0CUL ) )
    #define bFM3_DMAC_DMACA5_TC4                 *( ( volatile unsigned int * ) ( 0x42C00C10UL ) )
    #define bFM3_DMAC_DMACA5_TC5                 *( ( volatile unsigned int * ) ( 0x42C00C14UL ) )
    #define bFM3_DMAC_DMACA5_TC6                 *( ( volatile unsigned int * ) ( 0x42C00C18UL ) )
    #define bFM3_DMAC_DMACA5_TC7                 *( ( volatile unsigned int * ) ( 0x42C00C1CUL ) )
    #define bFM3_DMAC_DMACA5_TC8                 *( ( volatile unsigned int * ) ( 0x42C00C20UL ) )
    #define bFM3_DMAC_DMACA5_TC9                 *( ( volatile unsigned int * ) ( 0x42C00C24UL ) )
    #define bFM3_DMAC_DMACA5_TC10                *( ( volatile unsigned int * ) ( 0x42C00C28UL ) )
    #define bFM3_DMAC_DMACA5_TC11                *( ( volatile unsigned int * ) ( 0x42C00C2CUL ) )
    #define bFM3_DMAC_DMACA5_TC12                *( ( volatile unsigned int * ) ( 0x42C00C30UL ) )
    #define bFM3_DMAC_DMACA5_TC13                *( ( volatile unsigned int * ) ( 0x42C00C34UL ) )
    #define bFM3_DMAC_DMACA5_TC14                *( ( volatile unsigned int * ) ( 0x42C00C38UL ) )
