FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* CAN channel 0 registers */
    #define bFM3_CAN0_CTRLR_INIT                 *( ( volatile unsigned int * ) ( 0x42C40000UL ) )
    #define bFM3_CAN0_CTRLR_IE                   *( ( volatile unsigned int * ) ( 0x42C40004UL ) )
    #define bFM3_CAN0_CTRLR_SIE                  *( ( volatile unsigned int * ) ( 0x42C40008UL ) )
    #define bFM3_CAN0_CTRLR_EIE                  *( ( volatile unsigned int * ) ( 0x42C4000CUL ) )
    #define bFM3_CAN0_CTRLR_DAR                  *( ( volatile unsigned int * ) ( 0x42C40014UL ) )
    #define bFM3_CAN0_CTRLR_CCE                  *( ( volatile unsigned int * ) ( 0x42C40018UL ) )
    #define bFM3_CAN0_CTRLR_TEST                 *( ( volatile unsigned int * ) ( 0x42C4001CUL ) )
    #define bFM3_CAN0_STATR_LEC0                 *( ( volatile unsigned int * ) ( 0x42C40040UL ) )
    #define bFM3_CAN0_STATR_LEC1                 *( ( volatile unsigned int * ) ( 0x42C40044UL ) )
    #define bFM3_CAN0_STATR_LEC2                 *( ( volatile unsigned int * ) ( 0x42C40048UL ) )
    #define bFM3_CAN0_STATR_TXOK                 *( ( volatile unsigned int * ) ( 0x42C4004CUL ) )
    #define bFM3_CAN0_STATR_RXOK                 *( ( volatile unsigned int * ) ( 0x42C40050UL ) )
    #define bFM3_CAN0_STATR_EPASS                *( ( volatile unsigned int * ) ( 0x42C40054UL ) )
    #define bFM3_CAN0_STATR_EWARM                *( ( volatile unsigned int * ) ( 0x42C40058UL ) )
    #define bFM3_CAN0_STATR_BOFF                 *( ( volatile unsigned int * ) ( 0x42C4005CUL ) )
    #define bFM3_CAN0_ERRCNT_TEC0                *( ( volatile unsigned int * ) ( 0x42C40080UL ) )
    #define bFM3_CAN0_ERRCNT_TEC1                *( ( volatile unsigned int * ) ( 0x42C40084UL ) )
    #define bFM3_CAN0_ERRCNT_TEC2                *( ( volatile unsigned int * ) ( 0x42C40088UL ) )
    #define bFM3_CAN0_ERRCNT_TEC3                *( ( volatile unsigned int * ) ( 0x42C4008CUL ) )
    #define bFM3_CAN0_ERRCNT_TEC4                *( ( volatile unsigned int * ) ( 0x42C40090UL ) )
    #define bFM3_CAN0_ERRCNT_TEC5                *( ( volatile unsigned int * ) ( 0x42C40094UL ) )
    #define bFM3_CAN0_ERRCNT_TEC6                *( ( volatile unsigned int * ) ( 0x42C40098UL ) )
    #define bFM3_CAN0_ERRCNT_TEC7                *( ( volatile unsigned int * ) ( 0x42C4009CUL ) )
    #define bFM3_CAN0_ERRCNT_REC0                *( ( volatile unsigned int * ) ( 0x42C400A0UL ) )
    #define bFM3_CAN0_ERRCNT_REC1                *( ( volatile unsigned int * ) ( 0x42C400A4UL ) )
    #define bFM3_CAN0_ERRCNT_REC2                *( ( volatile unsigned int * ) ( 0x42C400A8UL ) )
    #define bFM3_CAN0_ERRCNT_REC3                *( ( volatile unsigned int * ) ( 0x42C400ACUL ) )
    #define bFM3_CAN0_ERRCNT_REC4                *( ( volatile unsigned int * ) ( 0x42C400B0UL ) )
    #define bFM3_CAN0_ERRCNT_REC5                *( ( volatile unsigned int * ) ( 0x42C400B4UL ) )
    #define bFM3_CAN0_ERRCNT_REC6                *( ( volatile unsigned int * ) ( 0x42C400B8UL ) )
    #define bFM3_CAN0_ERRCNT_RP                  *( ( volatile unsigned int * ) ( 0x42C400BCUL ) )
    #define bFM3_CAN0_BTR_BRP0                   *( ( volatile unsigned int * ) ( 0x42C400C0UL ) )
    #define bFM3_CAN0_BTR_BRP1                   *( ( volatile unsigned int * ) ( 0x42C400C4UL ) )
    #define bFM3_CAN0_BTR_BRP2                   *( ( volatile unsigned int * ) ( 0x42C400C8UL ) )
    #define bFM3_CAN0_BTR_BRP3                   *( ( volatile unsigned int * ) ( 0x42C400CCUL ) )
    #define bFM3_CAN0_BTR_BRP4                   *( ( volatile unsigned int * ) ( 0x42C400D0UL ) )
    #define bFM3_CAN0_BTR_BRP5                   *( ( volatile unsigned int * ) ( 0x42C400D4UL ) )
    #define bFM3_CAN0_BTR_SJW0                   *( ( volatile unsigned int * ) ( 0x42C400D8UL ) )
    #define bFM3_CAN0_BTR_SJW1                   *( ( volatile unsigned int * ) ( 0x42C400DCUL ) )
    #define bFM3_CAN0_BTR_TSEG10                 *( ( volatile unsigned int * ) ( 0x42C400E0UL ) )
    #define bFM3_CAN0_BTR_TSEG11                 *( ( volatile unsigned int * ) ( 0x42C400E4UL ) )
    #define bFM3_CAN0_BTR_TSEG12                 *( ( volatile unsigned int * ) ( 0x42C400E8UL ) )
    #define bFM3_CAN0_BTR_TSEG13                 *( ( volatile unsigned int * ) ( 0x42C400ECUL ) )
    #define bFM3_CAN0_BTR_TSEG20                 *( ( volatile unsigned int * ) ( 0x42C400F0UL ) )
    #define bFM3_CAN0_BTR_TSEG21                 *( ( volatile unsigned int * ) ( 0x42C400F4UL ) )
    #define bFM3_CAN0_BTR_TSEG22                 *( ( volatile unsigned int * ) ( 0x42C400F8UL ) )
    #define bFM3_CAN0_INTR_INTID0                *( ( volatile unsigned int * ) ( 0x42C40100UL ) )
    #define bFM3_CAN0_INTR_INTID1                *( ( volatile unsigned int * ) ( 0x42C40104UL ) )
    #define bFM3_CAN0_INTR_INTID2                *( ( volatile unsigned int * ) ( 0x42C40108UL ) )
    #define bFM3_CAN0_INTR_INTID3                *( ( volatile unsigned int * ) ( 0x42C4010CUL ) )
    #define bFM3_CAN0_INTR_INTID4                *( ( volatile unsigned int * ) ( 0x42C40110UL ) )
    #define bFM3_CAN0_INTR_INTID5                *( ( volatile unsigned int * ) ( 0x42C40114UL ) )
    #define bFM3_CAN0_INTR_INTID6                *( ( volatile unsigned int * ) ( 0x42C40118UL ) )
    #define bFM3_CAN0_INTR_INTID7                *( ( volatile unsigned int * ) ( 0x42C4011CUL ) )
    #define bFM3_CAN0_INTR_INTID8                *( ( volatile unsigned int * ) ( 0x42C40120UL ) )
    #define bFM3_CAN0_INTR_INTID9                *( ( volatile unsigned int * ) ( 0x42C40124UL ) )
    #define bFM3_CAN0_INTR_INTID10               *( ( volatile unsigned int * ) ( 0x42C40128UL ) )
    #define bFM3_CAN0_INTR_INTID11               *( ( volatile unsigned int * ) ( 0x42C4012CUL ) )
    #define bFM3_CAN0_INTR_INTID12               *( ( volatile unsigned int * ) ( 0x42C40130UL ) )
    #define bFM3_CAN0_INTR_INTID13               *( ( volatile unsigned int * ) ( 0x42C40134UL ) )
    #define bFM3_CAN0_INTR_INTID14               *( ( volatile unsigned int * ) ( 0x42C40138UL ) )
    #define bFM3_CAN0_INTR_INTID15               *( ( volatile unsigned int * ) ( 0x42C4013CUL ) )
    #define bFM3_CAN0_TESTR_BASIC                *( ( volatile unsigned int * ) ( 0x42C40148UL ) )
    #define bFM3_CAN0_TESTR_SILENT               *( ( volatile unsigned int * ) ( 0x42C4014CUL ) )
    #define bFM3_CAN0_TESTR_LBACK                *( ( volatile unsigned int * ) ( 0x42C40150UL ) )
    #define bFM3_CAN0_TESTR_TX0                  *( ( volatile unsigned int * ) ( 0x42C40154UL ) )
    #define bFM3_CAN0_TESTR_TX1                  *( ( volatile unsigned int * ) ( 0x42C40158UL ) )
    #define bFM3_CAN0_TESTR_RX                   *( ( volatile unsigned int * ) ( 0x42C4015CUL ) )
    #define bFM3_CAN0_BRPER_BRPE0                *( ( volatile unsigned int * ) ( 0x42C40180UL ) )
    #define bFM3_CAN0_BRPER_BRPE1                *( ( volatile unsigned int * ) ( 0x42C40184UL ) )
    #define bFM3_CAN0_BRPER_BRPE2                *( ( volatile unsigned int * ) ( 0x42C40188UL ) )
    #define bFM3_CAN0_BRPER_BRPE3                *( ( volatile unsigned int * ) ( 0x42C4018CUL ) )
    #define bFM3_CAN0_IF1CREQ_BUSY               *( ( volatile unsigned int * ) ( 0x42C4023CUL ) )
    #define bFM3_CAN0_IF1CMSK_DATAB              *( ( volatile unsigned int * ) ( 0x42C40240UL ) )
    #define bFM3_CAN0_IF1CMSK_DATAA              *( ( volatile unsigned int * ) ( 0x42C40244UL ) )
    #define bFM3_CAN0_IF1CMSK_TXREST             *( ( volatile unsigned int * ) ( 0x42C40248UL ) )
    #define bFM3_CAN0_IF1CMSK_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C40248UL ) )
    #define bFM3_CAN0_IF1CMSK_CIP                *( ( volatile unsigned int * ) ( 0x42C4024CUL ) )
    #define bFM3_CAN0_IF1CMSK_CONTROL            *( ( volatile unsigned int * ) ( 0x42C40250UL ) )
    #define bFM3_CAN0_IF1CMSK_ARB                *( ( volatile unsigned int * ) ( 0x42C40254UL ) )
    #define bFM3_CAN0_IF1CMSK_MASK               *( ( volatile unsigned int * ) ( 0x42C40258UL ) )
    #define bFM3_CAN0_IF1CMSK_WRRD               *( ( volatile unsigned int * ) ( 0x42C4025CUL ) )
    #define bFM3_CAN0_IF1MSK_MDIR                *( ( volatile unsigned int * ) ( 0x42C402F8UL ) )
    #define bFM3_CAN0_IF1MSK_MXTD                *( ( volatile unsigned int * ) ( 0x42C402FCUL ) )
    #define bFM3_CAN0_IF1MSK2_MDIR               *( ( volatile unsigned int * ) ( 0x42C402F8UL ) )
    #define bFM3_CAN0_IF1MSK2_MXTD               *( ( volatile unsigned int * ) ( 0x42C402FCUL ) )
    #define bFM3_CAN0_IF1ARB_DIR                 *( ( volatile unsigned int * ) ( 0x42C40374UL ) )
    #define bFM3_CAN0_IF1ARB_XTD                 *( ( volatile unsigned int * ) ( 0x42C40378UL ) )
    #define bFM3_CAN0_IF1ARB_MSGVAL              *( ( volatile unsigned int * ) ( 0x42C4037CUL ) )
    #define bFM3_CAN0_IF1ARB2_DIR                *( ( volatile unsigned int * ) ( 0x42C40374UL ) )
    #define bFM3_CAN0_IF1ARB2_XTD                *( ( volatile unsigned int * ) ( 0x42C40378UL ) )
    #define bFM3_CAN0_IF1ARB2_MSGVAL             *( ( volatile unsigned int * ) ( 0x42C4037CUL ) )
    #define bFM3_CAN0_IF1MCTR_DLC0               *( ( volatile unsigned int * ) ( 0x42C40380UL ) )
    #define bFM3_CAN0_IF1MCTR_DLC1               *( ( volatile unsigned int * ) ( 0x42C40384UL ) )
    #define bFM3_CAN0_IF1MCTR_DLC2               *( ( volatile unsigned int * ) ( 0x42C40388UL ) )
    #define bFM3_CAN0_IF1MCTR_DLC3               *( ( volatile unsigned int * ) ( 0x42C4038CUL ) )
    #define bFM3_CAN0_IF1MCTR_EOB                *( ( volatile unsigned int * ) ( 0x42C4039CUL ) )
    #define bFM3_CAN0_IF1MCTR_TXRQST             *( ( volatile unsigned int * ) ( 0x42C403A0UL ) )
    #define bFM3_CAN0_IF1MCTR_RMTEN              *( ( volatile unsigned int * ) ( 0x42C403A4UL ) )
    #define bFM3_CAN0_IF1MCTR_RXIE               *( ( volatile unsigned int * ) ( 0x42C403A8UL ) )
    #define bFM3_CAN0_IF1MCTR_TXIE               *( ( volatile unsigned int * ) ( 0x42C403ACUL ) )
    #define bFM3_CAN0_IF1MCTR_UMASK              *( ( volatile unsigned int * ) ( 0x42C403B0UL ) )
    #define bFM3_CAN0_IF1MCTR_INTPND             *( ( volatile unsigned int * ) ( 0x42C403B4UL ) )
    #define bFM3_CAN0_IF1MCTR_MSGLST             *( ( volatile unsigned int * ) ( 0x42C403B8UL ) )
    #define bFM3_CAN0_IF1MCTR_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C403BCUL ) )
    #define bFM3_CAN0_IF2CREQ_BUSY               *( ( volatile unsigned int * ) ( 0x42C4083CUL ) )
    #define bFM3_CAN0_IF2CMSK_DATAB              *( ( volatile unsigned int * ) ( 0x42C40840UL ) )
    #define bFM3_CAN0_IF2CMSK_DATAA              *( ( volatile unsigned int * ) ( 0x42C40844UL ) )
    #define bFM3_CAN0_IF2CMSK_TXREST             *( ( volatile unsigned int * ) ( 0x42C40848UL ) )
    #define bFM3_CAN0_IF2CMSK_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C40848UL ) )
    #define bFM3_CAN0_IF2CMSK_CIP                *( ( volatile unsigned int * ) ( 0x42C4084CUL ) )
    #define bFM3_CAN0_IF2CMSK_CONTROL            *( ( volatile unsigned int * ) ( 0x42C40850UL ) )
    #define bFM3_CAN0_IF2CMSK_ARB                *( ( volatile unsigned int * ) ( 0x42C40854UL ) )
    #define bFM3_CAN0_IF2CMSK_MASK               *( ( volatile unsigned int * ) ( 0x42C40858UL ) )
    #define bFM3_CAN0_IF2CMSK_WRRD               *( ( volatile unsigned int * ) ( 0x42C4085CUL ) )
    #define bFM3_CAN0_IF2MSK_MDIR                *( ( volatile unsigned int * ) ( 0x42C408F8UL ) )
    #define bFM3_CAN0_IF2MSK_MXTD                *( ( volatile unsigned int * ) ( 0x42C408FCUL ) )
    #define bFM3_CAN0_IF2MSK2_MDIR               *( ( volatile unsigned int * ) ( 0x42C408F8UL ) )
    #define bFM3_CAN0_IF2MSK2_MXTD               *( ( volatile unsigned int * ) ( 0x42C408FCUL ) )
    #define bFM3_CAN0_IF2ARB_DIR                 *( ( volatile unsigned int * ) ( 0x42C40974UL ) )
    #define bFM3_CAN0_IF2ARB_XTD                 *( ( volatile unsigned int * ) ( 0x42C40978UL ) )
    #define bFM3_CAN0_IF2ARB_MSGVAL              *( ( volatile unsigned int * ) ( 0x42C4097CUL ) )
    #define bFM3_CAN0_IF2ARB2_DIR                *( ( volatile unsigned int * ) ( 0x42C40974UL ) )
    #define bFM3_CAN0_IF2ARB2_XTD                *( ( volatile unsigned int * ) ( 0x42C40978UL ) )
    #define bFM3_CAN0_IF2ARB2_MSGVAL             *( ( volatile unsigned int * ) ( 0x42C4097CUL ) )
    #define bFM3_CAN0_IF2MCTR_DLC0               *( ( volatile unsigned int * ) ( 0x42C40980UL ) )
    #define bFM3_CAN0_IF2MCTR_DLC1               *( ( volatile unsigned int * ) ( 0x42C40984UL ) )
    #define bFM3_CAN0_IF2MCTR_DLC2               *( ( volatile unsigned int * ) ( 0x42C40988UL ) )
    #define bFM3_CAN0_IF2MCTR_DLC3               *( ( volatile unsigned int * ) ( 0x42C4098CUL ) )
    #define bFM3_CAN0_IF2MCTR_EOB                *( ( volatile unsigned int * ) ( 0x42C4099CUL ) )
    #define bFM3_CAN0_IF2MCTR_TXRQST             *( ( volatile unsigned int * ) ( 0x42C409A0UL ) )
    #define bFM3_CAN0_IF2MCTR_RMTEN              *( ( volatile unsigned int * ) ( 0x42C409A4UL ) )
    #define bFM3_CAN0_IF2MCTR_RXIE               *( ( volatile unsigned int * ) ( 0x42C409A8UL ) )
    #define bFM3_CAN0_IF2MCTR_TXIE               *( ( volatile unsigned int * ) ( 0x42C409ACUL ) )
    #define bFM3_CAN0_IF2MCTR_UMASK              *( ( volatile unsigned int * ) ( 0x42C409B0UL ) )
    #define bFM3_CAN0_IF2MCTR_INTPND             *( ( volatile unsigned int * ) ( 0x42C409B4UL ) )
    #define bFM3_CAN0_IF2MCTR_MSGLST             *( ( volatile unsigned int * ) ( 0x42C409B8UL ) )
    #define bFM3_CAN0_IF2MCTR_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C409BCUL ) )
    #define bFM3_CAN0_TREQR_TXRQST1              *( ( volatile unsigned int * ) ( 0x42C41000UL ) )
    #define bFM3_CAN0_TREQR_TXRQST2              *( ( volatile unsigned int * ) ( 0x42C41004UL ) )
    #define bFM3_CAN0_TREQR_TXRQST3              *( ( volatile unsigned int * ) ( 0x42C41008UL ) )
    #define bFM3_CAN0_TREQR_TXRQST4              *( ( volatile unsigned int * ) ( 0x42C4100CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST5              *( ( volatile unsigned int * ) ( 0x42C41010UL ) )
    #define bFM3_CAN0_TREQR_TXRQST6              *( ( volatile unsigned int * ) ( 0x42C41014UL ) )
    #define bFM3_CAN0_TREQR_TXRQST7              *( ( volatile unsigned int * ) ( 0x42C41018UL ) )
    #define bFM3_CAN0_TREQR_TXRQST8              *( ( volatile unsigned int * ) ( 0x42C4101CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST9              *( ( volatile unsigned int * ) ( 0x42C41020UL ) )
    #define bFM3_CAN0_TREQR_TXRQST10             *( ( volatile unsigned int * ) ( 0x42C41024UL ) )
    #define bFM3_CAN0_TREQR_TXRQST11             *( ( volatile unsigned int * ) ( 0x42C41028UL ) )
    #define bFM3_CAN0_TREQR_TXRQST12             *( ( volatile unsigned int * ) ( 0x42C4102CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST13             *( ( volatile unsigned int * ) ( 0x42C41030UL ) )
    #define bFM3_CAN0_TREQR_TXRQST14             *( ( volatile unsigned int * ) ( 0x42C41034UL ) )
    #define bFM3_CAN0_TREQR_TXRQST15             *( ( volatile unsigned int * ) ( 0x42C41038UL ) )
    #define bFM3_CAN0_TREQR_TXRQST16             *( ( volatile unsigned int * ) ( 0x42C4103CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST17             *( ( volatile unsigned int * ) ( 0x42C41040UL ) )
    #define bFM3_CAN0_TREQR_TXRQST18             *( ( volatile unsigned int * ) ( 0x42C41044UL ) )
    #define bFM3_CAN0_TREQR_TXRQST19             *( ( volatile unsigned int * ) ( 0x42C41048UL ) )
    #define bFM3_CAN0_TREQR_TXRQST20             *( ( volatile unsigned int * ) ( 0x42C4104CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST21             *( ( volatile unsigned int * ) ( 0x42C41050UL ) )
    #define bFM3_CAN0_TREQR_TXRQST22             *( ( volatile unsigned int * ) ( 0x42C41054UL ) )
    #define bFM3_CAN0_TREQR_TXRQST23             *( ( volatile unsigned int * ) ( 0x42C41058UL ) )
    #define bFM3_CAN0_TREQR_TXRQST24             *( ( volatile unsigned int * ) ( 0x42C4105CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST25             *( ( volatile unsigned int * ) ( 0x42C41060UL ) )
    #define bFM3_CAN0_TREQR_TXRQST26             *( ( volatile unsigned int * ) ( 0x42C41064UL ) )
    #define bFM3_CAN0_TREQR_TXRQST27             *( ( volatile unsigned int * ) ( 0x42C41068UL ) )
    #define bFM3_CAN0_TREQR_TXRQST28             *( ( volatile unsigned int * ) ( 0x42C4106CUL ) )
    #define bFM3_CAN0_TREQR_TXRQST29             *( ( volatile unsigned int * ) ( 0x42C41070UL ) )
    #define bFM3_CAN0_TREQR_TXRQST30             *( ( volatile unsigned int * ) ( 0x42C41074UL ) )
    #define bFM3_CAN0_TREQR_TXRQST31             *( ( volatile unsigned int * ) ( 0x42C41078UL ) )
    #define bFM3_CAN0_TREQR_TXRQST32             *( ( volatile unsigned int * ) ( 0x42C4107CUL ) )
    #define bFM3_CAN0_TREQR1_TXRQST1             *( ( volatile unsigned int * ) ( 0x42C41000UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST2             *( ( volatile unsigned int * ) ( 0x42C41004UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST3             *( ( volatile unsigned int * ) ( 0x42C41008UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST4             *( ( volatile unsigned int * ) ( 0x42C4100CUL ) )
    #define bFM3_CAN0_TREQR1_TXRQST5             *( ( volatile unsigned int * ) ( 0x42C41010UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST6             *( ( volatile unsigned int * ) ( 0x42C41014UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST7             *( ( volatile unsigned int * ) ( 0x42C41018UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST8             *( ( volatile unsigned int * ) ( 0x42C4101CUL ) )
    #define bFM3_CAN0_TREQR1_TXRQST9             *( ( volatile unsigned int * ) ( 0x42C41020UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST10            *( ( volatile unsigned int * ) ( 0x42C41024UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST11            *( ( volatile unsigned int * ) ( 0x42C41028UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST12            *( ( volatile unsigned int * ) ( 0x42C4102CUL ) )
    #define bFM3_CAN0_TREQR1_TXRQST13            *( ( volatile unsigned int * ) ( 0x42C41030UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST14            *( ( volatile unsigned int * ) ( 0x42C41034UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST15            *( ( volatile unsigned int * ) ( 0x42C41038UL ) )
    #define bFM3_CAN0_TREQR1_TXRQST16            *( ( volatile unsigned int * ) ( 0x42C4103CUL ) )
    #define bFM3_CAN0_TREQR2_TXRQST17            *( ( volatile unsigned int * ) ( 0x42C41040UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST18            *( ( volatile unsigned int * ) ( 0x42C41044UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST19            *( ( volatile unsigned int * ) ( 0x42C41048UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST20            *( ( volatile unsigned int * ) ( 0x42C4104CUL ) )
    #define bFM3_CAN0_TREQR2_TXRQST21            *( ( volatile unsigned int * ) ( 0x42C41050UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST22            *( ( volatile unsigned int * ) ( 0x42C41054UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST23            *( ( volatile unsigned int * ) ( 0x42C41058UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST24            *( ( volatile unsigned int * ) ( 0x42C4105CUL ) )
    #define bFM3_CAN0_TREQR2_TXRQST25            *( ( volatile unsigned int * ) ( 0x42C41060UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST26            *( ( volatile unsigned int * ) ( 0x42C41064UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST27            *( ( volatile unsigned int * ) ( 0x42C41068UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST28            *( ( volatile unsigned int * ) ( 0x42C4106CUL ) )
    #define bFM3_CAN0_TREQR2_TXRQST29            *( ( volatile unsigned int * ) ( 0x42C41070UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST30            *( ( volatile unsigned int * ) ( 0x42C41074UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST31            *( ( volatile unsigned int * ) ( 0x42C41078UL ) )
    #define bFM3_CAN0_TREQR2_TXRQST32            *( ( volatile unsigned int * ) ( 0x42C4107CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT1              *( ( volatile unsigned int * ) ( 0x42C41200UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT2              *( ( volatile unsigned int * ) ( 0x42C41204UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT3              *( ( volatile unsigned int * ) ( 0x42C41208UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT4              *( ( volatile unsigned int * ) ( 0x42C4120CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT5              *( ( volatile unsigned int * ) ( 0x42C41210UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT6              *( ( volatile unsigned int * ) ( 0x42C41214UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT7              *( ( volatile unsigned int * ) ( 0x42C41218UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT8              *( ( volatile unsigned int * ) ( 0x42C4121CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT9              *( ( volatile unsigned int * ) ( 0x42C41220UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT10             *( ( volatile unsigned int * ) ( 0x42C41224UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT11             *( ( volatile unsigned int * ) ( 0x42C41228UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT12             *( ( volatile unsigned int * ) ( 0x42C4122CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT13             *( ( volatile unsigned int * ) ( 0x42C41230UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT14             *( ( volatile unsigned int * ) ( 0x42C41234UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT15             *( ( volatile unsigned int * ) ( 0x42C41238UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT16             *( ( volatile unsigned int * ) ( 0x42C4123CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT17             *( ( volatile unsigned int * ) ( 0x42C41240UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT18             *( ( volatile unsigned int * ) ( 0x42C41244UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT19             *( ( volatile unsigned int * ) ( 0x42C41248UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT20             *( ( volatile unsigned int * ) ( 0x42C4124CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT21             *( ( volatile unsigned int * ) ( 0x42C41250UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT22             *( ( volatile unsigned int * ) ( 0x42C41254UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT23             *( ( volatile unsigned int * ) ( 0x42C41258UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT24             *( ( volatile unsigned int * ) ( 0x42C4125CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT25             *( ( volatile unsigned int * ) ( 0x42C41260UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT26             *( ( volatile unsigned int * ) ( 0x42C41264UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT27             *( ( volatile unsigned int * ) ( 0x42C41268UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT28             *( ( volatile unsigned int * ) ( 0x42C4126CUL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT29             *( ( volatile unsigned int * ) ( 0x42C41270UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT30             *( ( volatile unsigned int * ) ( 0x42C41274UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT31             *( ( volatile unsigned int * ) ( 0x42C41278UL ) )
    #define bFM3_CAN0_NEWDT_NEWDAT32             *( ( volatile unsigned int * ) ( 0x42C4127CUL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT1             *( ( volatile unsigned int * ) ( 0x42C41200UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT2             *( ( volatile unsigned int * ) ( 0x42C41204UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT3             *( ( volatile unsigned int * ) ( 0x42C41208UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT4             *( ( volatile unsigned int * ) ( 0x42C4120CUL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT5             *( ( volatile unsigned int * ) ( 0x42C41210UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT6             *( ( volatile unsigned int * ) ( 0x42C41214UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT7             *( ( volatile unsigned int * ) ( 0x42C41218UL ) )
    #define bFM3_CAN0_NEWDT1_NEWDAT8             *( ( volatile unsigned int * ) ( 0x42C4121CUL ) )
