FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
/* CAN channel 1 registers */
    #define bFM3_CAN1_CTRLR_INIT                 *( ( volatile unsigned int * ) ( 0x42C60000UL ) )
    #define bFM3_CAN1_CTRLR_IE                   *( ( volatile unsigned int * ) ( 0x42C60004UL ) )
    #define bFM3_CAN1_CTRLR_SIE                  *( ( volatile unsigned int * ) ( 0x42C60008UL ) )
    #define bFM3_CAN1_CTRLR_EIE                  *( ( volatile unsigned int * ) ( 0x42C6000CUL ) )
    #define bFM3_CAN1_CTRLR_DAR                  *( ( volatile unsigned int * ) ( 0x42C60014UL ) )
    #define bFM3_CAN1_CTRLR_CCE                  *( ( volatile unsigned int * ) ( 0x42C60018UL ) )
    #define bFM3_CAN1_CTRLR_TEST                 *( ( volatile unsigned int * ) ( 0x42C6001CUL ) )
    #define bFM3_CAN1_STATR_LEC0                 *( ( volatile unsigned int * ) ( 0x42C60040UL ) )
    #define bFM3_CAN1_STATR_LEC1                 *( ( volatile unsigned int * ) ( 0x42C60044UL ) )
    #define bFM3_CAN1_STATR_LEC2                 *( ( volatile unsigned int * ) ( 0x42C60048UL ) )
    #define bFM3_CAN1_STATR_TXOK                 *( ( volatile unsigned int * ) ( 0x42C6004CUL ) )
    #define bFM3_CAN1_STATR_RXOK                 *( ( volatile unsigned int * ) ( 0x42C60050UL ) )
    #define bFM3_CAN1_STATR_EPASS                *( ( volatile unsigned int * ) ( 0x42C60054UL ) )
    #define bFM3_CAN1_STATR_EWARM                *( ( volatile unsigned int * ) ( 0x42C60058UL ) )
    #define bFM3_CAN1_STATR_BOFF                 *( ( volatile unsigned int * ) ( 0x42C6005CUL ) )
    #define bFM3_CAN1_ERRCNT_TEC0                *( ( volatile unsigned int * ) ( 0x42C60080UL ) )
    #define bFM3_CAN1_ERRCNT_TEC1                *( ( volatile unsigned int * ) ( 0x42C60084UL ) )
    #define bFM3_CAN1_ERRCNT_TEC2                *( ( volatile unsigned int * ) ( 0x42C60088UL ) )
    #define bFM3_CAN1_ERRCNT_TEC3                *( ( volatile unsigned int * ) ( 0x42C6008CUL ) )
    #define bFM3_CAN1_ERRCNT_TEC4                *( ( volatile unsigned int * ) ( 0x42C60090UL ) )
    #define bFM3_CAN1_ERRCNT_TEC5                *( ( volatile unsigned int * ) ( 0x42C60094UL ) )
    #define bFM3_CAN1_ERRCNT_TEC6                *( ( volatile unsigned int * ) ( 0x42C60098UL ) )
    #define bFM3_CAN1_ERRCNT_TEC7                *( ( volatile unsigned int * ) ( 0x42C6009CUL ) )
    #define bFM3_CAN1_ERRCNT_REC0                *( ( volatile unsigned int * ) ( 0x42C600A0UL ) )
    #define bFM3_CAN1_ERRCNT_REC1                *( ( volatile unsigned int * ) ( 0x42C600A4UL ) )
    #define bFM3_CAN1_ERRCNT_REC2                *( ( volatile unsigned int * ) ( 0x42C600A8UL ) )
    #define bFM3_CAN1_ERRCNT_REC3                *( ( volatile unsigned int * ) ( 0x42C600ACUL ) )
    #define bFM3_CAN1_ERRCNT_REC4                *( ( volatile unsigned int * ) ( 0x42C600B0UL ) )
    #define bFM3_CAN1_ERRCNT_REC5                *( ( volatile unsigned int * ) ( 0x42C600B4UL ) )
    #define bFM3_CAN1_ERRCNT_REC6                *( ( volatile unsigned int * ) ( 0x42C600B8UL ) )
    #define bFM3_CAN1_ERRCNT_RP                  *( ( volatile unsigned int * ) ( 0x42C600BCUL ) )
    #define bFM3_CAN1_BTR_BRP0                   *( ( volatile unsigned int * ) ( 0x42C600C0UL ) )
    #define bFM3_CAN1_BTR_BRP1                   *( ( volatile unsigned int * ) ( 0x42C600C4UL ) )
    #define bFM3_CAN1_BTR_BRP2                   *( ( volatile unsigned int * ) ( 0x42C600C8UL ) )
    #define bFM3_CAN1_BTR_BRP3                   *( ( volatile unsigned int * ) ( 0x42C600CCUL ) )
    #define bFM3_CAN1_BTR_BRP4                   *( ( volatile unsigned int * ) ( 0x42C600D0UL ) )
    #define bFM3_CAN1_BTR_BRP5                   *( ( volatile unsigned int * ) ( 0x42C600D4UL ) )
    #define bFM3_CAN1_BTR_SJW0                   *( ( volatile unsigned int * ) ( 0x42C600D8UL ) )
    #define bFM3_CAN1_BTR_SJW1                   *( ( volatile unsigned int * ) ( 0x42C600DCUL ) )
    #define bFM3_CAN1_BTR_TSEG10                 *( ( volatile unsigned int * ) ( 0x42C600E0UL ) )
    #define bFM3_CAN1_BTR_TSEG11                 *( ( volatile unsigned int * ) ( 0x42C600E4UL ) )
    #define bFM3_CAN1_BTR_TSEG12                 *( ( volatile unsigned int * ) ( 0x42C600E8UL ) )
    #define bFM3_CAN1_BTR_TSEG13                 *( ( volatile unsigned int * ) ( 0x42C600ECUL ) )
    #define bFM3_CAN1_BTR_TSEG20                 *( ( volatile unsigned int * ) ( 0x42C600F0UL ) )
    #define bFM3_CAN1_BTR_TSEG21                 *( ( volatile unsigned int * ) ( 0x42C600F4UL ) )
    #define bFM3_CAN1_BTR_TSEG22                 *( ( volatile unsigned int * ) ( 0x42C600F8UL ) )
    #define bFM3_CAN1_INTR_INTID0                *( ( volatile unsigned int * ) ( 0x42C60100UL ) )
    #define bFM3_CAN1_INTR_INTID1                *( ( volatile unsigned int * ) ( 0x42C60104UL ) )
    #define bFM3_CAN1_INTR_INTID2                *( ( volatile unsigned int * ) ( 0x42C60108UL ) )
    #define bFM3_CAN1_INTR_INTID3                *( ( volatile unsigned int * ) ( 0x42C6010CUL ) )
    #define bFM3_CAN1_INTR_INTID4                *( ( volatile unsigned int * ) ( 0x42C60110UL ) )
    #define bFM3_CAN1_INTR_INTID5                *( ( volatile unsigned int * ) ( 0x42C60114UL ) )
    #define bFM3_CAN1_INTR_INTID6                *( ( volatile unsigned int * ) ( 0x42C60118UL ) )
    #define bFM3_CAN1_INTR_INTID7                *( ( volatile unsigned int * ) ( 0x42C6011CUL ) )
    #define bFM3_CAN1_INTR_INTID8                *( ( volatile unsigned int * ) ( 0x42C60120UL ) )
    #define bFM3_CAN1_INTR_INTID9                *( ( volatile unsigned int * ) ( 0x42C60124UL ) )
    #define bFM3_CAN1_INTR_INTID10               *( ( volatile unsigned int * ) ( 0x42C60128UL ) )
    #define bFM3_CAN1_INTR_INTID11               *( ( volatile unsigned int * ) ( 0x42C6012CUL ) )
    #define bFM3_CAN1_INTR_INTID12               *( ( volatile unsigned int * ) ( 0x42C60130UL ) )
    #define bFM3_CAN1_INTR_INTID13               *( ( volatile unsigned int * ) ( 0x42C60134UL ) )
    #define bFM3_CAN1_INTR_INTID14               *( ( volatile unsigned int * ) ( 0x42C60138UL ) )
    #define bFM3_CAN1_INTR_INTID15               *( ( volatile unsigned int * ) ( 0x42C6013CUL ) )
    #define bFM3_CAN1_TESTR_BASIC                *( ( volatile unsigned int * ) ( 0x42C60148UL ) )
    #define bFM3_CAN1_TESTR_SILENT               *( ( volatile unsigned int * ) ( 0x42C6014CUL ) )
    #define bFM3_CAN1_TESTR_LBACK                *( ( volatile unsigned int * ) ( 0x42C60150UL ) )
    #define bFM3_CAN1_TESTR_TX0                  *( ( volatile unsigned int * ) ( 0x42C60154UL ) )
    #define bFM3_CAN1_TESTR_TX1                  *( ( volatile unsigned int * ) ( 0x42C60158UL ) )
    #define bFM3_CAN1_TESTR_RX                   *( ( volatile unsigned int * ) ( 0x42C6015CUL ) )
    #define bFM3_CAN1_BRPER_BRPE0                *( ( volatile unsigned int * ) ( 0x42C60180UL ) )
    #define bFM3_CAN1_BRPER_BRPE1                *( ( volatile unsigned int * ) ( 0x42C60184UL ) )
    #define bFM3_CAN1_BRPER_BRPE2                *( ( volatile unsigned int * ) ( 0x42C60188UL ) )
    #define bFM3_CAN1_BRPER_BRPE3                *( ( volatile unsigned int * ) ( 0x42C6018CUL ) )
    #define bFM3_CAN1_IF1CREQ_BUSY               *( ( volatile unsigned int * ) ( 0x42C6023CUL ) )
    #define bFM3_CAN1_IF1CMSK_DATAB              *( ( volatile unsigned int * ) ( 0x42C60240UL ) )
    #define bFM3_CAN1_IF1CMSK_DATAA              *( ( volatile unsigned int * ) ( 0x42C60244UL ) )
    #define bFM3_CAN1_IF1CMSK_TXREST             *( ( volatile unsigned int * ) ( 0x42C60248UL ) )
    #define bFM3_CAN1_IF1CMSK_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C60248UL ) )
    #define bFM3_CAN1_IF1CMSK_CIP                *( ( volatile unsigned int * ) ( 0x42C6024CUL ) )
    #define bFM3_CAN1_IF1CMSK_CONTROL            *( ( volatile unsigned int * ) ( 0x42C60250UL ) )
    #define bFM3_CAN1_IF1CMSK_ARB                *( ( volatile unsigned int * ) ( 0x42C60254UL ) )
    #define bFM3_CAN1_IF1CMSK_MASK               *( ( volatile unsigned int * ) ( 0x42C60258UL ) )
    #define bFM3_CAN1_IF1CMSK_WRRD               *( ( volatile unsigned int * ) ( 0x42C6025CUL ) )
    #define bFM3_CAN1_IF1MSK_MDIR                *( ( volatile unsigned int * ) ( 0x42C602F8UL ) )
    #define bFM3_CAN1_IF1MSK_MXTD                *( ( volatile unsigned int * ) ( 0x42C602FCUL ) )
    #define bFM3_CAN1_IF1MSK2_MDIR               *( ( volatile unsigned int * ) ( 0x42C602F8UL ) )
    #define bFM3_CAN1_IF1MSK2_MXTD               *( ( volatile unsigned int * ) ( 0x42C602FCUL ) )
    #define bFM3_CAN1_IF1ARB_DIR                 *( ( volatile unsigned int * ) ( 0x42C60374UL ) )
    #define bFM3_CAN1_IF1ARB_XTD                 *( ( volatile unsigned int * ) ( 0x42C60378UL ) )
    #define bFM3_CAN1_IF1ARB_MSGVAL              *( ( volatile unsigned int * ) ( 0x42C6037CUL ) )
    #define bFM3_CAN1_IF1ARB2_DIR                *( ( volatile unsigned int * ) ( 0x42C60374UL ) )
    #define bFM3_CAN1_IF1ARB2_XTD                *( ( volatile unsigned int * ) ( 0x42C60378UL ) )
    #define bFM3_CAN1_IF1ARB2_MSGVAL             *( ( volatile unsigned int * ) ( 0x42C6037CUL ) )
    #define bFM3_CAN1_IF1MCTR_DLC0               *( ( volatile unsigned int * ) ( 0x42C60380UL ) )
    #define bFM3_CAN1_IF1MCTR_DLC1               *( ( volatile unsigned int * ) ( 0x42C60384UL ) )
    #define bFM3_CAN1_IF1MCTR_DLC2               *( ( volatile unsigned int * ) ( 0x42C60388UL ) )
    #define bFM3_CAN1_IF1MCTR_DLC3               *( ( volatile unsigned int * ) ( 0x42C6038CUL ) )
    #define bFM3_CAN1_IF1MCTR_EOB                *( ( volatile unsigned int * ) ( 0x42C6039CUL ) )
    #define bFM3_CAN1_IF1MCTR_TXRQST             *( ( volatile unsigned int * ) ( 0x42C603A0UL ) )
    #define bFM3_CAN1_IF1MCTR_RMTEN              *( ( volatile unsigned int * ) ( 0x42C603A4UL ) )
    #define bFM3_CAN1_IF1MCTR_RXIE               *( ( volatile unsigned int * ) ( 0x42C603A8UL ) )
    #define bFM3_CAN1_IF1MCTR_TXIE               *( ( volatile unsigned int * ) ( 0x42C603ACUL ) )
    #define bFM3_CAN1_IF1MCTR_UMASK              *( ( volatile unsigned int * ) ( 0x42C603B0UL ) )
    #define bFM3_CAN1_IF1MCTR_INTPND             *( ( volatile unsigned int * ) ( 0x42C603B4UL ) )
    #define bFM3_CAN1_IF1MCTR_MSGLST             *( ( volatile unsigned int * ) ( 0x42C603B8UL ) )
    #define bFM3_CAN1_IF1MCTR_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C603BCUL ) )
    #define bFM3_CAN1_IF2CREQ_BUSY               *( ( volatile unsigned int * ) ( 0x42C6083CUL ) )
    #define bFM3_CAN1_IF2CMSK_DATAB              *( ( volatile unsigned int * ) ( 0x42C60840UL ) )
    #define bFM3_CAN1_IF2CMSK_DATAA              *( ( volatile unsigned int * ) ( 0x42C60844UL ) )
    #define bFM3_CAN1_IF2CMSK_TXREST             *( ( volatile unsigned int * ) ( 0x42C60848UL ) )
    #define bFM3_CAN1_IF2CMSK_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C60848UL ) )
    #define bFM3_CAN1_IF2CMSK_CIP                *( ( volatile unsigned int * ) ( 0x42C6084CUL ) )
    #define bFM3_CAN1_IF2CMSK_CONTROL            *( ( volatile unsigned int * ) ( 0x42C60850UL ) )
    #define bFM3_CAN1_IF2CMSK_ARB                *( ( volatile unsigned int * ) ( 0x42C60854UL ) )
    #define bFM3_CAN1_IF2CMSK_MASK               *( ( volatile unsigned int * ) ( 0x42C60858UL ) )
    #define bFM3_CAN1_IF2CMSK_WRRD               *( ( volatile unsigned int * ) ( 0x42C6085CUL ) )
    #define bFM3_CAN1_IF2MSK_MDIR                *( ( volatile unsigned int * ) ( 0x42C608F8UL ) )
    #define bFM3_CAN1_IF2MSK_MXTD                *( ( volatile unsigned int * ) ( 0x42C608FCUL ) )
    #define bFM3_CAN1_IF2MSK2_MDIR               *( ( volatile unsigned int * ) ( 0x42C608F8UL ) )
    #define bFM3_CAN1_IF2MSK2_MXTD               *( ( volatile unsigned int * ) ( 0x42C608FCUL ) )
    #define bFM3_CAN1_IF2ARB_DIR                 *( ( volatile unsigned int * ) ( 0x42C60974UL ) )
    #define bFM3_CAN1_IF2ARB_XTD                 *( ( volatile unsigned int * ) ( 0x42C60978UL ) )
    #define bFM3_CAN1_IF2ARB_MSGVAL              *( ( volatile unsigned int * ) ( 0x42C6097CUL ) )
    #define bFM3_CAN1_IF2ARB2_DIR                *( ( volatile unsigned int * ) ( 0x42C60974UL ) )
    #define bFM3_CAN1_IF2ARB2_XTD                *( ( volatile unsigned int * ) ( 0x42C60978UL ) )
    #define bFM3_CAN1_IF2ARB2_MSGVAL             *( ( volatile unsigned int * ) ( 0x42C6097CUL ) )
    #define bFM3_CAN1_IF2MCTR_DLC0               *( ( volatile unsigned int * ) ( 0x42C60980UL ) )
    #define bFM3_CAN1_IF2MCTR_DLC1               *( ( volatile unsigned int * ) ( 0x42C60984UL ) )
    #define bFM3_CAN1_IF2MCTR_DLC2               *( ( volatile unsigned int * ) ( 0x42C60988UL ) )
    #define bFM3_CAN1_IF2MCTR_DLC3               *( ( volatile unsigned int * ) ( 0x42C6098CUL ) )
    #define bFM3_CAN1_IF2MCTR_EOB                *( ( volatile unsigned int * ) ( 0x42C6099CUL ) )
    #define bFM3_CAN1_IF2MCTR_TXRQST             *( ( volatile unsigned int * ) ( 0x42C609A0UL ) )
    #define bFM3_CAN1_IF2MCTR_RMTEN              *( ( volatile unsigned int * ) ( 0x42C609A4UL ) )
    #define bFM3_CAN1_IF2MCTR_RXIE               *( ( volatile unsigned int * ) ( 0x42C609A8UL ) )
    #define bFM3_CAN1_IF2MCTR_TXIE               *( ( volatile unsigned int * ) ( 0x42C609ACUL ) )
    #define bFM3_CAN1_IF2MCTR_UMASK              *( ( volatile unsigned int * ) ( 0x42C609B0UL ) )
    #define bFM3_CAN1_IF2MCTR_INTPND             *( ( volatile unsigned int * ) ( 0x42C609B4UL ) )
    #define bFM3_CAN1_IF2MCTR_MSGLST             *( ( volatile unsigned int * ) ( 0x42C609B8UL ) )
    #define bFM3_CAN1_IF2MCTR_NEWDAT             *( ( volatile unsigned int * ) ( 0x42C609BCUL ) )
    #define bFM3_CAN1_TREQR_TXRQST1              *( ( volatile unsigned int * ) ( 0x42C61000UL ) )
    #define bFM3_CAN1_TREQR_TXRQST2              *( ( volatile unsigned int * ) ( 0x42C61004UL ) )
    #define bFM3_CAN1_TREQR_TXRQST3              *( ( volatile unsigned int * ) ( 0x42C61008UL ) )
    #define bFM3_CAN1_TREQR_TXRQST4              *( ( volatile unsigned int * ) ( 0x42C6100CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST5              *( ( volatile unsigned int * ) ( 0x42C61010UL ) )
    #define bFM3_CAN1_TREQR_TXRQST6              *( ( volatile unsigned int * ) ( 0x42C61014UL ) )
    #define bFM3_CAN1_TREQR_TXRQST7              *( ( volatile unsigned int * ) ( 0x42C61018UL ) )
    #define bFM3_CAN1_TREQR_TXRQST8              *( ( volatile unsigned int * ) ( 0x42C6101CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST9              *( ( volatile unsigned int * ) ( 0x42C61020UL ) )
    #define bFM3_CAN1_TREQR_TXRQST10             *( ( volatile unsigned int * ) ( 0x42C61024UL ) )
    #define bFM3_CAN1_TREQR_TXRQST11             *( ( volatile unsigned int * ) ( 0x42C61028UL ) )
    #define bFM3_CAN1_TREQR_TXRQST12             *( ( volatile unsigned int * ) ( 0x42C6102CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST13             *( ( volatile unsigned int * ) ( 0x42C61030UL ) )
    #define bFM3_CAN1_TREQR_TXRQST14             *( ( volatile unsigned int * ) ( 0x42C61034UL ) )
    #define bFM3_CAN1_TREQR_TXRQST15             *( ( volatile unsigned int * ) ( 0x42C61038UL ) )
    #define bFM3_CAN1_TREQR_TXRQST16             *( ( volatile unsigned int * ) ( 0x42C6103CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST17             *( ( volatile unsigned int * ) ( 0x42C61040UL ) )
    #define bFM3_CAN1_TREQR_TXRQST18             *( ( volatile unsigned int * ) ( 0x42C61044UL ) )
    #define bFM3_CAN1_TREQR_TXRQST19             *( ( volatile unsigned int * ) ( 0x42C61048UL ) )
    #define bFM3_CAN1_TREQR_TXRQST20             *( ( volatile unsigned int * ) ( 0x42C6104CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST21             *( ( volatile unsigned int * ) ( 0x42C61050UL ) )
    #define bFM3_CAN1_TREQR_TXRQST22             *( ( volatile unsigned int * ) ( 0x42C61054UL ) )
    #define bFM3_CAN1_TREQR_TXRQST23             *( ( volatile unsigned int * ) ( 0x42C61058UL ) )
    #define bFM3_CAN1_TREQR_TXRQST24             *( ( volatile unsigned int * ) ( 0x42C6105CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST25             *( ( volatile unsigned int * ) ( 0x42C61060UL ) )
    #define bFM3_CAN1_TREQR_TXRQST26             *( ( volatile unsigned int * ) ( 0x42C61064UL ) )
    #define bFM3_CAN1_TREQR_TXRQST27             *( ( volatile unsigned int * ) ( 0x42C61068UL ) )
    #define bFM3_CAN1_TREQR_TXRQST28             *( ( volatile unsigned int * ) ( 0x42C6106CUL ) )
    #define bFM3_CAN1_TREQR_TXRQST29             *( ( volatile unsigned int * ) ( 0x42C61070UL ) )
    #define bFM3_CAN1_TREQR_TXRQST30             *( ( volatile unsigned int * ) ( 0x42C61074UL ) )
    #define bFM3_CAN1_TREQR_TXRQST31             *( ( volatile unsigned int * ) ( 0x42C61078UL ) )
    #define bFM3_CAN1_TREQR_TXRQST32             *( ( volatile unsigned int * ) ( 0x42C6107CUL ) )
    #define bFM3_CAN1_TREQR1_TXRQST1             *( ( volatile unsigned int * ) ( 0x42C61000UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST2             *( ( volatile unsigned int * ) ( 0x42C61004UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST3             *( ( volatile unsigned int * ) ( 0x42C61008UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST4             *( ( volatile unsigned int * ) ( 0x42C6100CUL ) )
    #define bFM3_CAN1_TREQR1_TXRQST5             *( ( volatile unsigned int * ) ( 0x42C61010UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST6             *( ( volatile unsigned int * ) ( 0x42C61014UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST7             *( ( volatile unsigned int * ) ( 0x42C61018UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST8             *( ( volatile unsigned int * ) ( 0x42C6101CUL ) )
    #define bFM3_CAN1_TREQR1_TXRQST9             *( ( volatile unsigned int * ) ( 0x42C61020UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST10            *( ( volatile unsigned int * ) ( 0x42C61024UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST11            *( ( volatile unsigned int * ) ( 0x42C61028UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST12            *( ( volatile unsigned int * ) ( 0x42C6102CUL ) )
    #define bFM3_CAN1_TREQR1_TXRQST13            *( ( volatile unsigned int * ) ( 0x42C61030UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST14            *( ( volatile unsigned int * ) ( 0x42C61034UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST15            *( ( volatile unsigned int * ) ( 0x42C61038UL ) )
    #define bFM3_CAN1_TREQR1_TXRQST16            *( ( volatile unsigned int * ) ( 0x42C6103CUL ) )
    #define bFM3_CAN1_TREQR2_TXRQST17            *( ( volatile unsigned int * ) ( 0x42C61040UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST18            *( ( volatile unsigned int * ) ( 0x42C61044UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST19            *( ( volatile unsigned int * ) ( 0x42C61048UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST20            *( ( volatile unsigned int * ) ( 0x42C6104CUL ) )
    #define bFM3_CAN1_TREQR2_TXRQST21            *( ( volatile unsigned int * ) ( 0x42C61050UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST22            *( ( volatile unsigned int * ) ( 0x42C61054UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST23            *( ( volatile unsigned int * ) ( 0x42C61058UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST24            *( ( volatile unsigned int * ) ( 0x42C6105CUL ) )
    #define bFM3_CAN1_TREQR2_TXRQST25            *( ( volatile unsigned int * ) ( 0x42C61060UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST26            *( ( volatile unsigned int * ) ( 0x42C61064UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST27            *( ( volatile unsigned int * ) ( 0x42C61068UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST28            *( ( volatile unsigned int * ) ( 0x42C6106CUL ) )
    #define bFM3_CAN1_TREQR2_TXRQST29            *( ( volatile unsigned int * ) ( 0x42C61070UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST30            *( ( volatile unsigned int * ) ( 0x42C61074UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST31            *( ( volatile unsigned int * ) ( 0x42C61078UL ) )
    #define bFM3_CAN1_TREQR2_TXRQST32            *( ( volatile unsigned int * ) ( 0x42C6107CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT1              *( ( volatile unsigned int * ) ( 0x42C61200UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT2              *( ( volatile unsigned int * ) ( 0x42C61204UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT3              *( ( volatile unsigned int * ) ( 0x42C61208UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT4              *( ( volatile unsigned int * ) ( 0x42C6120CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT5              *( ( volatile unsigned int * ) ( 0x42C61210UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT6              *( ( volatile unsigned int * ) ( 0x42C61214UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT7              *( ( volatile unsigned int * ) ( 0x42C61218UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT8              *( ( volatile unsigned int * ) ( 0x42C6121CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT9              *( ( volatile unsigned int * ) ( 0x42C61220UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT10             *( ( volatile unsigned int * ) ( 0x42C61224UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT11             *( ( volatile unsigned int * ) ( 0x42C61228UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT12             *( ( volatile unsigned int * ) ( 0x42C6122CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT13             *( ( volatile unsigned int * ) ( 0x42C61230UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT14             *( ( volatile unsigned int * ) ( 0x42C61234UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT15             *( ( volatile unsigned int * ) ( 0x42C61238UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT16             *( ( volatile unsigned int * ) ( 0x42C6123CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT17             *( ( volatile unsigned int * ) ( 0x42C61240UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT18             *( ( volatile unsigned int * ) ( 0x42C61244UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT19             *( ( volatile unsigned int * ) ( 0x42C61248UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT20             *( ( volatile unsigned int * ) ( 0x42C6124CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT21             *( ( volatile unsigned int * ) ( 0x42C61250UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT22             *( ( volatile unsigned int * ) ( 0x42C61254UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT23             *( ( volatile unsigned int * ) ( 0x42C61258UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT24             *( ( volatile unsigned int * ) ( 0x42C6125CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT25             *( ( volatile unsigned int * ) ( 0x42C61260UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT26             *( ( volatile unsigned int * ) ( 0x42C61264UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT27             *( ( volatile unsigned int * ) ( 0x42C61268UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT28             *( ( volatile unsigned int * ) ( 0x42C6126CUL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT29             *( ( volatile unsigned int * ) ( 0x42C61270UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT30             *( ( volatile unsigned int * ) ( 0x42C61274UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT31             *( ( volatile unsigned int * ) ( 0x42C61278UL ) )
    #define bFM3_CAN1_NEWDT_NEWDAT32             *( ( volatile unsigned int * ) ( 0x42C6127CUL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT1             *( ( volatile unsigned int * ) ( 0x42C61200UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT2             *( ( volatile unsigned int * ) ( 0x42C61204UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT3             *( ( volatile unsigned int * ) ( 0x42C61208UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT4             *( ( volatile unsigned int * ) ( 0x42C6120CUL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT5             *( ( volatile unsigned int * ) ( 0x42C61210UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT6             *( ( volatile unsigned int * ) ( 0x42C61214UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT7             *( ( volatile unsigned int * ) ( 0x42C61218UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT8             *( ( volatile unsigned int * ) ( 0x42C6121CUL ) )
