FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MB9B500_IAR_Keil/Fujitu_source/mb9bf506n.h
    #define bFM3_CAN1_NEWDT1_NEWDAT9             *( ( volatile unsigned int * ) ( 0x42C61220UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT10            *( ( volatile unsigned int * ) ( 0x42C61224UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT11            *( ( volatile unsigned int * ) ( 0x42C61228UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT12            *( ( volatile unsigned int * ) ( 0x42C6122CUL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT13            *( ( volatile unsigned int * ) ( 0x42C61230UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT14            *( ( volatile unsigned int * ) ( 0x42C61234UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT15            *( ( volatile unsigned int * ) ( 0x42C61238UL ) )
    #define bFM3_CAN1_NEWDT1_NEWDAT16            *( ( volatile unsigned int * ) ( 0x42C6123CUL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT17            *( ( volatile unsigned int * ) ( 0x42C61240UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT18            *( ( volatile unsigned int * ) ( 0x42C61244UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT19            *( ( volatile unsigned int * ) ( 0x42C61248UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT20            *( ( volatile unsigned int * ) ( 0x42C6124CUL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT21            *( ( volatile unsigned int * ) ( 0x42C61250UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT22            *( ( volatile unsigned int * ) ( 0x42C61254UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT23            *( ( volatile unsigned int * ) ( 0x42C61258UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT24            *( ( volatile unsigned int * ) ( 0x42C6125CUL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT25            *( ( volatile unsigned int * ) ( 0x42C61260UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT26            *( ( volatile unsigned int * ) ( 0x42C61264UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT27            *( ( volatile unsigned int * ) ( 0x42C61268UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT28            *( ( volatile unsigned int * ) ( 0x42C6126CUL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT29            *( ( volatile unsigned int * ) ( 0x42C61270UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT30            *( ( volatile unsigned int * ) ( 0x42C61274UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT31            *( ( volatile unsigned int * ) ( 0x42C61278UL ) )
    #define bFM3_CAN1_NEWDT2_NEWDAT32            *( ( volatile unsigned int * ) ( 0x42C6127CUL ) )
    #define bFM3_CAN1_INTPND_INTPND1             *( ( volatile unsigned int * ) ( 0x42C61400UL ) )
    #define bFM3_CAN1_INTPND_INTPND2             *( ( volatile unsigned int * ) ( 0x42C61404UL ) )
    #define bFM3_CAN1_INTPND_INTPND3             *( ( volatile unsigned int * ) ( 0x42C61408UL ) )
    #define bFM3_CAN1_INTPND_INTPND4             *( ( volatile unsigned int * ) ( 0x42C6140CUL ) )
    #define bFM3_CAN1_INTPND_INTPND5             *( ( volatile unsigned int * ) ( 0x42C61410UL ) )
    #define bFM3_CAN1_INTPND_INTPND6             *( ( volatile unsigned int * ) ( 0x42C61414UL ) )
    #define bFM3_CAN1_INTPND_INTPND7             *( ( volatile unsigned int * ) ( 0x42C61418UL ) )
    #define bFM3_CAN1_INTPND_INTPND8             *( ( volatile unsigned int * ) ( 0x42C6141CUL ) )
    #define bFM3_CAN1_INTPND_INTPND9             *( ( volatile unsigned int * ) ( 0x42C61420UL ) )
    #define bFM3_CAN1_INTPND_INTPND10            *( ( volatile unsigned int * ) ( 0x42C61424UL ) )
    #define bFM3_CAN1_INTPND_INTPND11            *( ( volatile unsigned int * ) ( 0x42C61428UL ) )
    #define bFM3_CAN1_INTPND_INTPND12            *( ( volatile unsigned int * ) ( 0x42C6142CUL ) )
    #define bFM3_CAN1_INTPND_INTPND13            *( ( volatile unsigned int * ) ( 0x42C61430UL ) )
    #define bFM3_CAN1_INTPND_INTPND14            *( ( volatile unsigned int * ) ( 0x42C61434UL ) )
    #define bFM3_CAN1_INTPND_INTPND15            *( ( volatile unsigned int * ) ( 0x42C61438UL ) )
    #define bFM3_CAN1_INTPND_INTPND16            *( ( volatile unsigned int * ) ( 0x42C6143CUL ) )
    #define bFM3_CAN1_INTPND_INTPND17            *( ( volatile unsigned int * ) ( 0x42C61440UL ) )
    #define bFM3_CAN1_INTPND_INTPND18            *( ( volatile unsigned int * ) ( 0x42C61444UL ) )
    #define bFM3_CAN1_INTPND_INTPND19            *( ( volatile unsigned int * ) ( 0x42C61448UL ) )
    #define bFM3_CAN1_INTPND_INTPND20            *( ( volatile unsigned int * ) ( 0x42C6144CUL ) )
    #define bFM3_CAN1_INTPND_INTPND21            *( ( volatile unsigned int * ) ( 0x42C61450UL ) )
    #define bFM3_CAN1_INTPND_INTPND22            *( ( volatile unsigned int * ) ( 0x42C61454UL ) )
    #define bFM3_CAN1_INTPND_INTPND23            *( ( volatile unsigned int * ) ( 0x42C61458UL ) )
    #define bFM3_CAN1_INTPND_INTPND24            *( ( volatile unsigned int * ) ( 0x42C6145CUL ) )
    #define bFM3_CAN1_INTPND_INTPND25            *( ( volatile unsigned int * ) ( 0x42C61460UL ) )
    #define bFM3_CAN1_INTPND_INTPND26            *( ( volatile unsigned int * ) ( 0x42C61464UL ) )
    #define bFM3_CAN1_INTPND_INTPND27            *( ( volatile unsigned int * ) ( 0x42C61468UL ) )
    #define bFM3_CAN1_INTPND_INTPND28            *( ( volatile unsigned int * ) ( 0x42C6146CUL ) )
    #define bFM3_CAN1_INTPND_INTPND29            *( ( volatile unsigned int * ) ( 0x42C61470UL ) )
    #define bFM3_CAN1_INTPND_INTPND30            *( ( volatile unsigned int * ) ( 0x42C61474UL ) )
    #define bFM3_CAN1_INTPND_INTPND31            *( ( volatile unsigned int * ) ( 0x42C61478UL ) )
    #define bFM3_CAN1_INTPND_INTPND32            *( ( volatile unsigned int * ) ( 0x42C6147CUL ) )
    #define bFM3_CAN1_INTPND1_INTPND1            *( ( volatile unsigned int * ) ( 0x42C61400UL ) )
    #define bFM3_CAN1_INTPND1_INTPND2            *( ( volatile unsigned int * ) ( 0x42C61404UL ) )
    #define bFM3_CAN1_INTPND1_INTPND3            *( ( volatile unsigned int * ) ( 0x42C61408UL ) )
    #define bFM3_CAN1_INTPND1_INTPND4            *( ( volatile unsigned int * ) ( 0x42C6140CUL ) )
    #define bFM3_CAN1_INTPND1_INTPND5            *( ( volatile unsigned int * ) ( 0x42C61410UL ) )
    #define bFM3_CAN1_INTPND1_INTPND6            *( ( volatile unsigned int * ) ( 0x42C61414UL ) )
    #define bFM3_CAN1_INTPND1_INTPND7            *( ( volatile unsigned int * ) ( 0x42C61418UL ) )
    #define bFM3_CAN1_INTPND1_INTPND8            *( ( volatile unsigned int * ) ( 0x42C6141CUL ) )
    #define bFM3_CAN1_INTPND1_INTPND9            *( ( volatile unsigned int * ) ( 0x42C61420UL ) )
    #define bFM3_CAN1_INTPND1_INTPND10           *( ( volatile unsigned int * ) ( 0x42C61424UL ) )
    #define bFM3_CAN1_INTPND1_INTPND11           *( ( volatile unsigned int * ) ( 0x42C61428UL ) )
    #define bFM3_CAN1_INTPND1_INTPND12           *( ( volatile unsigned int * ) ( 0x42C6142CUL ) )
    #define bFM3_CAN1_INTPND1_INTPND13           *( ( volatile unsigned int * ) ( 0x42C61430UL ) )
    #define bFM3_CAN1_INTPND1_INTPND14           *( ( volatile unsigned int * ) ( 0x42C61434UL ) )
    #define bFM3_CAN1_INTPND1_INTPND15           *( ( volatile unsigned int * ) ( 0x42C61438UL ) )
    #define bFM3_CAN1_INTPND1_INTPND16           *( ( volatile unsigned int * ) ( 0x42C6143CUL ) )
    #define bFM3_CAN1_INTPND2_INTPND17           *( ( volatile unsigned int * ) ( 0x42C61440UL ) )
    #define bFM3_CAN1_INTPND2_INTPND18           *( ( volatile unsigned int * ) ( 0x42C61444UL ) )
    #define bFM3_CAN1_INTPND2_INTPND19           *( ( volatile unsigned int * ) ( 0x42C61448UL ) )
    #define bFM3_CAN1_INTPND2_INTPND20           *( ( volatile unsigned int * ) ( 0x42C6144CUL ) )
    #define bFM3_CAN1_INTPND2_INTPND21           *( ( volatile unsigned int * ) ( 0x42C61450UL ) )
    #define bFM3_CAN1_INTPND2_INTPND22           *( ( volatile unsigned int * ) ( 0x42C61454UL ) )
    #define bFM3_CAN1_INTPND2_INTPND23           *( ( volatile unsigned int * ) ( 0x42C61458UL ) )
    #define bFM3_CAN1_INTPND2_INTPND24           *( ( volatile unsigned int * ) ( 0x42C6145CUL ) )
    #define bFM3_CAN1_INTPND2_INTPND25           *( ( volatile unsigned int * ) ( 0x42C61460UL ) )
    #define bFM3_CAN1_INTPND2_INTPND26           *( ( volatile unsigned int * ) ( 0x42C61464UL ) )
    #define bFM3_CAN1_INTPND2_INTPND27           *( ( volatile unsigned int * ) ( 0x42C61468UL ) )
    #define bFM3_CAN1_INTPND2_INTPND28           *( ( volatile unsigned int * ) ( 0x42C6146CUL ) )
    #define bFM3_CAN1_INTPND2_INTPND29           *( ( volatile unsigned int * ) ( 0x42C61470UL ) )
    #define bFM3_CAN1_INTPND2_INTPND30           *( ( volatile unsigned int * ) ( 0x42C61474UL ) )
    #define bFM3_CAN1_INTPND2_INTPND31           *( ( volatile unsigned int * ) ( 0x42C61478UL ) )
    #define bFM3_CAN1_INTPND2_INTPND32           *( ( volatile unsigned int * ) ( 0x42C6147CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL1             *( ( volatile unsigned int * ) ( 0x42C61600UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL2             *( ( volatile unsigned int * ) ( 0x42C61604UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL3             *( ( volatile unsigned int * ) ( 0x42C61608UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL4             *( ( volatile unsigned int * ) ( 0x42C6160CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL5             *( ( volatile unsigned int * ) ( 0x42C61610UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL6             *( ( volatile unsigned int * ) ( 0x42C61614UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL7             *( ( volatile unsigned int * ) ( 0x42C61618UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL8             *( ( volatile unsigned int * ) ( 0x42C6161CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL9             *( ( volatile unsigned int * ) ( 0x42C61620UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL10            *( ( volatile unsigned int * ) ( 0x42C61624UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL11            *( ( volatile unsigned int * ) ( 0x42C61628UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL12            *( ( volatile unsigned int * ) ( 0x42C6162CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL13            *( ( volatile unsigned int * ) ( 0x42C61630UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL14            *( ( volatile unsigned int * ) ( 0x42C61634UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL15            *( ( volatile unsigned int * ) ( 0x42C61638UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL16            *( ( volatile unsigned int * ) ( 0x42C6163CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL17            *( ( volatile unsigned int * ) ( 0x42C61640UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL18            *( ( volatile unsigned int * ) ( 0x42C61644UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL19            *( ( volatile unsigned int * ) ( 0x42C61648UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL20            *( ( volatile unsigned int * ) ( 0x42C6164CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL21            *( ( volatile unsigned int * ) ( 0x42C61650UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL22            *( ( volatile unsigned int * ) ( 0x42C61654UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL23            *( ( volatile unsigned int * ) ( 0x42C61658UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL24            *( ( volatile unsigned int * ) ( 0x42C6165CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL25            *( ( volatile unsigned int * ) ( 0x42C61660UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL26            *( ( volatile unsigned int * ) ( 0x42C61664UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL27            *( ( volatile unsigned int * ) ( 0x42C61668UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL28            *( ( volatile unsigned int * ) ( 0x42C6166CUL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL29            *( ( volatile unsigned int * ) ( 0x42C61670UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL30            *( ( volatile unsigned int * ) ( 0x42C61674UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL31            *( ( volatile unsigned int * ) ( 0x42C61678UL ) )
    #define bFM3_CAN1_MSGVAL_MSGVAL32            *( ( volatile unsigned int * ) ( 0x42C6167CUL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL1            *( ( volatile unsigned int * ) ( 0x42C61600UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL2            *( ( volatile unsigned int * ) ( 0x42C61604UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL3            *( ( volatile unsigned int * ) ( 0x42C61608UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL4            *( ( volatile unsigned int * ) ( 0x42C6160CUL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL5            *( ( volatile unsigned int * ) ( 0x42C61610UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL6            *( ( volatile unsigned int * ) ( 0x42C61614UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL7            *( ( volatile unsigned int * ) ( 0x42C61618UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL8            *( ( volatile unsigned int * ) ( 0x42C6161CUL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL9            *( ( volatile unsigned int * ) ( 0x42C61620UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL10           *( ( volatile unsigned int * ) ( 0x42C61624UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL11           *( ( volatile unsigned int * ) ( 0x42C61628UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL12           *( ( volatile unsigned int * ) ( 0x42C6162CUL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL13           *( ( volatile unsigned int * ) ( 0x42C61630UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL14           *( ( volatile unsigned int * ) ( 0x42C61634UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL15           *( ( volatile unsigned int * ) ( 0x42C61638UL ) )
    #define bFM3_CAN1_MSGVAL1_MSGVAL16           *( ( volatile unsigned int * ) ( 0x42C6163CUL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL17           *( ( volatile unsigned int * ) ( 0x42C61640UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL18           *( ( volatile unsigned int * ) ( 0x42C61644UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL19           *( ( volatile unsigned int * ) ( 0x42C61648UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL20           *( ( volatile unsigned int * ) ( 0x42C6164CUL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL21           *( ( volatile unsigned int * ) ( 0x42C61650UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL22           *( ( volatile unsigned int * ) ( 0x42C61654UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL23           *( ( volatile unsigned int * ) ( 0x42C61658UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL24           *( ( volatile unsigned int * ) ( 0x42C6165CUL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL25           *( ( volatile unsigned int * ) ( 0x42C61660UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL26           *( ( volatile unsigned int * ) ( 0x42C61664UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL27           *( ( volatile unsigned int * ) ( 0x42C61668UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL28           *( ( volatile unsigned int * ) ( 0x42C6166CUL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL29           *( ( volatile unsigned int * ) ( 0x42C61670UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL30           *( ( volatile unsigned int * ) ( 0x42C61674UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL31           *( ( volatile unsigned int * ) ( 0x42C61678UL ) )
    #define bFM3_CAN1_MSGVAL2_MSGVAL32           *( ( volatile unsigned int * ) ( 0x42C6167CUL ) )

    #ifdef __cplusplus
}
    #endif

#endif /* _MB9BF506N_H_ */
